game.import("extension",function(lib,game,ui,get,ai,_status){return {name:"混沌界",editable:false,content:function (config){
    // ---------------------------------------混沌势力------------------------------------------//
//守望先锋：
lib.group.push('shuchu');
lib.translate.shuchu='攻'; 
lib.translate.shuchu.Color="#b0d0e2";
lib.group.push('zhongzhuang');
lib.translate.zhongzhuang='御'; 
lib.translate.zhongzhuang.Color="#b0d0e2";
//英雄联盟：
lib.group.push('nuokesasi');
lib.translate.nuokesasi='诺'; 
lib.translate.nuokesasi.Color="#ffddb9";
lib.group.push('aiouniya');
lib.translate.aiouniya='艾'; 
lib.translate.aiouniya.Color="#ffddb9";
lib.group.push('fuleierzhuode');
lib.translate.fuleierzhuode='弗'; 
lib.translate.fuleierzhuode.Color="#b0d0e2";
lib.group.push('demaxiya');
lib.translate.demaxiya='德'; 
lib.translate.demaxiya.Color="#b0d0e2";
    // ---------------------------------------圣神将阵亡------------------------------------------//
lib.skill._混沌_圣神_dieaudio={
        trigger:{
            global:'dieBegin',
        },
        //direct:true,
        priority:100,
        forced:true,
        unique:true,
        charlotte:true,
        frequent:true,
        /*filter:function (event,player){
        return !event.player.isAlive();
        },*/
        content:function (){
            game.playAudio('..','extension','混沌界',trigger.player.name);
        },
    }
    //-------------------------------------------圣神法则-------------------------------------------------//
    //【圣神法则】：游戏开始时，若你的身份为“主公”，你减少一点体力值上限；你始终跳过判定阶段且不能成为延时锦囊牌的目标；每当你的回合开始时，弃置你判定区内的所有牌//
    
    lib.skill._混沌_圣神_faze={
                nobracket:true,
                delay:false,
                direct:true,
                trigger:{
                global:"gameStart",
                },
                unique:true,
                charlotte:true,
                priority:Infinity,
                filter:function (event,player){
                var ssj=new RegExp("圣神");
                return ssj.test(player.name);
                },
                forced:true,
                locked:true,
                content:function (event,player){
        if(lib.config.mode=='identity'&&player.isZhu&&player.maxHp>4){
                player.maxHp--;
                game.log('#y【圣神法则】','：',player,'无法受到','#b凡律','增益且无法受到','#b延时锦囊牌','的影响');
                player.update();
        }
        else{
            game.log('#y【圣神法则】','：',player,'无法受到','#b延时锦囊牌','的影响');
            player.update();
        }
    },
                mod:{
                    targetEnabled:function (card,player,target,now){
                    var ssj=new RegExp("圣神");
                if(get.type(card)=='delay'&&ssj.test(target.name)){
                return false;
            }
        },
                },
                group:"_混沌_圣神_faze_judge",
                subSkill:{
                judge:{
                trigger:{
                            player:"phaseBefore",
                        },
                        filter:function (event,player){
                var ssj=new RegExp("圣神");
                return ssj.test(player.name);
                },
                delay:false,
                direct:true,
                forced:true,
                locked:true,
                unique:true,
                charlotte:true,
                priority:Infinity,
                        content:function (){
                        player.chooseToDiscard('j',Infinity,true);
                        player.skip('phaseJudge');
    }
    },
                },
    }
    // -----------------------------------------------圣甲---------------------------------------------------//
    //【圣甲】：每当你即将受到伤害、失去体力、失去体力值上限时，若你拥有至少一层“圣甲”，则移除一层，防止此次效果//
    
    lib.skill._混沌_圣神_圣甲={
                intro:{
                    content:function (storage){
            if(storage>0) return '你当前拥有'+storage+'层“圣甲”';
            if(storage<0) return '你当前拥有'+storage+'层“圣甲”';
            return '你当前未拥有“圣甲”';
        },
                },
                init:function (player){
        player.storage._混沌_圣神_圣甲=0;
    },
                trigger:{
                    player:["damageBegin","loseHpBegin","loseMaxHpBegin"],
                },
                forced:true,
                direct:true,
                unique:true,
                popup:false,
                delay:false,
                priority:-100,
                filter:function (event,player){
        return event.num>0&&player.storage._混沌_圣神_圣甲>0;
    },
                content:function (){
        "step 0"
        player.storage._混沌_圣神_圣甲--;
        player.markSkill('_混沌_圣神_圣甲');
        player.syncStorage('_混沌_圣神_圣甲');
        "step 1"
        game.log(player,'移除了一层','#y【圣甲】','，防止了此次负面效果');
        trigger.cancel();
        "step 2"
        if(!player.storage._混沌_圣神_圣甲){
        player.unmarkSkill('_混沌_圣神_圣甲');
        }
    },
    }
    // -----------------------------------------------圣神包---------------------------------------------------//
    	if(config.混沌_SSB){
			game.addCharacterPack({
				character:{
				"混沌_圣神_caopix":["male","shen",4,["圣_fangzhu","圣_xingshang","圣_songwei"],["des:“燕歌储语天极行，逐流殇声颂威倾”——神曹丕 </br> </br>攻击：★★★☆☆ </br>防御：★★☆☆☆</br>过牌：★★★★☆ </br>辅助：★★★★☆</br>定位：内奸 </br>特点：前期受伤共损翻面控场、濒死收割恢复极强。中期储元逐级蓄爆，燕歌点缀隐忍差方。后期元储用处显露，登极天行肆虐全场！！！</br>缺点：前中期缺乏爆发力，无任何囤储手段，切记等到后期大残血的局面，才是圣神曹丕收割爆发的最好时机"]],
            
				"混沌_圣神_caoruix":["male","shen",4,["圣_huituo","圣_xingshuai","圣_mingjian"],["des:“吾曾推心置腹之人，反倒是成了最大的祸患”——神曹叡 </br> </br>攻击：★☆☆☆☆ </br>防御：★★★★☆</br>过牌：★★★☆☆ </br>辅助：★★★★☆</br>定位：主公 </br>特点：全员辅助机，受伤可令任意队友补血补牌补状态；垂危自保能力MAX，濒死时会根据你心腹角色数恢复体力；过牌辅助加BUFF，时间越久实力越强；生存能力极强，如果有位带有改判能力的心腹就更上一层楼；中后期处于危难关头时，可将核心牌用光殆尽后，留一张无用牌给予敌方求得自保退路</br>缺点：技能均需达成特定条件才可有明显收益；同时，每个技能也均有发动时或发动后的负面效果；生存能力极强的代价便是完完全全舍弃了进攻的手段；孤军奋战时极度疲惫，这种情况下可翻盘的概率微乎其微"]],
           
			 "混沌_圣神_mihengx":["male","shen",4,["圣_kuangwang","圣_jieao","圣_shejian"],["des:“这大千世界，早已被混沌所污染；这茫茫人心，也皆被阴暗所覆盖；既然如此，颠覆这个世界，又何尝不可呢”——神祢衡 </br> </br>攻击：★★★★★ </br>防御：★☆☆☆☆</br>过牌：★★★★★ </br>辅助：★☆☆☆☆</br>定位：内奸 </br>特点：无视距离与使用牌数限制；使用牌后立即补牌的能力；一张牌原地起爆的实力；他的技能简单粗暴，拼点成功后即可开启灭世的协奏曲；他的伤害令人咋舌，无视“混沌世界”的规则；他是混沌之界中当之无愧的最强圣神</br>缺点：没有谁是完美无缺的，拥有极致的进攻能力势必会完全失去自身的防御；回合内猖狂至极换来的就是回合外的不堪萎靡；没有任何防御手段不说，想要进攻也需拼点胜利才可进行。杀人之后的反馈，虽有了继续进攻的手段，但却是以命换之，且行且珍惜"]],
          
		  "混沌_圣神_liuchenx":["male","shen",4,["圣_zhanjue","圣_qinjin","圣_ziwen"],["des:“我从来没有为当时的决定而后悔过。宁可战死于人前，绝不屈服于人下”——神刘谌 </br> </br>攻击：★★★★★ </br>防御：★★★☆☆ </br>过牌：★★★★★ </br>辅助：☆☆☆☆☆</br>定位：主公 </br>特点：强命菜刀流的代表，以命搏命，巨额过牌，觉醒后对有牌角色可以过牌无损决斗，利用无牌角色过牌并造成巨额持续伤害，抓住机会一波即可秒人平推，残局收割之王！ </br>缺点：技能均需失去体力才可释放，以命搏命来换取收益，合理利用技能Combo才是重中之重；觉醒后虽然可以利用无牌角色或手中的【杀】进行过牌，稳定性略高，但总归损失了巨额过牌的能力；觉醒时机虽可利用技能联动但也略显残酷。想要觉醒，也需给自己留条后路。否则就真的是昙花一现了"]],
            
		  "混沌_圣神_caiwenjix":["female","shen",4,["圣_lige","圣_bingxin","圣_qianying"],["des:“心如寒玉，泪如冰”——神文姬 </br> </br>攻击：★☆☆☆☆ </br>防御：★★★★☆ </br>过牌：☆☆☆☆☆ </br>辅助：★★★★★</br>定位：忠臣 </br>特点：专属被动技能效果、高额补给、基本稳定免死效果 </br>缺点：频繁释放技能需大量牌数支撑，很容易成为集火目标"]],
           
		  "混沌_圣神_huangyueyingx":["female","shen",4,["圣_lingxie","圣_mocai","圣_linglong"],["des:“天工之作，神造之物，亦可为我所用”——神月英 </br> </br>攻击：★★☆☆☆ </br>防御：★★☆☆☆</br>过牌：★★★★☆ </br>辅助：★★★★☆</br>定位：反贼 </br>特点：善用装备可灵巧废除敌方装备栏；回合内外均可大量过牌；延时锦囊牌可控场控血线；拥有一定的防御与生存；（小技巧：在使用技能前可先装备上额外触发技能获得“圣甲”哦）</br>缺点：技能释放均需消耗大量关键核心非基本牌；想要封印装备栏也需弃置装备牌才可进行；无对应牌时亦如4血白"]],
		  
		  "混沌_圣神_guanyinpingx":["female","shen",4,["圣_xueji","圣_huxiao","圣_hunji"],["des:“这炙热的鲜血，便是结束你生命的烈焰”——神银屏 </br> </br>攻击：★★★★☆ </br>防御：★★☆☆☆ </br>过牌：★☆☆☆☆ </br>辅助：☆☆☆☆☆</br>定位：反贼 </br>特点：强命换取buff增幅、无牌限制爆炸输出，觉醒后稳定武器或恢复 </br>缺点：防御略低，若简易触发技能需卖血"]],
          
		  "混沌_圣神_diaochanx":["female","shen",4,["圣_meixin","圣_tianzi","圣_yueying"],["des:“月影，自独舞；冷眼，观乱世”——神貂蝉 </br> </br>攻击：★★★★★ </br>防御：★★★★☆ </br>过牌：★★★★★ </br>辅助：★★★☆☆</br>定位：内奸 </br>特点：大幅度削减敌方当前状态、大量过牌并无法抵挡的进行操控、强制混乱中的决斗不可避免的出现伤亡、自身稳定恢复 </br>缺点：最为强大的借刀杀人手法而造成的巨额负面收益也不可忽视、使用技能后的一轮回合外就犹如案板上的刀俎鱼肉一般，对于时机的把控决定了是否可以成功的前提"]],
           
		  "混沌_圣神_jiangweix":["male","shen",4,["圣_tiaoxin","圣_youlin","圣_longyi"],["des:“天水幼麟复龙遗”——神姜维 </br> </br>攻击：★★★☆☆ </br>防御：★★★☆☆</br>过牌：★★★☆☆ </br>辅助：★☆☆☆☆</br>定位：反贼 </br>特点：觉醒前双刀强命下装备，圣甲反伤命顽强。觉醒后高额过牌控顶控全场。技能联动强命过牌完美Combo(小提示，觉醒后的可以用【天星】的控顶效果放置第一张“点数大”与第二张“黑颜色”的牌来实现【孤伐】的完美释放(也要时刻注意不要被别人动了牌堆顶))</br>缺点：所有技能均可带来负面性效果。所有技能均有联动环环相扣，每个技能都需要你来“赌一赌”。觉醒后技能对操作与大局观要求极为重视，上限极高的同时下限也低到离谱。如何合理使用技能那就是一个很大的问题了"]],
         
		  "混沌_圣神_lvbux":["male","shen",4,["圣_liqu","圣_wushuang","圣_shenyu"],["des:“凡人们，颤抖吧，我将为你们划上人生的句号”——神吕布  </br>  </br>攻击：★★★★★ </br>防御：★★★☆☆ </br>过牌：★★☆☆☆ </br>辅助：☆☆☆☆☆ </br>定位：反贼 </br>特点：多杀多决斗、血量优势、觉醒后快速清场 </br>缺点：血量上限可以视为血量，既是优势，也是劣势"]],
          
		  "混沌_圣神_zhugedanx":["male","shen",4,["圣_gongao","圣_juemo","圣_juyi"],["des:“为了日后充斥光明的未来，必须接受黑暗肮脏的现在”——神诸葛诞  </br>  </br>攻击：★★☆☆☆ </br>防御：★★★☆☆ </br>过牌：★★★★☆ </br>辅助：☆☆☆☆☆ </br>定位：内奸 </br>特点：觉醒前以牺牲体力值+进攻距离换取防御距离，鹬蚌相争，渔翁得利。自动觉醒无需刻意卖血。随着时间的推移，实力越来越强</br>缺点：极其怕被针对；觉醒后必须速战速决，否则随着时间的推移实力会越来越弱，到最后连如何保住自身的安危也是一种难以解决问题"]],
        
		  "混沌_圣神_jiaxux":["male","shen",4,["圣_luanwu","圣_weimu","圣_wansha"],["des:“哀求吧！挣扎吧！在这混沌的乱世中沉沦吧”——神贾诩 </br> </br>攻击：★★★☆☆ </br>防御：★★★★☆</br>过牌：★★☆☆☆ </br>辅助：☆☆☆☆☆</br>定位：反贼 </br>特点：弃置一张杀即可开始混沌的乱武，一杀N收益；限定技的可刷新性，在其他角色的身份均没有展露怯生生的不敢动手时收益最高；完全防御其他角色黑色牌的能力，整副牌堆中70%的进攻牌均对你无效且你可收入囊中加以利用；绝命的完杀，无法破解的诅咒。给予那些死不瞑目的角色最后的反抗。带着满腔怨气的即逝者于生命最后的挣扎异常的恐怖</br>缺点：技能均为无差别式攻击；完全没有任何可以稳定辅助的手段；在友方即将杀死敌人逆转战局时，一次毫无征兆的完杀极有可能瞬间逆转原本充满希望的对局"]],
           
		  "混沌_圣神_zhugeguox":["female","shen",4,["圣_qirang","圣_yuhua","圣_xianchen"],["des:“神与仙，仙与神，皆为世所创。仙神本所同，何故斥何拥”——神诸葛果 </br> </br>攻击：★★☆☆☆ </br>防御：★★★★★</br>过牌：★★★★☆ </br>辅助：★☆☆☆☆</br>定位：内奸 </br>特点：锦囊、装备、延时三者的无损转化、大量的过牌给予了大量不同的选择、每回合至多四层且可累积的极高额圣甲带来了几近“无敌”的防御、每回合结束后的额外不稳定收益可通过技能Combo自行控制，其“纤尘牌库”中存在的多张AOE伤害卡牌可在瞬间融化全场，即便失败，其负面效果也可与“圣甲”所抵消，换取一张稳定的额外的♥️卡牌收益</br>缺点：技能均所存在多种限制，释放难度较高，且需你时刻注意牌堆控顶，技能释放手段花样繁多，完全无法进行无脑操作，稍有不慎，强度便会低到无法想象"]],
         
		  "混沌_圣神_zhangxingcaix":["female","shen",4,["圣_qiangwu","圣_shenxian","圣_luange"],["des:“吾承父魂，踏碎天循”——神星彩 </br> </br>攻击：★★★★☆ </br>防御：★★☆☆☆ </br>过牌：★★★★☆ </br>辅助：★★☆☆☆</br>定位：反贼 </br>特点：多种不同用【杀】效果、独特的纳牌技巧可稳定无伤大量过牌、手中永远有牌的优势</br>缺点：技能效果难以操控，若是要熟练使用多种不同的效果需要极其丰厚的熟练度支持；极其害怕爆发武将"]],
           
		  "混沌_圣神_zhaoyunx":["male","shen",4,["圣_nijing","圣_longhun","圣_longying"],["des:“要变天了，是时候，回归圣神界了”——神赵云 </br> </br>攻击：★★★☆☆ </br>防御：★★★☆☆ </br>过牌：★★★☆☆ </br>辅助：★★★☆☆</br>定位：反贼 </br>特点：高额牌量与使用效果，技能连贯释放可无损做出他人无法比拟的逆天效果</br>缺点：非常的依靠牌运与对卡牌的掌控"]],
           
		  "混沌_圣神_xiahouyuanx":["male","shen",4,["圣_shensu","圣_leili","圣_jixi"],["des:“区区暗隐鼠辈，也配得你们如此大动干戈？”——神夏侯渊 </br> </br>攻击：★★★★★ </br>防御：☆☆☆☆☆ </br>过牌：★☆☆☆☆ </br>辅助：☆☆☆☆☆</br>定位：反贼 </br>特点：回合内无损三刀稳定爆炸输出，回合外翻面摸牌追加伤害</br>缺点：毫无任何防御手段，无法使用【杀】也注定了与连弩清场无缘。也需合理利用技能，若翻不回来则会浪费大把的输出能力"]],
         
		  "混沌_圣神_guojiax":["male","shen",4,["圣_tiance","圣_shenmou","圣_yishi"],["des:“棋盘已开启，九“弈”已献祭。赌上性命的博弈，是生是死，自有天意”——神郭嘉 </br> </br>攻击：★★★☆☆ </br>防御：★★★★☆</br>过牌：★★★★★ </br>辅助：★★★★★</br>定位：忠臣 </br>特点：打破传统观念的卖血辅助流；前期略微收益高稳定，后期收益爆炸神级过牌；全场判定结果牌无损获得；核心锦囊一网打尽；技能Combo弥补弱势；如若你的运气够棒，一张锦囊连用11次不再是梦！</br>缺点：打破传统观念的卖血辅助技，通过“高给予高蚕食高回报”的方式来进行辅助；核心技能带来的负面效果着实令人惊悚，在没有稳定判定能力下请酌情使用"]],
           
		  "混沌_圣神_guotupangjix":["male","shen",4,["圣_jigong","圣_dihui","圣_shifei"],["des:“倘若汝等尽力，何愁三界不安”——神郭逄 </br> </br>攻击：★★★☆☆ </br>防御：★★★☆☆ </br>过牌：★★★★★ </br>辅助：★☆☆☆☆</br>定位：反贼 </br>特点：高额过牌，控场被动技，每回合固定高收益</br>缺点：神郭逄并没有什么主动进攻的手段，但却需伤害点数，合理利用技能，无脑冲锋只会让自己身处绝境"]],
            
		  "混沌_圣神_zhangchunhuax":["female","shen",4,["圣_jueqing","圣_wuxin","圣_shangshi"],["des:“尘世间的冷暖，与我再无半点瓜葛”——神春华 </br> </br>攻击：★★★☆☆ </br>防御：★★★☆☆ </br>过牌：★★★★★ </br>辅助：★☆☆☆☆</br>定位：反贼 </br>特点：天克奶爸奶妈的绝情，高额过牌，无视卖血技能的真实伤害</br>缺点：无差别技能效果注定会导致队友一并中招，自己也需随时处于受伤状态才可触发技能"]],
          
		  "混沌_圣神_caojiex":["female","shen",4,["圣_shouxi","圣_yaze","圣_huimin"],["des:“吾心与民共患难”——神曹节 </br> </br>攻击：★☆☆☆☆ </br>防御：★★★★★ </br>过牌：★★★★☆ </br>辅助：★★★★☆</br>定位：主公 </br>特点：超高防御能力，大量过牌，恢复体力值后可解除负面状态 </br>缺点：可展示的卡牌总量仅于此，不合理使用只会让自己成为他人的盘中餐"]],
            
		  "混沌_圣神_suncex":["male","shen",4,["圣_jiang","圣_yingyang","圣_hunshang"],["des:“吾曾随父征战沙场，开拓江东我吴大业，建立社稷，护佑人民。但最终，所有的一切皆化为泡影……往事不堪回首，只有历经过生死轮回，归于神袛，才会懂得什么才是真正的……“活着””——神孙策 </br> </br>攻击：★★★★☆ </br>防御：★★★☆☆</br>过牌：★★★★☆ </br>辅助：★★★☆☆</br>定位：主公 </br>特点：杀或被杀均可强行拆牌过牌、一杀无限用、一决斗无限拆、拼点失败时增加体力值上限并令下次拼点时可掠夺对方点数、觉醒后每回合高额过拆牌并伴随着无限制增加的手牌上限蓄爆，时间越久越是恐怖。二觉之后所有角色的血量将似虚拟一般不堪一击，觉醒后若依旧“圣甲”附体可无损强压敌方血线</br>缺点：技能所带来的拼点效果的同时也会令自身被“拆牌”，伤敌一千自损八百。觉醒后体力值上限锁定为1，这就注定了你于“恢复体力值”此项无缘。并且，体力值上限一旦低于安全性后就会出现各种各样且异常恐怖的危险。想要完全觉醒的难度非比寻常，可遇不可求"]],
        
    "混沌_圣神_fuhuanghoux":["female","shen",4,["圣_huangkong","圣_youjin","圣_qiuyuan"],["des:“吾宁愿抛却神职，永堕无相地狱，忍受常人无法承受之苦，永世不得超生，也不会……放过曹贼”——神伏皇后 </br> </br>攻击：★☆☆☆☆ </br>防御：★★☆☆☆</br>过牌：★★★★☆ </br>辅助：★★★★☆</br>定位：反贼 </br>特点：多项连带效果，免疫大量非近身伤害，强行连带敌方同时受伤；技能均偏向多人场辅助，人数越多作用越大。技能触发后各种强大的限制能力会令敌方苦不堪言</br>缺点：人数越多越强，反之亦然。在孤军奋战或1v1决斗时完完全全沦为了一个4血负面技白板"]],
          
		  "混沌_圣神_guanpingx":["male","shen",4,["圣_longyin","圣_longyix","圣_rongzheng"],["des:“父亲，儿愿随您护佑蜀汉”——神关平 </br> </br>攻击：★★★☆☆ </br>防御：★★☆☆☆</br>过牌：★★★★☆ </br>辅助：★★★★★</br>定位：忠臣 </br>特点：进可攻退可守，自带群体连弩，群体卡牌增幅，超高抗杀保护</br>缺点：怕断闪，因技能特性需注意局势合理使用"]],
        
		  "混沌_圣神_pangtongx":["male","shen",4,["圣_huanyu","圣_tianyu","圣_niepan"],["des:“水镜先生曾言，卧龙凤雏二者得一可安天下！现在，是时候出手了”——神庞统 </br> </br>攻击：★★★☆☆ </br>防御：★★★☆☆</br>过牌：★☆☆☆☆ </br>辅助：★★☆☆☆</br>定位：反贼 </br>特点：进可连环爆炸伤害，退可连环保佑平安，专属被动效果，铁索天狱静待炙炎</br>缺点：不分敌我的连环效果需要你谨慎选择技能效果，输赢尽在一念之间"]],
      
		  "混沌_圣神_xinxianyingx":["female","shen",4,["圣_zhongjian","圣_dongcha","圣_caishi"],["des:“世间纷乱，吾以明眸洞察；清哲独身，不为他人所牵”——神宪英 </br> </br>攻击：★★★☆☆ </br>防御：★★★★★ </br>过牌：★★★★☆ </br>辅助：☆☆☆☆☆</br>定位：主公 </br>特点：每回合稳定观牌，一牌多收益，防御能力超标 </br>缺点：同时暴露手牌的特点无法避免，才识带来收益的同时提供的负面效果也不容忽视，孤军奋战时异常疲惫"]],
        
		  "混沌_圣神_zhenjix":["female","shen",4,["圣_luoshen","圣_fanghua","圣_xishui"],["des:“你已不为帝，我已不为后，可为何你还是不肯忘却那些过往呢”——神甄姬 </br> </br>攻击：★☆☆☆☆ </br>防御：★★★★☆</br>过牌：★★★★☆ </br>辅助：★★☆☆☆</br>定位：反贼 </br>特点：准备阶段大量揽牌，运气差也可翻面控场，大部分时间皆无需担心被杀</br>缺点：魏国翻面武将异常之多，被动容易被他人利用或误伤友军"]],
      
		  "混沌_圣神_zhaoxiangx":["female","shen",4,["圣_longmai","圣_fanghun","圣_fuhan"],["des:“以吾之龙脉，振兴大汉”——神赵襄 </br> </br>攻击：★★★☆☆ </br>防御：★★★☆☆</br>过牌：★★★☆☆ </br>辅助：☆☆☆☆☆</br>定位：内奸 </br>特点：每回合额外获得一张杀闪，攻守兼备联动过牌；后期觉醒额外获得技能加持；一定概率开局觉醒接管全场节奏。技能与体力值息息相关，体力值越低弃置牌数越少，但推荐在使用技能前要率先用光非基本牌才更合适</br>缺点：技能均需造成伤害才可使用，没有良好的开局就没有后续的输出，没有印记的神赵襄无异于4血白板"]],
          
		  "混沌_圣神_simayix":["male","shen",4,["圣_guicai","圣_fankui","圣_baiyin"],["des:“智晓天地，谋定天下”——神司马懿 </br> </br>攻击：★★★☆☆ </br>防御：★★★☆☆</br>过牌：★★★★☆ </br>辅助：★★★☆☆</br>定位：内奸 </br>特点：觉醒前受伤拿牌，无损改判高收益，觉醒后全属性升华</br>缺点：觉醒条件略难，觉醒后无改判能力与收益，需把握局势合理选择是否觉醒"]],
       
		  "混沌_圣神_xiahoudunx":["male","shen",4,["圣_xuanlie","圣_danmu","圣_hunyong"],["des:“啖目煞九州，烈魂震天下”——神夏侯惇 </br> </br>攻击：★★★☆☆ </br>防御：★★★★☆</br>过牌：★★★☆☆ </br>辅助：★★☆☆☆</br>定位：反贼 </br>特点：受伤前可判定免伤或弃置伤害来源的卡牌， 拥有“啖”印记后技能可联动且升华，逆境有时候可以瞬间拯救队友扭转残局</br>缺点：虽可进行辅助但不动白的武将属性着实不适合做忠臣"]],
       
		  "混沌_圣神_liushanx":["male","shen",4,["圣_fangquan","圣_xiangle","圣_ruoyu"],["des:“生前的懦弱，不过是障眼之法。可惜，最终世界的走向还是没有按照吾的想法进行。历史只会记住胜利者，以后的日子，我会让凡人见识到我真正的一面”——神刘禅 </br> </br>攻击：★★★☆☆ </br>防御：★★★★☆</br>过牌：★★★★☆ </br>辅助：★★★★☆</br>定位：主公 </br>特点：逐步增级的过牌替换回合、无视所有杀的顶级防御、觉醒使命逆天而行。在你想要〖放权〗时，前期开局首回合可以随意交给近身其他角色一张杀测试身份，中期主要选择已受伤的队友令自身快速觉醒。觉醒后交出“贡品”的目标最好选择没名敌方角色一次。或者交给大残血的队友助其回血恢复。前期藤甲神器，中期八卦阵，后期匡扶汉室接管比赛</br>缺点：觉醒前极其依赖强势的队友，在孤军作战时将毫无还手之力"]],
		  "混沌_圣神_liushanx_hanxing":["male","shen",1,[],["unseen"]],
         
		  "混沌_圣神_huanggaix":["male","shen",4,["圣_kurou","圣_yanzhan","圣_zhaxiang"],["des:“焰血奋战，死亦无妨”——神黄盖 </br> </br>攻击：★★★★☆ </br>防御：★★☆☆☆</br>过牌：★★★★☆ </br>辅助：☆☆☆☆☆</br>定位：反贼 </br>特点：随时原地起爆的实力，稳定必中的攻击，以命搏命的手段</br>缺点：爆发很高，但是防御很低，回合外基本等于4血白"]],
        
		  "混沌_圣神_wangjix":["male","shen",4,["圣_qizhi","圣_zhuchang","圣_jinqu"],["des:“声东击西，智定千里”——神王基 </br> </br>攻击：★★☆☆☆ </br>防御：★★★☆☆</br>过牌：★★★★★ </br>辅助：★★★★★</br>定位：反贼 </br>特点：全员制衡互弥互补、无损观看全场明牌、下装备换手牌技能combo无损获得、变相的增加大量手牌上限</br>缺点：核心技能的负面效果虽可自行卖血联动技能，但也极大程度地限制了对他人的辅助效果，每释放一次便需承受失去一点体力值的巨额代价；如果你要尽快触发〖进趋〗，最快的方法便是多次释放〖奇制〗以压低自身的血线，但压低血线后的不稳定性则会大大增加，是静待多次回合承受伤害被动逐流，还是自行联动尽早释放，这需你自己细致斟酌拿捏收益。切记，心急吃不了热豆腐，不要压低血线后却连技能的释放条件都无法达成，到那时才是真正的赔了夫人、又折兵！"]],
           
    "混沌_圣神_beimihux":["female","shen",4,["圣_zongkui","圣_guju","圣_baijia"],["des:“圣神殿堂，终将成为我的宝座”——神卑弥呼 </br> </br>攻击：★★☆☆☆ </br>防御：★★★★☆</br>过牌：★★★★☆ </br>辅助：★★☆☆☆</br>定位：内奸 </br>特点：全面控场、傀儡过牌、看准时机也可给予队友几枚“傀”印记，合理利用“傀”印记可令一牌多收益</br>缺点：因技能均围绕“傀儡”进行，因此，场上无“傀儡”时可以做的事情微乎其微、蚀骨之疽的最大用途略微偏向防御，切不可大意莽撞，稳定蓄爆才是重中之重"]],
        
		  "混沌_圣神_zhonghuix":["male","shen",4,["圣_quanji","圣_yexin","圣_baijiang"],["des:“金鳞，岂是池中之物”——神钟会 </br> </br>攻击：★★★☆☆ </br>防御：★★☆☆☆</br>过牌：★★★★☆ </br>辅助：☆☆☆☆☆</br>定位：内奸 </br>特点：受伤过牌抢装备，觉醒时大量过牌，觉醒后技能Combo伤害爆炸</br>缺点：觉醒前仅为负面技不动白，技能均围绕卖血进行，整体强度略低"]],
          
		  "混沌_圣神_zhoutaix":["male","shen",4,["圣_fenji","圣_qingluo","圣_hunqu"],["des:“区区暗影杂碎，休想过我这关”——神周泰 </br> </br>攻击：★★☆☆☆ </br>防御：★★☆☆☆</br>过牌：★★★☆☆ </br>辅助：★★★★☆</br>定位：内奸 </br>特点：自带回血防具与-1坐骑；大量过牌时机；3/4概率的不死魂躯</br>缺点：封印自身装备栏，损失了太多可能；自身与其他角色-1，更容易成为集火目标"]],
            
		  "混沌_圣神_sunquanx":["male","shen",4,["圣_quanheng","圣_yuanju","圣_juelue"],["des:“吾曾纵横捭阖孤身已多年，又怎会被感情所束缚不前”——神孙权 </br> </br>攻击：★★★☆☆ </br>防御：★★★☆☆</br>过牌：★★★★★ </br>辅助：★★★☆☆</br>定位：主公 </br>特点：极致的单体大量过牌；掌控全局的整合手段；三种时期的觉醒切换；东吴的标志便是过牌能力，那么东吴大帝的实力又怎会疲软。觉醒前混沌界的过牌，逆境恢复体力的不屈姿态；觉醒后，睿智的少年与贪暴的年迈各有千秋。先礼后兵的智略与无视礼节的暴戾产生极大的反差。无论怎样，这一切的努力，都是为了让最终的胜利，变得唾手可得</br>缺点：三种时期不同的技能除了过牌以外几乎完全没有相似之处；对于局势的变动如何以合理的姿态面对才是重中之重。熟练掌握所有技能的使用时机，不要让“先礼后兵”变成“仅赠礼不出兵”，不要让“暴戾”变成了“昏庸”的代名词"]],
          
		  "混沌_圣神_lvmengx":["male","shen",4,["圣_qianxin","圣_mohua","圣_fanyin"],["des:“忍一时风平浪静，若忍无可忍，那便无需再忍”——神吕蒙 </br> </br>攻击：★☆☆☆☆ </br>防御：★★★★★ </br>过牌：★★★★☆ </br>辅助：★★★☆☆ </br>定位：内奸 </br>特点：牺牲自身体力以用来无视弃牌阶段 ，回合外大量过牌，觉醒后可瞬间将目标的防御削弱至极致，掌控全局！</br>缺点：觉醒前无作战能力，怕偷牌，逐渐不稳定崩坏"]],
          
		  "混沌_圣神_caocaox":["male","shen",4,["圣_jianxiong","圣_baquan","圣_weiwu"],["des:“吾之子，随我一同前去，清扫杂碎”——神曹操 </br> </br>攻击：★★★☆☆ </br>防御：★★★☆☆</br>过牌：★★★★★ </br>辅助：★★★☆☆</br>定位：主公 </br>特点：受伤亦可拉牌反制，拖敌方下水、观看手牌无损用闪拉牌差、技能Combo觉醒时瞬间造成巨大牌差、觉醒后对女性武将可辅可攻、进攻防御距离自主选择、体力变动大量过牌加剧全场差异</br>缺点：觉醒技无差别攻击式，请合理使用技能打出Combo制造觉醒时机、觉醒后若场上无女性武将则无异于失去一件技能"]],
          
		  "混沌_圣神_wolong_zhugeliangx":["male","shen",4,["圣_qixing","圣_bagua","圣_jinnang"],["des:“巧用锦囊妙计，方可一招制敌”——神卧龙 </br> </br>攻击：★★★☆☆ </br>防御：★★★☆☆ </br>过牌：★★★★☆ </br>辅助：★★★★☆</br>定位：反贼 </br>特点：开局高额优势、有输出有防御 </br>缺点：巧用锦囊，也需巧控牌数"]],
            
		  "混沌_圣神_xizhicaix":["male","shen",4,["圣_chouce","圣_tianji","圣_xianfu"],["des:“天意无常，人所羸弱。凡人的力量终究是太过于渺小，与茫茫众生比起来，再大的努力，也不过是沧海一粟，忠心于一人的誓言，此时显得是那么的可笑。若想造福天下苍生，纵使为神，也需求得同盟、与庇护”——神戏志才 </br> </br>攻击：★★☆☆☆ </br>防御：★★★☆☆</br>过牌：★★★★★ </br>辅助：★★★★★</br>定位：忠臣 </br>特点：全局多次的辅助、一血多次的过牌、频繁触发的技能联动。每一位友方或敌方的角色都会是你“寄生”的资本，永远不要让自己的手中缺少恢复牌。若是有幸遇到了一位具有充分恢复能力的“宿主”，那接下来便可以肆无忌惮的展露你那异常恐怖的能力了(小提示：开局时卖血判黑筹策便可展现出1血换7血+7牌的恐怖实力)</br>缺点：多次的易伤带来的就是极度脆弱不堪的身板，虽可多次多效的造成效果，但也请时刻留意着场上的局势"]],
		  
		  "混沌_圣神_zhangjiaox":["male","shen",4,["圣_leiyu","圣_shenshu","圣_cangdao"],["des:“天雷滚滚，净涤邪秽！霆怒之下，万物生灵皆化为焦土”——神张角 </br> </br>攻击：★★★★☆ </br>防御：★★☆☆☆</br>过牌：★★★★☆ </br>辅助：☆☆☆☆☆</br>定位：主公 </br>特点：相安则无事，触逆则迸发，一旦找到机会打开“雷狱”的大门，那便是万物哀嚎、生灵涂炭。循序渐进的霆雷犹如温水煮青蛙，即便你在其面前俯首跪拜一遍一遍的在内心中祈祷苍道神术的护佑，但那不但不会得到上苍的怜悯，还会连带着祸及家乡，最终只能在一次次的落雷中伴随着无尽的悔恨堕入阴森无际的雷狱……</br>缺点：虽可在特定情况联动技能强行打开“雷狱”的大门肆虐苍生，但终究还是需要有他人所创造的契机。若是被他人多次针对，那便再无还手之力"]],
		  
		  "混沌_圣神_maliangx":["male","shen",4,["圣_yingyuan","圣_zishu","圣_naman"],["des:“言多必有失，行多必有过。掌握住那条仅属于自己的路线，才能不因他人的行为而被动的前进”——神马良 </br> </br>攻击：★☆☆☆☆ </br>防御：★★★☆☆</br>过牌：★★★★★ </br>辅助：★★★★★</br>定位：反贼 </br>特点：每回合稳定多人极大过牌，手牌质量置换能力一流，以伤换伤搏天命的自保手段，拥有原地一牌起爆一穿七的绝对实力，团体补牌机，节奏创造者</br>缺点：进攻手段有限且全部需要依靠仅有的进攻牌。回合内外强度两极分化严重，大型节奏点并不是那么常见，虽可创造并挑起纷争但全局总体打法走向还是偏较于辅助队友，孤身奋战时能力严重受限"]],
		  
		  "混沌_圣神_hetaihoux":["female","shen",4,["圣_qiluan","圣_zhendu","圣_zhenjiu"],["des:“这杯酒，就当作是你生命中，最后的饯别礼——神何太后 </br> </br>攻击：★★★★☆ </br>防御：★★★☆☆</br>过牌：★★☆☆☆ </br>辅助：★★☆☆☆</br>定位：内奸 </br>特点：可辅可攻可斩残，独揽酒权的至高势力，无视酒杀反抽牌，众生皆灾而祸不及身，技能Combo收益爆炸</br>缺点：略微尴尬的辅助能力，对于整个友方来讲，想要辅助其实现酒杀收益则需要要消耗两张牌与一滴血的巨额代价，无差别攻击的劣势显而易见，很容易令原本就不美满的局面变得岌岌可危"]],
		  
		  "混沌_圣神_dongzhuox":["male","shen",4,["圣_hanyin","圣_baolian","圣_baling"],["des:“吾意乃圣言！吾意乃天诏！这天下无人胆敢忤逆本尊之猖獗！纵然成神，本尊也要做那天下独一的魔神！圣神的法则？迟早要由本魔神所改写！哈哈哈哈哈哈哈哈哈哈”——神董卓 </br> </br>攻击：★★★★★ </br>防御：☆☆☆☆☆</br>过牌：★★★☆☆ </br>辅助：☆☆☆☆☆</br>定位：主公 </br>特点：凶狠残暴的掠夺手段，独霸威欲的强命攻击，霸道狠獗的强伤反伤，嗜杀成性的技能定位</br>缺点：开局时毫无自保手段，成长式技能的缺点显而易见，以命换命的防御方式，绝对无解的霸道伤害所牺牲的就是全部的防御能力，在没有成长完毕的时候最高的上限也就只有反伤带走四名脆皮敌人"]],
		  
		  "混沌_圣神_machaox":["male","shen",4,["圣_tieji","圣_xunxi","圣_lveji"],["des:“为什么总是有人不愿放弃生凭的过往呢？宿命？可笑的东西”——神马超 </br> </br>攻击：★★★★★ </br>防御：☆☆☆☆☆</br>过牌：★★★☆☆ </br>辅助：☆☆☆☆☆</br>定位：反贼 </br>特点：纯粹的进攻，无任何后退的余地，攻击强命、无视防具、杀人抢牌、封印技能、绝对强伤、无视距离、一杀多收益……神马超的所有技能带来的效果仿佛就是一个字---“杀”！</br>缺点：神马超的优点很耀眼，缺点更是触目惊心。技能联动需对自己强行造成伤害，所有技能也均围绕“杀”与“血量”进行，没了杀之后的残血神马超，完完全全没有任何反抗的余地。没有任何防御的能力却很需要持续保持在低血线以获得最高效率，这无意义虎口拔牙，虽收益极高，但同时风险极大"]],
		  
		  "混沌_圣神_sunshangxiangx":["female","shen",4,["圣_xiaoyuan","圣_xiaoji","圣_liangzhu"],["des:“如若此生注定与君无缘，那便待来世再与夫君相恋。身逢乱世，纵使身不由己，妾身也愿生生世世陪伴在君的身边”——神尚香 </br> </br>攻击：★★☆☆☆ </br>防御：★★★☆☆</br>过牌：★★★★☆ </br>辅助：★★★★★</br>定位：忠臣 </br>特点：装备过牌高额收益，随结缘次数所增长的额外摸牌数，随时随地助援或自己蹭摸牌，可灵活运用技能赠送友方核心装备或给予敌方负收益装备替换高收益装备并蹭取高额效果</br>缺点：辅助的通病---依赖队友。虽说可以通过赠送敌方低价值装备来达到结缘，但总归会让敌方得到一定收益。无装备时存在感异常低廉"]],
		  
		  "混沌_圣神_madaix":["male","shen",4,["圣_qianxi","圣_mdzhanjue","圣_chengmou"],["des:“心狠手辣斩草除根，不要留下任何可以威胁到自己的火种”——神马岱 </br> </br>攻击：★★★★★ </br>防御：☆☆☆☆☆</br>过牌：★☆☆☆☆ </br>辅助：☆☆☆☆☆</br>定位：反贼 </br>特点：马氏家族标准反贼头目；单体无视距离、伪强命、斩上限、制造斩杀机会；与其兄无异，神马岱的技能均围绕着“斩”上限进行。因其技能特性，绝境关头可鱼死网破选择牺牲队友一定量的体力值上限创造翻盘机会</br>缺点：与其兄无异，马氏家族的技能均围绕着“杀”展开。断杀废等通病依旧适用于神马岱。同时，核心效果但却无差别攻击的负面效果依然不容忽视"]],
		  
		  "混沌_圣神_sunhaox":["male","shen",4,["圣_chaobian","圣_weiyin","圣_guiming_dying"],["des:“世人皆蝼蚁，自诩悦高逸；祈盼优圣帝，但沥帝王泣；王权既吾手，混世，亦随吾流”——神孙皓 </br> </br>攻击：★★★☆☆ </br>防御：★★★☆☆</br>过牌：★★★★★ </br>辅助：★★★★★</br>定位：主公 </br>特点：无觉：每回合一次的高额过牌“观看”身份；技能Combo的无损高防御；极度符合历史的二次觉醒；一觉：一牌多收益；额外保留牌；二觉：全场混世的主宰；巨额过牌高额伤害；技能Combo强命高伤害；主攻主防自由抉择；一血斩杀线</br>缺点：未觉醒时急需隐忍，每回合探究时需弃置所有手牌；无论什么时候均极度惧怕强命与酒杀；一觉后每回合首次造成伤害便损失继续进攻的机会，但却急需杀人才可继续觉醒；冒失伤害不可靠，献祭队友也很重要；二觉极度难觉醒，且觉醒后的所有进攻都需要付出巨额等量的代价，想好后路才是王道"]],
		  
		  "混沌_圣神_daqiaox":["female","shen",4,["圣_yanxiao","圣_wanrong","圣_liuli"],["des:“终于，结束了流离失所的日子了吗”——神大乔 </br> </br>攻击：★★☆☆☆ </br>防御：★★★☆☆</br>过牌：★★★☆☆ </br>辅助：★★★☆☆</br>定位：忠臣 </br>特点：异常强大的刷牢过牌控场能力，技能连用可无损大量过牌；其他角色使用或红色牌造成伤害后又可被动过牌；无视距离的转移杀所带来的效果</br>缺点：所有技能均有特殊限制与负面效果；核心技能所需大量♦️卡牌；被动技能需红色卡牌且造成伤害；辅助技能需要弃置卡牌且带有不可忽视的负面效果。技能需谨慎使用"]],
		  
		  "混沌_圣神_luxunx":["male","shen",4,["圣_fenying","圣_qianxun","圣_lingji"],["des:“精制善谋，方可执掌逆势之局”——神陆逊 </br> </br>攻击：★★★☆☆ </br>防御：★☆☆☆☆</br>过牌：★★★★★ </br>辅助：★☆☆☆☆</br>定位：反贼 </br>特点：异常强大的过牌能力；吸引越多的火力自身能力越强；觉醒后同时兼备强大的单挑与团战能力；掌握着一波大爆发瞬间清场的势力；因技能特殊性，极其适合卖血吸引仇恨</br>缺点：不分敌我的攻击方式；觉醒时的无差别补给也有可能会不经意间扭转战局；较为特殊的适合孤军奋战”"]],
		  
		  "混沌_圣神_xushix":["female","shen",4,["圣_wengua","圣_zhenmou","圣_fuzhu"],["des:“卦，亦可晓天，亦可卜心”——神徐氏 </br> </br>攻击：★★★☆☆ </br>防御：★☆☆☆☆</br>过牌：★★★★★ </br>辅助：★★★★★</br>定位：反贼 </br>特点：强大的过牌核心位；死人触发技能收益；针对男性角色的疯狂杀戮；核心技能可控顶或存牌。当你有核心牌不想被拿走，就可以放入牌堆底下次拿回来。也可以自行控顶获得对应的技能效果，但其主要效果还是与限定技进行Combo，存杀蓄力秒人。当有男性角色死后可链接队友，机动性上升N个档次</br>缺点：完全没有防御技能，极致的进攻辅助。一步错步步错，使用技能的每一步都需谨慎谨慎再谨慎。技能上手难度略高，但熟练后可轻松掌控全局，熟能生巧"]],
		  
		   "混沌_圣神_liuxiex":["male","shen",4,["圣_tianming","圣_putian","圣_mizhao"],["des:“蝼蚁岂可困龙乎？真龙，怎么可能在蝼蚁的威迫下俯首称臣”——神刘协 </br> </br>攻击：★★★☆☆ </br>防御：★★★★☆</br>过牌：★★★★★ </br>辅助：★★★★★</br>定位：反贼 </br>特点：强大的防御伴随着更为极致的过牌能力；强与弱就在于挟持之人亦敌亦友；忍耐蓄力后强大到极致的借刀杀人的能力；量变引起质变，“隐兵”的数量决定了反抗时你所拥有的力量</br>缺点：过牌能力很是夸张，但随之而来的是挟持你的角色一同的过牌；当你辛辛苦苦委曲求全招募了大量的“隐兵”但却被发现时，那种痛楚只有自己最清楚"]],
		    
		   "混沌_圣神_caifurenx":["female","shen",4,["圣_qieting","圣_zhouyan","圣_xianzhou"],["des:“这荆州，便是我的容身的护身符”——神蔡夫人 </br> </br>攻击：★☆☆☆☆ </br>防御：★★☆☆☆</br>过牌：★★★☆☆ </br>辅助：★★☆☆☆</br>定位：忠臣 </br>特点：利用前期弱势隐忍为主的角色过牌囤装备积少成多；对近身角色极度的限制能力；大量装备的过牌与实时使用的机动性；因技能以辅为主，可用来进攻的手段微乎其微，所以并不适合作为内奸进入决战场面</br>缺点：极其不稳定且微乎其微的过牌能力，看似强大的被动技能实则一匹+1马即可暂时完美破解；献州的同时也献出了自己所有的进攻与保护措施，此时的防御极其低下；进攻能力堪忧；看似强大的技能实则使用起来却是极度的不稳定"]],
		    
		   "混沌_圣神_bulianshix":["female","shen",4,["圣_anxu","圣_shuya","圣_zhuiyi"],["des:“不知何时起，你的脸上再也没有了曾经的那种温蔼。感情，并不是束缚你的枷锁，它包含了我们的曾经，包含了我们所有的美好回忆”——神步练师 </br> </br>攻击：★☆☆☆☆ </br>防御：★★☆☆☆</br>过牌：★★★☆☆ </br>辅助：★★★★☆</br>定位：忠臣 </br>特点：以无生有的偷梁换柱；特定条件的摸牌收入；濒死阶段的温馨嘱咐；用一张牌便可以“交换”两名角色的手牌与装备，非常强力的干扰技能；不过两名目标的牌数相差至少两张时才会有实际收益；濒死时可以令无损目标摸牌然后你恢复体力，或者令已受伤角色瞬间恢复满状态撑过本轮以下回合翻盘</br>缺点：辅助的通病，没有什么主动造成伤害的手段。主动技能需己方处于劣势才可有作用；被动技能触发条件苛刻，几乎同等于没有；限定技也需要进入濒死状态。总体来说逆风局能力很强，但平常作用不大"]],
		  
		  "混沌_圣神_sunlubanx":["female","shen",4,["圣_zenhui","圣_diyu","圣_jiaojin"],["des:“胆敢挡本公主路的家伙，我一个都不会放过，无论是谁”——神孙鲁班 </br> </br>攻击：★★★☆☆ </br>防御：★☆☆☆☆</br>过牌：★★★☆☆ </br>辅助：★★☆☆☆</br>定位：内奸 </br>特点：双刀蓄爆，辅伤过牌，免伤反击；一牌两用，怎么都是正收益；无伤过牌，要是伤害来源已经是你的“帮凶”，那你和他都能有“利益”；当你的状态良好时，一张装备换来的减伤其实并不重要，重要的是合理利用好“帮凶”的手段，借刀杀人撇清关系片叶不沾身</br>缺点：想要技能触发必需要持有特定的卡牌，而且牌的价值还不低；无脑的“帮凶”过牌，这不是你能掌控的能力，可能就因为这一次小小的过牌从而埋下祸根的“种子”；要是局势已经开始不安而你却还没能蓄起“帮凶”，那后果可真的是不堪设想"]],
		  
		  "混沌_圣神_sunluyux":["female","shen",4,["圣_meibu","圣_zhixi","圣_mumu"],["des:“抚霸虽安却怯威，伴姊情缘情亦逝”——神孙鲁育 </br> </br>攻击：☆☆☆☆☆ </br>防御：☆☆☆☆☆</br>过牌：★★★★☆ </br>辅助：★★★★☆</br>定位：反贼 </br>特点：超强限制、过牌存储、卸甲转移。拥有克制一切伤害爆发流武将的超强限制技能(张春华除外)和完全卸除他人装备的能力，其他角色所持有的装备完全是为你所准备。超强的技能联动，获得装备后持续使用触发被动技能囤牌结束，高额的手牌数当你获得藤甲或防御马的那一刻，将会是所以敌方角色的噩梦</br>缺点：虽可令其他敌方角色永远哑火，但这也是建立在你拥有足够防御力的基础上。有利有弊，因被动技能的存在，虽然你可以一直囤畜，但你也永远无法打出高额爆发(PS：我一开始的念头就是想让圣神小虎安安稳稳的做一个吸引火力限制输出的辅 助！)"]],
		  
		  "混沌_圣神_yuanshaox":["male","shen",4,["圣_yanshi","圣_xueyi","圣_faluan"],["des:“炎矢天雨随死神而至，灼焰之下，万物皆化为灰烬”——神袁绍 </br> </br>攻击：★★★★★ </br>防御：★☆☆☆☆</br>过牌：★★★☆☆ </br>辅助：★★★☆☆</br>定位：反贼 </br>特点：小小两张牌即可瞬间压低全场血线；每回合稳定巨额群体伤害；抓住一波机会即可瞬间清场。即使没有完全收复，有着满手牌的下家队友也可完复此项大业</br>缺点：人数越多越强，反之亦然。团战输出爆炸，单挑化身丈八。无差别攻击对于队友来讲终究是个很头疼的问题"]],
		  
		  "混沌_圣神_wangyix":["female","shen",4,["圣_zhenlie","圣_lieran","圣_miji"],["des:“我永远也不会回避一生之敌的宿命，纵使被剥夺神职，我也不会放过马氏族人”——神王异 </br> </br>攻击：★★★☆☆ </br>防御：★★★★☆</br>过牌：★★★☆☆ </br>辅助：★★★☆☆</br>定位：反贼 </br>特点：牺牲少量体力值以无视任何卡牌效果、被动辅助技能联动combo、判定过牌稳定收益；核心技能以失去体力换取观看手牌并自行弃置其关键牌，辅助技能可进行二次重判定增加判定成功率、辅助技能的发动与其他两技能的联动密不可分；辅助技能与被动技能的联合判定列表如下：</br>最好：双黑(被动技能收入两张牌，辅助技能判定成功)</br>一般：先红后黑/双红(辅助技能判定成功/被动技能收入两张牌)</br>最坏：先黑后红(被动技能无法收入，辅助技能也判定失败)</br>缺点：所有技能均有不可忽视的负面效果，同时，技能也均为血量越低收益才会高，二次判定的效果带来的就是会出现“判定成功而又最终判定失败”的场面，令人咋舌"]],
		  
		  "混沌_圣神_zhangfeix":["male","shen",4,["圣_lieyin","圣_liaoya","圣_huangnu"],["des:“持矛戮九州，血染穆天丘”——神张飞 </br> </br>攻击：★★★★★ </br>防御：★★☆☆☆</br>过牌：★★★★☆ </br>辅助：☆☆☆☆☆</br>定位：反贼 </br>特点：储存大量体力值以换取等量伤害与收益、低血线吸引大量仇恨值、掠夺抢牌抢强命、技能联动完美combo</br>缺点：以卖血与强【杀】为主的技能效果更需要大量的同伴辅助，低血线就意味着无法保存更多的核心牌，再加上本身就没有任何的保命手段，危险性极度飙升"]],
		  
		  "混沌_圣神_lingjux":["female","shen",4,["圣_jieyuan","圣_yijue","圣_fenxin"],["des:“原来，这世间居然还有我的位置么”——神灵雎 </br> </br>攻击：★★★☆☆ </br>防御：★★★☆☆</br>过牌：☆☆☆☆☆ </br>辅助：☆☆☆☆☆</br>定位：内奸 </br>特点：卖血蓄爆、减伤加伤、强阻重伤、鹬蚌相争渔翁得利、完成体后仅需黑红两种颜色手牌便可瞬间接管全局</br>缺点：前期极度弱势，技能均需出现合理时机才可使用发挥效果，即便是后期成型，在无牌时也无异于一个毫无作用的白板"]],
		  
		  "混沌_圣神_xunyux":["male","shen",4,["圣_quhu","圣_xunye","圣_jieming"],["des:“吾曾妄以一己之力复兴大汉之荣光，曾幻想天下尽归于大汉的美好光景。但，吾终未得善终……纵观古往今来，天下尽均“魏” “蜀” “吴” “群”四势力纠结交缠互相牵制，实力的天平终未倾向于其任何一主，唯司马氏窃汉之江山……窃……比起他人之懈怠，以隐忍一生老谋深算终得权的司马仲达又何以“窃”字所概呢……罢了，或许，这就是命中注定的吧……”——神荀彧 </br> </br>攻击：★★★★☆ </br>防御：★★☆☆☆</br>过牌：★★★★☆ </br>辅助：★★★★☆</br>定位：忠臣 </br>特点：借刀杀人、高额强命、卖血补牌、技能联动无损高收益</br>缺点：技能均围绕“卖血” “受伤”等标签所进行，主攻手段也为高代价的借刀杀人，技能也均有对自身的大幅限制效果，如何灵活高效率的释放技能且不受其技能所限制便需要多加思索了"]],
		  
		  "混沌_圣神_ganfurenx":["female","shen",4,["圣_shenzhi","圣_ruosi","圣_shushen"],["des:“自那日离别，妾身昼夜辗转难眠，不知多次承受离别之痛的夫君今日亦是如何……翼德已在混沌之界中与妾身重逢，云长却依旧不得相见，但愿其早日归于神袛……夫君，妾身要何时，才可与你相逢呢……”——神甘夫人 </br> </br>攻击：★★☆☆☆ </br>防御：★★★★★</br>过牌：★★★★★ </br>辅助：★★★★★</br>定位：忠臣 </br>特点：高额恢复，强力辅助，仅需一张牌便可令自身重头再来，完全打破了平衡的生存能力</br>缺点：技能效果两极分化极度严重，其效果均围绕“恢复”所进行，想要最大化收益就必须卖血至极点，但因完全无任何防御手段，在低血量时极度脆弱不堪，若是此时最后一张手牌也被掠夺，那就真的变成了无意义的白板"]],
        
    "混沌_圣神_zhurongx":["female","shen",4,["圣_juxiang","圣_yanyi","圣_lieren"],["des:“炎统血脉，遍布中原大地！蛮烈后裔，驭兽怒碎纷争”——神祝融 </br> </br>攻击：★★★★☆ </br>防御：★★☆☆☆</br>过牌：★★★★☆ </br>辅助：★★☆☆☆</br>定位：内奸 </br>特点：完全驾驭南蛮之力，受伤分发卡牌并于下次成为其目标后恢复体力值、最大化南蛮入侵的利益，当你使用南蛮入侵后，其他角色无论与否都会受到稳定损伤、即便是与你或他人所决斗时，目标都会额外受到牵连、对拥有防具的角色杀伤性极大，“藤甲”再也不能起到任何保护作用，真真正正的沦为“寿衣”、使用杀时拼点，技能联动无损巨额收益、找到节奏后光速清场甚至会瞬间融化战局</br>缺点：技能均需卖血才可获得收益，无任何确切防御手段的后果便是极其容易被集火一波端"]],
    
    "混沌_圣神_huatuox":["male","shen",4,["圣_chuli","圣_renxin","圣_qingnang"],["des:“济世普天平，医愿众世清”——神华佗 </br> </br>攻击：★★☆☆☆ </br>防御：★★☆☆☆</br>过牌：★★★★☆ </br>辅助：★★★★★</br>定位：忠臣 </br>特点：强势恢复、济世救己、全员免死。混沌之界中当之无愧的最强奶爸，无视已损失体力值数量直接复原恢复满额(小技巧：当你手牌中黑色牌多时，你估摸着一名已损失体力值较少的敌方角色的红色手牌不多的话，你可以对其释放技能，弃置所有牌削减其体力值上限)，救济他人时自身也会得到等量收益，配合拥有判定能力的角色即可达到全员免死</br>缺点：技能均拥有无法忽略的巨额负面效果，释放技能时需时刻注意场上局势。被动技能的存在正实了你其实并没有“实际体力值”，就算你满血，当一名角色脱离濒死状态时你依旧会瞬间大残。技能中失去体力值上限与掠夺所有手牌的负面效果对于局势的影响真的非常之大，请谨慎使用"]],
    
    "混沌_圣神_liuyanx":["male","shen",4,["圣_tushe","圣_chuangli","圣_limu"],["des:“吾曾以为吾此霸图一生仅因背疮而止步于卧榻，却曾谁想在生命的最后苍天眷顾于我……上苍定是不忍吾历经了多年的苦痛折磨到头来却一无所获！吾自当顺应天意！敛且扈戾！复继，我所失去的……全部！”——神刘焉 </br> </br>攻击：★★★★☆ </br>防御：☆☆☆☆☆</br>过牌：★★★★☆ </br>辅助：☆☆☆☆☆</br>定位：内奸 </br>特点：大量多次的巨额摸牌、无视任何规则的限制。使用技能图射后首次使用牌指定角色为目标后必定的摸牌，被动技能疮疬的清除红桃闪，立牧后的过牌与无限制均证实了又一位最强圣神的荣耀莅临。圣神刘焉的玩法颠覆了曾经的所有，再也不是毫无存在感的等待清闪然后一轮游，圣神刘焉需要做的就是时刻注意自己的手牌，合理的调控以获得技能〖图射〗的最大收益---用一摸一。当你将手牌全部用至无可用牌时，此时配上霸道的辅助技能〖立牧〗直接制衡所有牌重启一波超级大爆发。<li>“你以为这就结束了？不，这才刚刚开始！”</br>缺点：虽然图射被增强的幅度高的离谱，但因“牧”印记可消耗这点的存在，圣神整体的强度瞬间被拉下了一大截。同战局对比里，圣神刘焉的强度完全比不过武将刘焉，不过牺牲了无脑强度所换取的巨额可玩度确实弥补了这些可有可无的缺陷"]],
    
    "混沌_圣神_zhoufeix":["female","shen",4,["圣_liangyin","圣_housan","圣_kongsheng"],["des:“此间乱世，犹如涛涛洪水，犹如烈焰地狱。储君之争，东吴浩荡，吾于乱世漂泊，百般思念。身之痛，不及思君之痛。妾身坚信，终有一日可纵身解脱，与夫君重逢……可现在，还不是时候，妾身已归入神袛，可夫君……妾身期望，终有一日，箜声入君心，君随箜声至。以此箜篌声，引君化神明”——神周妃 </br> </br>攻击：★★★★☆ </br>防御：★★★★☆</br>过牌：★★★★☆ </br>辅助：★★★★☆</br>定位：内奸 </br>特点：无视弃牌、多项强伤、无损过牌，技能效果既可遏制连续爆发的敌方，亦可帮助无法爆发的友方存储手牌。你可以将手牌置于自己的武将牌旁翻倍存储，也可以置于友方的武将牌旁无损大过牌，亦或是极端的放手一搏，置于敌方的武将牌旁，然后联动技能对其造成巨额伤害。越是到了后期，你的手牌存储的越多，伤害也就会变得异常恐怖</br>缺点：世间万物皆有阴阳正负两面性，亦可克制依靠手牌爆发的敌方角色，也可连累同样靠此爆发的友方角色。同样，敌方角色也可利用此法存储手牌。一定要注意敌方的状态，尽快速战速决，切记不要让本身最为引以为傲的技能成了拖累自身的最大的累赘"]],
    
    "混沌_圣神_liubeix":["male","shen",4,["圣_rende","圣_zongzha","圣_shimie"],["des:“孤以一生追溯复兴汉室的路途遥远，却遗终于中道崩殂。虽孤穷极一生布施济世，但也不过是笼络民心的一种手段，真正让孤放不下的，只有两位手足兄弟！但奈何……唉，孤未曾胆敢……胆敢期望上天！能开一次眼……能看到，曾经那歇斯底里的孤……也想问问老天为何不佑我蜀汉……但那些都不重要了……如今……二弟三弟……大哥虽来迟一步，但也随汝等的步伐飞升化神，可你们……在哪呢……”——神刘备 </br> </br>攻击：★★★★☆ </br>防御：★★☆☆☆</br>过牌：★★★★☆ </br>辅助：★★★★☆</br>定位：内奸 </br>特点：前期过牌操作掌控全局笼络民心，中期随场上局势诛杀曾笼络过的临时“盟友”强行觉醒，后期龙怒滔天焰霆巨浪肆虐全场</br>缺点：由纯辅助过渡为纯输出的时机异常难寻，放弃治疗而转入正面战场的契机也非自己所能掌控。觉醒后技能满满的负面效果虽可拉他人下水，但对于自身的反噬也同样不容忽视"]],
    
    "混沌_圣神_zhangqiyingx":["female","shen",4,["圣_fazhuan","圣_dianhua","圣_yifu"],["des:“斗米施兼济，乱世聚民意。授渔均易嘁，制箓以自避。皆以道法之奥，绘篆咒印之妙”——神琪瑛 </br> </br>攻击：★★★☆☆ </br>防御：★★★☆☆</br>过牌：★★★☆☆ </br>辅助：★★★☆☆</br>定位：内奸 </br>特点：弃牌被拆得大量印记，多种效果变幻无穷，技能相扣大combo。多种印记带来多种不同的组合效果，集万千能力于一身。失去牌时得各种不同的印记，回合开始时触发被动技能判定决定下一步打法走向，火属性强伤、改判、限制体力值、濒死稳定恢复、控制摸牌、造成伤害时额外强伤恢复、填补装备、受伤得高收益牌八种符咒效果轮番上阵，攻守兼备极为均衡</br>缺点：全部技能均围绕失去牌进行，但被动技能大幅度限制了这点。时刻注意自己的手牌数与法篆符咒的数量，不要白白浪费自己的强大能力"]],
    
    "混沌_圣神_yanghuiyux":["female","shen",4,["圣_hongyi","圣_ciwei","圣_caiyuan"],["des:“才媛之仪，助君佐兴之威……”——神徽瑜 </br> </br>攻击：★☆☆☆☆ </br>防御：★★★☆☆</br>过牌：★★★★☆ </br>辅助：★★★★☆</br>定位：内奸 </br>特点：稳定的正面收益，多重联动的卖血手笔，既可主动给予大量手牌的补给，又可在困境中收获一丝甘霖</br>缺点：防御能力极佳，但进攻手段微乎其微，可有可无的增加体力值上限，仅可锦上添花，却不可雪中送炭，寻求他人的协助才是重中之重"]],
    
    "混沌_圣神_xiahoushix":["female","shen",4,["圣_qiaoshi","圣_shoujie","圣_yanyu"],["des:“父亲……夫君……你们居然……原来，这个世界上真的有奇迹……”——神夏侯氏 </br> </br>攻击：★★★★☆ </br>防御：★★★★☆</br>过牌：★★★★★ </br>辅助：★★★★☆</br>定位：内奸 </br>特点：无差别增益、防御能力拉满、随心置换手牌。无时无刻都在进行着控场，对自身而言无论何时都是稳定正向收益。成为他人目标后强行掠牌，用敌方的牌来对付他自己。置换手中无用的杀后又可额外摸牌，变相的增加了手牌上限，也可将这次机会拱手让给核心队友，让其快速发育。而且还有一张杀转眼变成无中生杀生无中的神奇场面</br>缺点：技能均为无差别式攻击与强行接管控场，极其害怕可造成强命的对手。你需要时刻小心残血的队友和那些对你虎视眈眈的强命型武将！"]],
				},
				
						translate:{
						
		"混沌_圣神_caopix":"神曹丕",
           
	 "混沌_圣神_caoruix":"神曹叡",
            
	 "混沌_圣神_mihengx":"神祢衡",
            
	 "混沌_圣神_liuchenx":"神刘谌",
            
	 "混沌_圣神_caiwenjix":"神文姬",
            
	 "混沌_圣神_huangyueyingx":"神月英",
            
	 "混沌_圣神_guanyinpingx":"神银屏",
            
	 "混沌_圣神_diaochanx":"神貂蝉",
            
	 "混沌_圣神_jiangweix":"神姜维",
            
	 "混沌_圣神_lvbux":"神吕布",
            
	 "混沌_圣神_zhugedanx":"神诸葛诞",
            
	 "混沌_圣神_jiaxux":"神贾诩",
            
	 "混沌_圣神_zhugeguox":"神诸葛果",
            
	 "混沌_圣神_zhaoyunx":"神赵云",
            
	 "混沌_圣神_zhangxingcaix":"神星彩",
            
	 "混沌_圣神_xiahouyuanx":"神夏侯渊",
            
	 "混沌_圣神_guojiax":"神郭嘉",
            
	 "混沌_圣神_guotupangjix":"神郭逄",
            
	 "混沌_圣神_zhangchunhuax":"神春华",
            
	 "混沌_圣神_caojiex":"神曹节",
            
	 "混沌_圣神_suncex":"神孙策",
            
	 "混沌_圣神_fuhuanghoux":"神伏皇后",
            
	 "混沌_圣神_guanpingx":"神关平",
            
	 "混沌_圣神_pangtongx":"神庞统",
            
	 "混沌_圣神_xinxianyingx":"神宪英",
            
	 "混沌_圣神_zhenjix":"神甄姬",
            
	 "混沌_圣神_zhaoxiangx":"神赵襄",
            
	 "混沌_圣神_simayix":"神司马懿",
            
	 "混沌_圣神_xiahoudunx":"神夏侯惇",
            
	 "混沌_圣神_liushanx":"神刘禅",
	 //"混沌_圣神_liushanx_hanxing":"神刘禅",
            
	 "混沌_圣神_huanggaix":"神黄盖",
            
	 "混沌_圣神_wangjix":"神王基",
            
	 "混沌_圣神_beimihux":"神卑弥呼",
            
	 "混沌_圣神_zhonghuix":"神钟会",
            
	 "混沌_圣神_zhoutaix":"神周泰",
            
	 "混沌_圣神_sunquanx":"神孙权",
            
	 "混沌_圣神_lvmengx":"神吕蒙",
            
	 "混沌_圣神_caocaox":"神曹操",
            
	 "混沌_圣神_wolong_zhugeliangx":"神卧龙",
            
	 "混沌_圣神_xizhicaix":"神戏志才",
	 
	 "混沌_圣神_zhangjiaox":"神张角",
	 
	 "混沌_圣神_maliangx":"神马良",
	 
	 "混沌_圣神_hetaihoux":"神何太后",
	 
	 "混沌_圣神_dongzhuox":"神董卓",
	 
	 "混沌_圣神_machaox":"神马超",
	 
	 "混沌_圣神_sunshangxiangx":"神尚香",
	 
	 "混沌_圣神_madaix":"神马岱",
	 
	 "混沌_圣神_sunhaox":"神孙皓",
	 
	 "混沌_圣神_daqiaox":"神大乔",
	 
	 "混沌_圣神_luxunx":"神陆逊",
	 
	 "混沌_圣神_xushix":"神徐氏",
	 
	 "混沌_圣神_liuxiex":"神刘协",
	 
	 "混沌_圣神_caifurenx":"神蔡夫人",
	 
	 "混沌_圣神_bulianshix":"神步练师",
	 
	 "混沌_圣神_sunlubanx":"神孙鲁班",
	 
	 "混沌_圣神_sunluyux":"神孙鲁育",
	 
	 "混沌_圣神_yuanshaox":"神袁绍",
	 
	 "混沌_圣神_wangyix":"神王异",
	 
	 "混沌_圣神_zhangfeix":"神张飞",
	 
	 "混沌_圣神_lingjux":"神灵雎",
	 
	 "混沌_圣神_xunyux":"神荀彧",
	     
	 "混沌_圣神_ganfurenx":"神甘夫人",
	 
	 "混沌_圣神_zhurongx":"神祝融",
	 
	 "混沌_圣神_huatuox":"神华佗",
	 
	 "混沌_圣神_liuyanx":"神刘焉",
	 
	 "混沌_圣神_zhoufeix":"神周妃",
	 
	 "混沌_圣神_liubeix":"神刘备",
	 
	 "混沌_圣神_zhangqiyingx":"神琪瑛",
	 
	 "混沌_圣神_yanghuiyux":"神徽瑜",
	 
	 "混沌_圣神_xiahoushix":"神夏侯氏",
	 
	 
	 
	     
	     "_混沌_圣神_圣甲":"圣甲",
	     "_混沌_圣神_圣甲_info":"",
	     
	     "_混沌_圣神_faze":"圣神法则",
	     "_混沌_圣神_faze_info":"",
	     
	     "圣_fangzhu":"放逐",
            "圣_fangzhu_info":"锁定技，每当你受到其他角色造成的伤害后：若你的武将牌正面朝上，你与伤害来源均将武将牌翻至背面，然后你可以令一名其他角色弃置X张牌并翻面(X为你的已损失体力值)。若你的武将牌已翻面，你将武将牌翻至正面并令伤害来源失去一点体力，然后你可以令一名其他角色摸X张牌并翻面(X为你的当前体力值)",
            
            "圣_xingshang":"行殇",
            "圣_xingshang_info":"锁定技，每当一名区域内有牌的其他角色进入濒死状态时，你恢复一点体力并获得该角色的所有牌，然后令其进行一次判定并获得此次判定牌",
            
            "圣_songwei":"颂威",
            "圣_songwei_info":"觉醒技：每当一名其他角色的判定结果牌的颜色为黑色时，你摸一张牌。若你的手牌数因此而大于当前回合角色的手牌数，你获得其所有手牌，重置武将牌并立即开始一个额外的回合，然后你失去技能〖放逐〗〖行殇〗并永久获得技能〖储元〗〖燕歌〗〖登极〗",
            
            "圣_chuyuan":"储元",
            "圣_chuyuan_info":"锁定技，每当一名角色受到伤害时，你可以令其摸一张牌。若该角色或伤害来源已成为过此技能的目标，你令伤害来源(不为你且不为该角色本身)失去一点体力并令受伤角色将一张牌置于你的武将牌旁称为“元”",
            
            "圣_yange":"燕歌",
            "圣_yange_info":"锁定技，每当你受到卡牌所造成的伤害时，你可以令与你距离为一的其他所有角色交给你一张牌。若如此做，你需将对你造成伤害的此牌交给本回合内你以此法获得过牌的其中一名角色",
            
            "圣_dengji":"登极",
            "圣_dengji_info":"觉醒技：准备阶段，若你武将牌旁所持有的“元”的数量不小于3，你增加一点体力值上限并恢复所有已损失体力值，然后获得武将牌旁的所有“元”。若如此做，你失去技能〖燕歌〗并永久获得技能〖天行〗",
            
            "圣_tianxings":"天行",
            "圣_tianxings_info":"锁定技，出牌阶段(限一次)，你可以获得至多X张“元”并弃置一张牌(X为你的已损失体力值且至少为1)。若你以此法所弃置的牌为♥️花色，你恢复一点体力并对其他所有角色造成一点伤害，然后你于本回合内的手牌上限改为0；若为♦️花色，你可以令一名其他角色获得你的所有手牌，然后你将手牌数补至与其相同；若为♠️花色，你可以令一名其他角色于本回合结束后开始一个额外的回合，然后你于本回合结束时摸X张牌；若为♣️，你摸Y张牌并获得一名其他角色的所有牌，然后令其获得你的一张牌(Y为你的当前手牌数)",
	     
	     "圣_longhun":"龙魂",
	          "圣_longhun_info":"锁定技，每当你进入/脱离濒死状态时，你摸X张牌（X为你已损失体力值-1）",
            
	     "圣_huituo":"恢拓",
            "圣_huituo_info":"锁定技，每当你受到伤害时，你可以令任意一名角色进行一次判定(X为此次伤害量)：若判定结果的颜色为红色，则该角色恢复X点体力(若该角色无牌则额外恢复X点体力)；若判定结果的颜色为黑色，则该角色摸X张牌(若该角色已受伤则额外摸X张牌)",
            
	     "圣_xingshuai":"兴衰",
            "圣_xingshuai_info":"锁定技，每当你进入濒死状态时，你依次移除场上所有的“忠”印记并对所持有角色造成一点伤害，然后你恢复一点体力",
            
	     "圣_mingjian":"明鉴",
            "圣_mingjian_info":"锁定技，出牌阶段(限一次)，你可以将所有手牌交给一名其他角色并令其获得“忠”印记；然后，根据其的身份，其于回合开始时令你恢复一点体力或对你造成一点伤害；持有“忠”印记的角色与你之间的距离视为一且其手牌上限与使用【杀】的次数上限均累计+X(X为你对其发动该技能的次数)",
            
	    "圣_huangkong":"惶恐",
            "圣_huangkong_info":"锁定技，每当一名其他角色的回合开始时，你可以交给一名其他角色一张牌(不可为该角色)，然后令其与该角色进行拼点：若该角色拼点胜利，发起拼点的角色需弃置两张手牌，然后该角色于本回合内与你的距离视为一并视为对你使用一张【杀】；若该角色拼点失败，你与发起拼点的角色各摸一张牌，然后令该角色跳过摸牌与出牌阶段，并于本回合内的手牌上限视为X(X为该角色当前体力值或已损失体力值较少一方的数量)",
            
            "圣_youjin":"幽禁",
            "圣_youjin_info":"锁定技，与你距离为一的其他角色对你造成的伤害翻倍，否则，此伤害-1",
            
            "圣_qiuyuan":"求援",
            "圣_qiuyuan_info":"锁定技，每当你成为【杀】的目标时，你可以令一名其他角色选择一项(不可为此【杀】的使用者)：1.交给你一张【闪】并摸一张牌。若此【杀】的使用者已于本回合内成为了〖惶恐〗的技能目标，该角色需展示所有手牌，若其中有【杀】，则对其造成一点伤害；2.成为此【杀】的额外目标。若此【杀】的使用者已于本回合内成为了〖惶恐〗的技能目标，则该角色需展示所有手牌，然后弃置其中的所有【杀】",
            
            "圣_qianxin":"潜心",
            "圣_qianxin_info":"锁定技，你始终跳过弃牌阶段；结束阶段，若你的手牌数量为全场最多且当前体力值大于1，你失去一点体力",
            
	     "圣_fanyin":"梵音",
            "圣_fanyin_info":"觉醒技：准备阶段，若你的手牌数量不小于当前体力值的3倍，你恢复一点体力，失去技能〖莫化〗并永久获得技能〖涉猎〗〖攻心〗",
           
	     "圣_huimin":"惠民",
            "圣_huimin_info":"锁定技，结束阶段，你可以观看牌堆顶的X张牌(X为场上手牌数小于其体力值的角色数)，并可以将这些牌按任意顺序分配给任意手牌数不大于当前体力值的角色(若为你则跳过此条件)；分配完毕后，若你的手牌数量不大于你的当前体力值，你恢复一点体力",
            
	     "圣_shouxi":"守玺",
            "圣_shouxi_info":"锁定技，每当你成为其他角色卡牌的目标时，你可声明一种未以此法声明过的普通卡牌的牌名，其需弃置一张你声明的卡牌，否则你摸一张牌并获得其一张牌，然后令其使用的此牌无效；若其弃置了你声明的卡牌，其获得你一张手牌",
           
	     "圣_faze":"圣神法则",
            "圣_faze_info":"",
            
	     "圣_kuangwang":"狂妄",
            "圣_kuangwang_info":"锁定技，出牌阶段（限一次），你可以与一名其他角色进行拼点：若你赢，你获得一张【杀】并于本回合内进入“狂妄”状态。此状态下，你使用牌无次数与距离限制且每使用一张牌便摸一张牌；若你没赢，你失去一点体力",
            
	     "圣_shejian":"舌剑",
            "圣_shejian_info":"锁定技，若你于弃牌阶段弃置的牌花色均不同，你可以获得一名其他角色区域内的一张牌。若该角色的手牌数因此而不大于你，你与其各摸一张牌",
            
	     "圣_zhanjue":"战绝",
            "圣_zhanjue_info":"锁定技，每当你发起一次【决斗】，你摸X张牌；出牌阶段，你可以将所有手牌当做一次【决斗】使用，若如此做，你失去1点体力（X为你已损失体力值）",
            
	     "圣_zhanjue1":"战绝",
            "圣_zhanjue1_info":"",
           
	     "圣_qinjin":"勤谨",
            "圣_qinjin_info":"锁定技，每当你使用或打出一张【杀】/【闪】，你恢复1点体力",
            
	     "圣_ziwen":"自刎",
            "圣_ziwen_info":"限定技：出牌阶段，若你的体力值等于1，你可以将体力恢复至体力值上限并获得等量张【杀】，失去技能〖战绝〗并永久获得技能〖戮战〗。若如此做，此回合结束时，你进入濒死状态；若你脱离了濒死状态，你摸X张牌（X为你已损失体力值）",
            
	     "圣_luzhan":"戮战",
            "圣_luzhan_info":"锁定技，出牌阶段，你可以失去一点体力，令一名其他角色获得一张【杀】，然后你获得其一张牌。若如此做，视为你对其发起【决斗】",
            
	     "圣_ziwen1":"自刎",
            "圣_ziwen1_info":"",
            
	     "圣_lige":"离歌",
            "圣_lige_info":"锁定技，每当一名角色受到其他角色造成的伤害时，若伤害来源不为你，你可以弃置一张牌令其进行一次判定，并根据最终判定花色执行其对应效果(X为此次伤害数值):♥️该角色恢复X点体力；♦️︎该角色摸1+X张牌；♣️伤害来源弃置1+X张牌；♠️伤害来源翻面并失去X点体力",
            
	     "圣_bingxin":"冰心",
            "圣_bingxin_info":"锁定技，你可以于弃牌阶段开始时将手牌依次当做你于本回合内的出牌阶段使用的非装备牌使用",
                     
	     "圣_jiang":"激昂",
            "圣_jiang_info":"锁定技，每当你使用或成为其他角色使用【杀】或【决斗】的目标时，你可以令你或其手牌数较多一方弃置一张手牌并令双方中无手牌的角色摸一张牌(若此时你的当前体力值大于1，你失去一点体力值并获得一层“圣甲”)，然后对其发起行一次拼点：若你赢，你收回/获得此牌(若此牌为【杀】且使用者为你，则本次使用不计入出牌次数限制)；若你没赢，你摸一张牌(若你因此技能而被弃置了手牌，则改为摸两张牌)",
            
      "圣_yingyang":"鹰扬",
            "圣_yingyang_info":"锁定技，每当你拼点失败后，你增加一点体力值上限并令下次拼点时掠夺对方1点拼点牌点数",
            
       "圣_hunshang":"魂殇",
            "圣_hunshang_info":"觉醒技：准备阶段，若你的已损失体力值大于4，你须重置武将牌，将体力值上限降至并锁定为一，然后获得等量“圣甲”，失去技能〖激昂〗〖鹰扬〗并永久获得技能〖圣姿〗〖圣魂〗〖魂姿〗",
            
       "圣_hunshang_maxHp":"魂殇",
       "圣_hunshang_maxHp_info":"",
            
            "圣_shengzi":"圣姿",
            "圣_shengzi_info":"锁定技，摸牌阶段，你可以放弃摸牌，改为令至多X名其他角色依次摸一张牌并对其发起拼点(X为你于此阶段可摸取的牌数)：若你赢，你获得此次双方的拼点牌。若你没赢，你摸一张牌并令手牌上限永久+1(该技能结算期间即将进行拼点的无牌角色将摸一张牌)",
            
            "圣_shenghun":"圣魂",
            "圣_shenghun_info":"锁定技，准备阶段，你令所有体力值大于你的其他角色依次摸X张牌(X为你以技能〖圣姿〗额外增加的手牌上限+1)并依次被你弃置至多X+Y张牌(Y为你装备区内的牌数)；若你以此法所选择的目标角色数不小于你装备区内卡牌的数量，你将当前未持有类型的随机装备牌置入装备区并获得一层“圣甲”",
            
            "圣_yingba":"英霸",
            "圣_yingba_info":"锁定技，出牌阶段，你可以与一名体力值上限大于1的其他角色一同失去一点体力值上限，然后令其获得一枚“平定”印记。若如此做，该角色需交给你X张牌(X为该角色与你手牌数的差)",
            
            "圣_fuhai":"覆海",
            "圣_fuhai_info":"锁定技，你对持有“平定”印记的角色使用牌无距离限制且该角色无法响应；当你对其使用的牌结算后或当该角色阵亡时，你移除该角色所持有的“平定”印记，然后增加X点体力值并摸等量张牌(X为该角色所持有的“平定”印记数量)",
            
            "圣_pinghe":"冯河",
            "圣_pinghe_info":"锁定技，你的手牌上限改为你的已损失体力值；每当你即将受到伤害时，若你的手牌数不小于X，你防止此伤害并选择将X张手牌交给一名其他角色或弃置，然后令伤害来源获得X枚“平定”印记(X为此次伤害量)",
            
            "圣_hunzi":"魂姿",
            "圣_hunzi_info":"觉醒技：当你即将受到其他角色所造成的伤害时，若伤害来源未在你的攻击范围内，你防止此伤害，失去技能〖激昂〗〖圣姿〗〖圣魂〗，永久获得技能〖英霸〗〖覆海〗〖冯河〗，然后增加4点体力值上限并将手牌数补至与之相同",
            
	     "圣_lingxie":"灵械",
            "圣_lingxie_info":"锁定技，出牌阶段（限一次），你可以弃置任意张装备牌并选择一名其他角色，令其随机废除X种装备栏（已失效的装备栏仍旧可被废除）。当你因此技能而弃置不少于7张装备牌时，你将此技能的效果修改为“不会废除已失效装备栏”（X为你弃置的卡牌数）",
            "圣_lingxie_juexing":"灵械",
            "圣_lingxie_juexing_info":"",
            
            "圣_linglong":"玲珑",
            "圣_linglong_equip":"玲珑",
            "圣_linglong_delay":"玲珑",
            "圣_linglong_trick":"玲珑",
            
            "圣_linglong_equip_info":"",
            "圣_linglong_delay_info":"",
            "圣_linglong_trick_info":"",
            "圣_linglong_info":"锁定技，每当你使用一张锦囊牌时，你摸一张牌。若此牌为延时锦囊牌，则额外令一名随机敌方角色失去一点体力；每当你使用一张装备牌时，你获得一层“圣甲”",
            
            "圣_mocai":"默才",
            "圣_mocai_info":"锁定技，每当你于回合外失去牌后，你展示牌堆顶的X张牌，然后获得其中的所有非基本牌并将其余牌置入弃牌堆(X为此次失去牌数的翻倍)",
            
	     "圣_bagua":"八卦",
            "圣_bagua_info":"锁定技，你始终视为装备着【八卦阵】；每当你闪避一张【杀】时，你摸一张牌",
            
	     "圣_jinnang":"锦囊",
            "圣_jinnang_info":"锁定技，你可以将一张牌按照以下花色规则使用或打出:</br>♦️当做【火攻】；♥️当做【桃园结义】；♠️当做【无懈可击】；♣️当做【铁索连环】；",
            
	     "圣_jinnang2":"锦囊♠️",
            "圣_jinnang2_info":"",
            
	     "圣_jinnang3":"锦囊♥️",
            "圣_jinnang3_info":"",
           
	     "圣_jinnang1":"锦囊♦️",
            "圣_jinnang1_info":"",
            
	     "圣_jinnang4":"锦囊♣️",
            "圣_jinnang4_info":"",
            
	     "圣_xueji":"血祭",
            "圣_xueji_info":"锁定技，出牌阶段（限一次），你可以失去一点体力并将至多X名其他角色横置，然后对首名目标角色造成一点火属性伤害(X为你已损失体力值)",
            
      "圣_yueying":"月影",
            "圣_yueying_info":"锁定技，结束阶段，你对一名随机其他角色造成一点伤害；若你已受伤，你恢复一点体力，否则，你摸两张牌",
            
      "圣_tianzi":"天姿",
            "圣_tianzi_info":"锁定技，对你造成伤害的男性角色于本回合内进入混乱状态",
            
      "圣_meixin":"魅心",
            "圣_meixin_info":"锁定技，出牌阶段（限一次），你可以弃置一张牌并翻面，令两名有手牌的其他角色暂时进入混乱状态，然后你依次获得两名目标角色的所有手牌并需依次返还其X张牌(X为其当前体力值)。若如此做，视为两名角色相互对另一名角色发起【决斗】（无法被【无懈可击】所响应）",
            
      "圣_yaze":"雅泽",
            "圣_yaze_info":"锁定技，每当你恢复体力后，你重置武将牌",
            
      "圣_tiaoxin":"挑衅",
            "圣_tiaoxin_info":"锁定技，出牌阶段(限一次)，你可以弃置一张手牌，然后弃置一名其他角色的一张牌。若你以此法两张牌均不为【杀】，你与其各摸一张牌。否则，若你弃置的牌为【杀】，你对其造成一点伤害。若你弃置目标角色的牌为【杀】，你受到来自于其的一点伤害",
            
            "圣_youlin":"幼麟",
            "圣_youlin_info":"锁定技，每当你即将受到来自于其他角色的伤害时，若你拥有“圣甲”，你令伤害来源失去一点体力；每当你受到伤害后，若你没有“圣甲”，你获得之",
            
            "圣_longyi":"龙遗",
            "圣_longyi_info":"觉醒技：每当你的准备阶段开始时/进入濒死状态时，若你没有手牌或当前体力值不大于1，你需将体力值恢复至1并摸两张牌，失去技能〖挑衅〗〖幼麟〗并永久获得技能〖天星〗〖孤伐〗。然后于当前回合结束后立即开始一个额外的回合",
            
            "圣_tianxing":"天星",
            "圣_tianxing_info":"锁定技，准备阶段开始时，你可以跳过本回合的摸牌阶段并观看牌堆顶的7张牌(场上现存活角色数不大于5时改为4张牌)，然后将其中的至少X张牌(X为你的已损失体力值且至少为2)以任意顺序依次置于牌堆顶并获得其余的所有牌(若X不小于你所观看的牌数则改为至少1张牌)。若你以此法获得的牌数不小于3张，你于本回合内不可发动技能〖孤伐〗",
            
            "圣_gufa":"孤伐",
            "圣_gufa_info":"锁定技，出牌阶段(限一次)，你可以弃置所有手牌并选择一名有手牌的其他角色；若如此做，你摸一张牌并与其进行拼点：若你赢，你展示牌堆顶的一张牌，若此牌为红色，则视为你对其使用一张不计入出牌次数限制的【杀】。若此牌为黑色，你对其造成一点伤害，然后摸X张牌(X为你以此法弃置的牌数)；若你没赢，其视为对你使用一张不计入出牌次数限制的【杀】",
            
      "圣_liqu":"利驱",
            "圣_liqu_info":"锁定技，每当你使用【杀】造成伤害后，你可以获得该角色的一至两张牌。若你获得了该角色的两张牌，其摸一张牌；若两张均为基本牌，你将其置于弃牌堆并获得一张【决斗】；若两张均为装备牌，你失去一点体力",
            
      "圣_wushuang":"无双",
            "圣_wushuang_info":"锁定技，你使用【杀】或【决斗】的次数与可选目标数的基数为3，且目标角色需额外打出1张【闪】或【杀】",
            
            "圣_shenyu":"神狱",
            "圣_shenyu_info":"觉醒技：当你击杀了一名其他角色后，若你已受伤，你失去技能〖利驱〗〖无双〗，永久获得技能〖狂暴〗〖神愤〗。然后恢复一点体力并将“方天画戟”与“赤兔”置入你的装备区",
            
            "圣_kuangbao":"狂暴",
            "圣_kuangbao_info":"锁定技，每当你造成/受到伤害或失去体力后，你获得等量枚“暴”印记；若你拥有此印记，摸牌阶段，你额外获得一张【杀】；你可以额外使用X张【杀】（X为“暴”印记数量）",
            
            "圣_shenfen":"神愤",
            "圣_shenfen_info":"锁定技，出牌阶段（限一次），你可以移除六枚 “暴”印记，依次弃置其他所有角色装备区内的所有牌与四张手牌并对其造成一点伤害，然后你摸X张【杀】（X为你已损失体力值）",
            
            "圣_gongao":"功獒",
            "圣_gongao_info":"锁定技，每当一名其他角色进入濒死状态时，你增加一点体力值上限并恢复一点体力；若伤害来源不为你且你未受伤，你令伤害来源摸一张牌，然后获得其一张牌。若该角色的手牌数因此而大于濒死角色的手牌数，则改为获得其两张牌并视为其对你使用一张【杀】",
            
       "圣_gongao_juexing":"功獒",
            "圣_gongao_juexing_info":"锁定技，每当一名其他角色进入濒死状态时，你增加一点体力值上限并恢复一点体力，然后将手牌数补至当前体力值；每当你的回合结束后，若你的当前体力值为1，你将手牌数补至体力值上限",
            
      "圣_weizhong":"威重",
            "圣_weizhong_info":"锁定技，每当你的体力值或体力值上限发生变化时，你摸等量张牌",
            
      "圣_benghuai":"崩坏",
            "圣_benghuai_info":"锁定技，每当你使用一张牌后，若你于使用此牌期间没有恢复体力且当前体力值大于1，你失去一点体力；结束阶段，若你的体力值上限大于1，你失去一点体力值上限",
            
      "圣_juyi":"举义",
            "圣_juyi_info":"觉醒技：准备阶段，若你已受伤且体力值上限大于5，你失去一点体力值上限并摸X张牌(X为你已损失体力值)，然后修改技能〖功獒〗，失去技能〖绝末〗，永久获得技能〖威重〗〖崩坏〗",
            
      "圣_wansha":"完杀",
            "圣_wansha_info":"锁定技，每当一名其他角色进入濒死状态时：若有伤害来源且不为你，你令该角色或伤害来源双方中的无牌角色摸一张牌，然后令该角色对伤害来源进行拼点：若该角色胜利，伤害来源与其一同死亡；若伤害来源胜利，该角色立即死亡；若无伤害来源或伤害来源为你，则该角色立即死亡；每当该技能的效果结算结束后，你恢复一点体力",
            
      "圣_weimu":"帷幕",
            "圣_weimu_info":"锁定技，每当你成为其他角色黑色牌的目标时，你令此牌无效并获得之",
            
      "圣_luanwu":"乱武",
            "圣_luanwu_info":"限定技：出牌阶段，你可以弃置一张【杀】，然后令其他所有角色依次向其最近的角色使用一张【杀】，否则失去一点体力；每当一名角色于此技能持续期间而受到伤害时，伤害来源需交给你一张牌；若你因此技能而获得的牌数不大于因此技能而失去体力的角色数的话，该技能刷新但无法于本回合内继续使用",
            
      "圣_qirang":"祈禳",
            "圣_qirang_info":"锁定技，出牌阶段，你可以将一张非基本牌置于牌堆顶，然后获得一层“圣甲”并根据此牌的类型，获得对应类型的一张牌：①锦囊牌(装备牌)；②装备牌(延时锦囊牌)；③延时锦囊牌(锦囊牌)；若你于本回合内将两张相同类型的牌置入了牌堆顶，则该技能失效至回合结束",
            
      "圣_xianchen":"纤尘",
            "圣_xianchen_info":"锁定技，结束阶段，你可以展示手牌并弃置其中所有的基本牌，然后声明一张可选牌的牌名并进行一次判定：若判定结果的花色为♥️，则你获得你所声明的卡牌并可以继续发动该技能(再次发动时无需展示或弃置任何牌)。否则，你失去一点体力，然后随机获得一张♥花色️牌",
            
      "圣_yuhua":"羽化",
            "圣_yuhua_info":"锁定技，你的非基本牌不计入你的手牌上限",
            
      "圣_qixing":"七星",
            "圣_qixing_info":"锁定技，游戏开始时，你额外摸7张牌；你的手牌上限始终+7；出牌阶段（限一次），你可以失去一点体力并弃置手牌区与装备栏内的所有牌(每个区域内的牌数至少需要有一张），然后将手牌数量补至7张",
            
      "圣_longying":"龙影",
            "圣_longying_info":"锁定技，你可以将一张牌按照以下规则使用或打出：</br>♦️卡牌当做【火杀】；♣️卡牌当做【闪】；♥️卡牌当做【桃】；♠️卡牌当做【无懈可击】",
            
      "圣_longying1":"龙影♦️",
            "圣_longying1_info":"",
            
      "圣_longying2":"龙影♥️",
            "圣_longying2_info":"",
            
      "圣_longying3":"龙影♠️",
            "圣_longying3_info":"",
            
      "圣_longying4":"龙影♣️",
            "圣_longying4_info":"",
            
      "圣_nijing":"逆境",
            "圣_nijing_info":"锁定技，摸牌阶段开始时，若你的体力值大于1，你失去X点体力并额外摸等量张牌；你的手牌上限翻倍并+2（X为你当前体力值-1）",
            
      "圣_shenxian":"甚贤",
            "圣_shenxian_info":"锁定技，每当一名其他角色于你的回合外弃置牌后，若其中含有基本牌，你获得之",
            
      "圣_qiangwu":"枪舞",
            "圣_qiangwu_info":"锁定技，出牌阶段，若你当前未获得〖枪舞〗的技能效果，则你可以进行一次判定；若如此做，每当你于本回合内使用【杀】时：若此【杀】的点数：<li>小于判定结果点数的【杀】：此【杀】无视距离且会率先掠夺目标角色装备区内的防具牌；<li>等于判定结果点数的【杀】：此【杀】不可闪避且会令你恢复一点体力值；<li>大于判定结果点数的【杀】：此【杀】不计入出牌次数限制且可造成的伤害+1<li>若判定结果的点数为1或13，则你于本回合内的〖枪舞〗效果改为使用【杀】时无视距离与次数限制且不可被闪避",
            
      "圣_shensu":"神速",
            "圣_shensu_info":"锁定技，准备阶段、出牌阶段、结束阶段开始时，你可以选择任意一名其他角色，视为对其使用一张不计入出牌次数限制的【杀】",
          
      "圣_leili":"雷厉",
            "圣_leili_info":"锁定技，你不能使用但可以重铸【杀】",
            
      "圣_jixi":"疾袭",
            "圣_jixi_info":"锁定技，每当一名其他角色于你的回合外受到伤害后，若伤害来源不为你，你可以对其造成一点雷属性伤害。若如此做，你将武将牌翻面",
            
      "圣_tiance":"天策",
            "圣_tiance_info":"锁定技，每当你受到伤害/失去体力时，你可以令一名角色摸X张牌并弃置Y张牌；若目标角色不为你且其弃置的牌数不少于2/不大于你的手牌数，其恢复一点体力/你获得这些牌并可以交给其至多两张锦囊牌。若如此做，你移除“棋盘”中的一枚“弈”（X为你已损失体力值与“棋盘”中“弈”数量的和；Y为“棋盘”中“弈”数量与其已损失体力值的差）",
            
      "圣_shenmou":"神谋",
            "圣_shenmou_info":"锁定技，每当一名角色的判定结果亮出后，你获得一张同名牌",
            
       "圣_yishi":"弈逝",
            "圣_yishi_info":"锁定技，每当一名角色主动使用的锦囊牌进入弃牌堆后，你可以将一枚“弈”置入“棋盘”并进行一次判定：若判定结果为黑色，你失去一点体力；若判定结果为红色，你获得此牌。若如此做，你即将受到的伤害均累计+X；当“棋盘”中“弈”累计达到十枚或更多后，你立即死亡（X为“棋盘”中所拥有的“弈”数量）",
            
      "圣_jigong":"疾攻",
            "圣_jigong_info":"锁定技，出牌阶段，你可以摸X张牌并令你的攻击范围无限制（X为场上现存活玩家数量）；若如此做，此回合内你的手牌上限改为Y；结束阶段，若Y等于0，你失去一点体力(Y为你此阶段造成的伤害数)",
            
      "圣_jigong2":"疾攻",
            "圣_jigong2_info":"",
            
      "圣_shifei":"饰非",
            "圣_shifei_info":"锁定技，每当你需要打出一张【闪】时，你弃置当前回合角色区域内的一张牌；然后你可以令任意一名其他角色摸一张牌。若如此做，当该角色的手牌数量因此而大于当前回合角色时，你弃置一张牌并视为打出了一张【闪】(无牌则不弃)",
            
      "圣_dihui":"诋毁",
            "圣_dihui_info":"锁定技，其他角色的手牌上限-1",
            
      "圣_jueqing":"绝情",
            "圣_jueqing_info":"锁定技，每当一名持有手牌的角色于其回合外即将受到伤害或恢复体力值时，若其未处于濒死状态，则防止此效果，改为令其失去一点体力并展示所有手牌，然后弃置其中所有的红色牌。若该角色不为你且其手牌中无红色牌，则其额外失去一点体力",
            
       "圣_wuxin":"无心",
            "圣_wuxin_info":"锁定技，每当你恢复体力值后，你弃置所有手牌",
            
       "圣_shangshi":"伤逝",
            "圣_shangshi_info":"锁定技，每当你的手牌数不大于你的已损失体力值时，若此时是你的回合内，你摸X张牌；若此时是你的回合外，你将手牌数补至X(X为你已损失体力值)",
            
      "圣_longyin":"龙吟",
            "圣_longyin_info":"锁定技，每当一名角色于其出牌阶段使用【杀】时，你可以弃置一张牌令此【杀】不计入出牌次数限制，然后你与该角色各摸一张牌。若如此做，你获得一枚“龙义”印记",
            
      "圣_rongzheng":"戎征",
            "圣_rongzheng_info":"锁定技，每当一名其他角色即将受到【杀】的伤害时，若伤害来源不为你，你可以移除一枚“龙义”印记防止此效果。若如此做，你摸一张牌并视为伤害来源对你使用一张【杀】",
            
      "圣_longyix":"龙义",
            "圣_longyix_info":"锁定技，游戏开始时，你获得一枚“龙义”印记",
            
      "圣_huxiao":"虎啸",
            "圣_huxiao_info":"锁定技，每当你造成火属性伤害后，你令目标获得一枚“啸”印记；你对持有“啸”印记的角色使用【杀】不计入出牌次数限制",
            
      "圣_shengyou":"圣佑",
            "圣_shengyou_info":"锁定技，准备阶段，若你未装备武器，你将一张“青龙偃月刀”置入你的装备区；否则你恢复一点体力",
            
      "圣_hunji":"魂继",
            "圣_hunji_info":"觉醒技：结束阶段，若你于此回合内造成的伤害不小于你的当前体力值，你恢复一点体力（若未受伤则改为摸一张牌），然后永久获得技能〖圣佑〗",
            
      "圣_niepan":"涅槃",
            "圣_niepan_info":"限定技：当你处于濒死状态时，你可以重置武将牌并将体力恢复至体力值上限，弃置所有卡牌然后摸4张牌",
          
      "圣_tianyu":"天狱",
            "圣_tianyu_info":"锁定技，你无法被横置；结束阶段，你令一名随机敌方角色横置",
            
      "圣_huanyu":"幻羽",
            "圣_huanyu_info":"锁定技，出牌阶段（限一次），你可以弃置一张♣️牌，将至多3名角色横置或解除横置；若此次仅横置了目标角色，你可以进行一次选择：对首名角色造成一点火/雷属性伤害，然后你恢复一点体力/摸两张牌",
           
      "圣_caishi":"才识",
            "圣_caishi_info":"锁定技，摸牌阶段，你可以选择一项：1.少摸一张牌。若如此做，每当你于本回合内发动〖忠鉴〗时可以额外展示自己的一张牌；2.手牌上限-1。若如此做，每当你于本回合内发动〖忠鉴〗时可以额外展示对方的一张牌；3.额外摸两张牌，若如此做，你于本回合内不能发动〖忠鉴〗，手牌上限+2且使用牌时仅可指定其他角色或自己为目标(单选)",
            
            "圣_zhongjian":"忠鉴",
            "圣_zhongjian_info":"锁定技，出牌阶段(限一次)，你可以展示一张手牌，然后展示手牌数与其当前体力值不相等的一名其他角色的X张手牌（X为其手牌数和体力值较大数与较小数之差且至少为2，不足则全选）。若以此法展示的牌与你展示的牌：有颜色相同，你摸两张牌或获得其区域内的一张牌；有花色相同，你对其造成1点伤害；有点数相同，你弃置展示的卡牌并于本回合内可继续使用该技能；均不同，你于本回合内的手牌上限-1",
            
            "圣_dongcha":"洞察",
            "圣_dongcha_info":"锁定技，每当你使用〖忠鉴〗指定目标后，你令其获得“鉴”印记；每当你即将受到一名持有“鉴”印记的其他角色造成的伤害时，你令其移除“鉴”印记并防止此伤害，然后你将手牌数补至与其相同",
            
      "圣_qianying":"倩影",
            "圣_qianying_info":"锁定技，每名角色的回合限一次，当一名角色进入濒死状态时，你可以令一名存活角色摸五张牌并弃置四张牌。若弃置花色均不同，则视为其令该角色将体力值恢复至一点；否则，你获得所有弃置牌，若此时你未处于濒死状态，你失去一点体力",
            
      "圣_fanghua":"芳华",
            "圣_fanghua_info":"锁定技，当一名其他角色将武将牌翻至背面后，其失去一点体力",
            
      "圣_luoshen":"洛神",
            "圣_luoshen_info":"锁定技，准备阶段，你可以进行一定判定：若判定结果的花色不为♥️，你获得此牌并继续判定，直至出现♥️花色；若你因此技能而获得的牌数不大于2，结束阶段，你可以令一名其他角色翻面",
          
      "圣_xishui":"汐水",
            "圣_xishui_info":"锁定技，你可以将一张非♥️卡牌当做【闪】打出；每当你使用或打出一张【闪】时，你可以令一名其他角色翻面",
            
     "圣_longmai":"龙脉",
            "圣_longmai_longdan":"龙胆",
            "圣_longmai_longdan_info":"",
            "圣_longmai_info":"锁定技，出牌阶段(限一次)，你可以移除X枚“芳”印记与手牌中的一张非基本牌，然后你恢复一点体力并从牌堆中获得一张【杀】与【闪】，若如此做，直至你下回合开始前，视为你拥有技能“龙胆”，且每释放一次“龙胆”便摸X张牌(X为你当前体力值)",
            
            "圣_fanghun":"芳魂",
            "圣_fanghun_info":"锁定技，每当你造成伤害后，你获得X枚“芳”印记（X为此次伤害量翻倍）",
            
            "圣_fuhan":"扶汉",
            "圣_fuhan_info":"觉醒技：准备阶段，若你所持有的“芳”印记数量不小于现存活蜀势力角色数，你需移除当前所持有的所有“芳”印记；若此时你的体力值为1，你恢复X点体力，否则，你摸X张牌；然后永久获得一名随机蜀势力角色的所有技能（X为你此次所移除的“芳”印记数量）",
            
      "圣_buff_mashu":"马术",
            "圣_buff_mashu_info":"",
            
      "圣_buff_feiying":"飞影",
            "圣_buff_feiying_info":"",
            
      "圣_fankui":"反馈",
            "圣_fankui_info":"锁定技，每当你受到伤害时，你获得X枚“馈”印记；然后你令伤害来源进行一次判定：若判定结果为黑色，你可以获得其的X张牌(X为此次伤害量+1)",
            
      "圣_guicai":"鬼才",
            "圣_guicai_info":"锁定技，每当一名角色的判定结果即将生效时，你摸一张牌；若你没有手牌，则改为摸四张牌；若你已受伤，则额外摸X张牌(X为你已损失体力值)；然后你可以打出一张牌替换判定结果，或是取消并弃置一张牌(若你的当前体力值小于你所持有的“馈”印记则跳过此步骤)",
            
      "圣_baiyin":"拜印",
            "圣_baiyin_info":"觉醒技：当你拥有至少3枚“馈”印记时，你需恢复一点体力并重置武将牌，失去技能〖鬼才〗〖反馈〗并永久获得技能〖忍戒〗〖连破〗〖极略〗。然后将手牌数量补至与当前体力值相同",
            
      "圣_renjie":"忍戒",
            "圣_renjie_info":"锁定技，你持有三枚“忍”印记；每当你于回合外受到伤害、失去体力、失去牌后，你获得等量枚“忍”印记；每当你因卡牌而恢复体力值后，你失去一枚“忍”印记",
            
      "圣_lianpo":"连破",
            "圣_lianpo_info":"锁定技，每当你令一名其他角色进入濒死状态时，你于后续的回合结束后摸一张牌并执行一个额外的回合",
            
      "圣_jilue":"极略",
            "圣_jilue_info":"锁定技，每当你受到其他角色造成的伤害时，你可以移除一枚“忍”印记弃置伤害来源一张牌并令其翻面；每当你于回合内使用一张牌后，你可以移除一枚“忍”印记摸一张牌；每当你即将造成伤害时，你可以移除一枚“忍”印记令此伤害+1；每当你即将受到伤害时，你可以移除一枚“忍”印记令此伤害-1",
            
      "圣_jilue_shou":"极略",
            "圣_jilue_shou_info":"是否移除一枚“忍”印记令伤害-1？",
            
      "圣_jilue_gong":"极略",
            "圣_jilue_gong_info":"是否移除一枚“忍”印记令此伤害+1？",
            
      "圣_jilue_draw":"极略",
            "圣_jilue_draw_info":"是否移除一枚“忍”印记摸一张牌？",
            
      "圣_jilue_turnOver":"极略",
            "圣_jilue_turnOver_info":"是否移除一枚“忍”印记弃置伤害来源一张牌并令其翻面？",
            
       "圣_xuanlie":"玄烈",
            "圣_xuanlie_info":"锁定技，每当你即将受到其他角色造成的伤害时，你可以进行一次判定：若判定结果为红色，则令此伤害-1；若判定结果为黑色，你可以弃置伤害来源X张牌；若你拥有“啖”印记，则于结算后对伤害来源造成一点伤害/额外弃置其一张牌（X为此次伤害量+1）",
            
            "圣_danmu":"啖目",
            "圣_danmu_info":"锁定技，每当你受到伤害/恢复体力/准备阶段开始时，若你没有“啖”印记，你获得之",
            
            "圣_hunyong":"魂勇",
            "圣_hunyong_info":"锁定技，每当一名其他角色的回合即将开始时，若你已受伤，你可以移除“啖”印记并摸X张牌，然后你可以交给该角色任意张牌并令其手牌上限+1，或取消并随机弃置一张手牌视为对其使用一张【杀】（X为你已损失体力值）",
            
      "圣_jieao":"桀骜",
            "圣_jieao_info":"锁定技，当你于“狂妄”状态下杀死一名其他角色后，你获得一张【杀】并失去一点体力",
            
      "圣_xishui2":"汐水",
            "圣_xishui2_info":"",
            
      "圣_xiangle":"享乐",
            "圣_xiangle_info":"锁定技，你不能成为其他角色使用【杀】的目标且你无法于出牌阶段主动使用【杀】",
            
            "圣_fangquan":"放权",
            "圣_fangquan_info":"锁定技，准备阶段，你可以将一张手牌交给一名距离为X以内的其他角色(X为游戏轮数)，然后该角色摸一张牌并可以使用一张带有伤害标签的牌。若该角色于此阶段内造成伤害，则你摸Y张牌并跳过本回合的出牌阶段与弃牌阶段(Y为此次伤害量)，然后令其进行一个额外的回合",
            
            "圣_ruoyu":"若愚",
            "圣_ruoyu_info":"觉醒技：当一名通过〖放权〗获得额外回合的角色的回合结束时，若该角色与你均已受伤，你获得该角色的所有手牌并令其恢复一点体力，然后你增加一点体力值上限并恢复一点体力，失去技能〖放权〗〖享乐〗，获得技能〖缴贡〗〖孤掷〗并于本回合结束后立即开始一个额外的回合",
            
            "圣_jiaogong":"缴贡",
            "圣_jiaogong_info":"锁定技，出牌阶段(限一次)，你可以将所有手牌交给一名其他角色并令其获得等量枚“贡”印记。若该角色已受伤，则其移除一枚“贡”印记并恢复一点体力，然后交给你一张牌(若其无牌则跳过此步骤)。若该角色依旧处于受伤状态，则其重复此流程。否则，其受到一点伤害，然后失去一点体力值上限并视为对你使用一张【杀】",
            
            "圣_guzhi":"孤掷",
            "圣_guzhi_info":"使命技：当一名场上的角色进入濒死状态或阵亡时，若该角色持有“贡”印记，你恢复X点体力(X为其持有的“贡”印记)，失去技能〖缴贡〗并获得技能〖汉兴〗；若该角色为你，你失去一点体力值上限并将体力值恢复至1，然后失去技能〖缴贡〗，获得技能〖安乐〗",
            
            "圣_hanxing":"汉兴",
            "圣_hanxing_info":"锁定技，准备阶段，你增加一点体力值上限并恢复一点体力，然后令其他所有角色依次交给你一张牌(无牌则跳过)。若交给你手牌的角色手牌数因此而小于你，则其恢复一点体力值并摸一张牌",
            
            "圣_anle":"安乐",
            "圣_anle_info":"锁定技，准备阶段，你失去一点体力值上限并令其他角色与你的距离永久+1",
            
      "圣_kurou":"苦肉",
            "圣_kurou_info":"锁定技，出牌阶段,你可以选择一名其他角色，你与其各获得对方一张牌，然后依次失去1点体力。若如此做，你或其当前体力值较高的一方弃置一张牌",
            
      "圣_yanzhan":"焰战",
            "圣_yanzhan_info":"锁定技，你使用的红色【杀】无法被闪避",
            
      "圣_zhaxiang":"诈降",
            "圣_zhaxiang_info":"锁定技，每当你失去1点体力后，你摸3张牌；若此时是你的回合内，你后续造成的伤害均视为火属性伤害，使用【杀】无距离限制且使用次数上限+1；若此时是你的回合外，你对当前回合角色造成一点火属性伤害",
            
      "圣_zhuchang":"筑昶",
            "圣_zhuchang_info":"锁定技，摸牌阶段，你始终放弃摸牌，改为从牌堆顶与牌堆底各摸两张牌，然后随机弃置两张手牌",
            
       "圣_qizhi":"奇制",
             "圣_qizhi_info":"锁定技，每当你于回合内使用一张牌后，你可以观看任意一名角色(不可为此牌目标)的牌并将其中任意一张置入牌堆底，然后令其摸一张牌。若你以此法置入牌堆底的牌不为基本牌，你率先摸一张牌；若你的手牌数依旧不大于该角色(不为你自己)，你获得其一张手牌；若你于本回合内已指定过该角色(不为你自己)为目标且场上现存活角色数大于2，你失去一点体力",
            
       "圣_jinqu":"进趋",
             "圣_jinqu_info":"锁定技，准备阶段，你可以弃置至多X张牌(X为你的已损失体力值)；若如此做，当你于本回合弃牌阶段弃置的牌数不小于你的当前体力值时，你从牌堆底摸Y张牌(Y为你于本回合内发动〖奇制〗的次数与你以此法弃置的牌数之和)",
          
       "圣_zongkui":"纵傀",
             "圣_zongkui_info":"锁定技，游戏/回合开始时，你可以令一名未成为“傀儡”的其他角色获得“傀”印记；每当你造成或受到伤害时，你可以令一名未成为“傀儡”的其他角色获得“傀”印记",
            
      "圣_guju":"骨疽",
             "圣_guju_info":"锁定技，每当“傀儡”的体力值变动时，你恢复一点体力并令其移除“傀”印记（若你未受伤则改为仅摸一张牌）",
            
       "圣_baijia":"拜假",
            "圣_baijia_info":"觉醒技：准备阶段，若你已受伤且本局游戏内成为“傀儡”的角色数量不小于你的当前体力值，你需重置武将牌，令其他所有未成为“傀儡”的角色获得“愧”印记。然后你恢复一点体力并永久获得技能〖蚕食〗",    
            
      "圣_canshi":"蚕食",
            "圣_canshi_info":"锁定技，每当你使用牌时，若此牌仅指定了一名角色为目标，你可以移除任意名“傀儡”的“傀”印记，同时选择其为目标（无视距离）；每当一名其他角色使用牌时，若该角色已成为“傀儡”，你可以移除该角色的“傀”印记，令此牌无效并获得之",
            
      "圣_quanji":"权计",
            "圣_quanji_info":"锁定技，每当你受到其他角色造成的伤害时，你可以摸X张牌并获得伤害来源装备区内的X张牌(若伤害来源装备区内无牌则改为摸2X张牌)；然后你可以将至多X张牌至于武将牌旁称为“权”；最后你可以使用一张装备牌；你的手牌上限始终+Y（X为此次伤害量+1；Y等于你所持有的“权”数量的二倍）",
            
      "圣_yexin":"野心",
            "圣_yexin_info":"锁定技，你于濒死阶段外即将恢复的体力均改为摸等量张牌并将牌堆顶的等量张牌置入“权”",
            
      "圣_jinlin":"金鳞",
            "圣_jinlin_info":"锁定技，每当你受到伤害时，你获得等量枚“鳞”印记；当你即将造成的伤害时，你移除所有“鳞”印记令此伤害+X（X为“鳞”印记数量）",
            
      "圣_baijiang":"拜将",
            "圣_baijiang_info":"觉醒技：准备阶段，若你的“权”印记不小于4，你失去〖权计〗〖野心〗，永久获得技能〖排异〗〖金鳞〗，然后恢复一点体力并获得所有武将牌旁的所有“权”",
            
      "圣_paiyi":"排异",
            "圣_paiyi_info":"锁定技，出牌阶段（限一次），你可以将任意张牌交给一名其他角色；若该角色的手牌数量因此而大于你，你对其造成一点伤害；若该角色的体力值同时大于你，则对其额外造成一点伤害；结算完毕后，你摸一张牌",
            
      "圣_qingluo":"青罗",
            "圣_qingluo_info":"锁定技，游戏开始时，你废除防具栏与坐骑栏；你与其他角色/其他角色与你的距离始终-1",
            
      "圣_fenji":"奋激",
            "圣_fenji_recover":"奋激",
            "圣_fenji_damage":"奋激",
            "圣_fenji_lose":"奋激",
            
            "圣_fenji_damage_info":"锁定技，每当一名其他角色于其回合外受到不为你造成伤害或因弃置/被获得而失去牌时，若你的体力值大于体力值上限的一半，你可以失去一点体力令其摸两张牌，然后你摸一张牌；结束阶段，若你的体力值小于体力值上限的一半，你恢复一点体力",
            "圣_fenji_lose_info":"锁定技，每当一名其他角色于其回合外受到不为你造成伤害或因弃置/被获得而失去牌时，若你的体力值大于体力值上限的一半，你可以失去一点体力令其摸两张牌，然后你摸一张牌；结束阶段，若你的体力值小于体力值上限的一半，你恢复一点体力",
            "圣_fenji_info":"锁定技，每当一名其他角色于其回合外受到不为你造成伤害/失去牌时，若你的体力值大于体力值上限的一半，你可以失去一点体力令其摸两张牌，然后你摸一张牌；结束阶段，若你的体力值小于体力值上限的一半，你恢复一点体力",
      
            "圣_hunqu":"魂躯",
      "圣_hunqu_info":"锁定技，当你进入频死状态时，你选择1种花色并展示牌堆顶的1张牌。若此牌非你选择的花色，则你获得此牌并恢复至一点体力",
            
      "圣_quanheng":"权衡",
            "圣_quanheng_info":"锁定技，出牌阶段(限一次)，你可以将任意张牌置于武将牌旁称为“衡”；然后你可以令任意一名角色摸等量张牌或弃置等量张牌；若该角色不为你且其当前体力值与手牌数之和大于你，你令其翻面并失去一点体力，然后你摸X张牌(X为你所持有的“衡”数量与该角色当前手牌数的差)",
            
            "圣_yuanju":"援据",
            "圣_yuanju_info":"锁定技，每当你即将恢复体力时，若你的当前体力值不大于体力值上限且当前持有“衡”，你可以移除至多X张“衡”并额外恢复等量的体力(X为你的已损失体力值与此次恢复量的差)",
            
            "圣_juelue":"决略",
            "圣_juelue_info":"觉醒技：准备阶段，若你所持有的“衡”的数量不小于现存活角色数，你根据最近的一次的造成伤害/受到伤害而令所有未横置的敌方角色/友方角色摸一张牌并横置，然后你需选择并获得至多X张“衡”(X为因此技能而摸牌的数量)，失去技能〖权衡〗〖援据〗并永久获得技能〖弘谋〗〖智略〗/〖嘉禾〗〖昏尘〗",
            
            "圣_hongmou":"弘谋",
            "圣_hongmou_info":"锁定技，出牌阶段(限一次)，你可以摸X张牌并需将至少X张牌置于武将牌旁称为“谋”；每当你发动此技能摸牌时，若你的武将牌旁持有“谋”，你同时获得所有“谋”(X为你的当前体力值)",
            
            "圣_zhilue":"智略",
            "圣_zhilue_info":"锁定技，出牌阶段，若你已于本回合内发动过〖弘谋〗，你可以将两张“谋”交给一名其他角色，然后令其展示所有手牌并横置；若其已横置，则改为对其造成一点火属性伤害，然后你于本回合内无法再对其使用此技能",
            
            "圣_jiahe":"嘉禾",
            "圣_jiahe_info":"锁定技，每当你受到一名其他角色造成的伤害时，若其未持有“嘉”印记且你有手牌，你令伤害来源获得你的一张手牌并获得“嘉”印记；你与持有“嘉”印记的角色双方之间的距离为一但其无法对你使用【杀】；每当持有“嘉”印记的角色受到伤害时，你需交给其一张牌",
            
            "圣_hunchen":"昏尘",
            "圣_hunchen_info":"锁定技，出牌阶段(限一次)/每当你受到伤害时，你可以/需摸X张牌并需弃置X张牌(若你先前无牌则无需弃置)，然后对/令所有与你距离为一的其他角色造成/受到来自于伤害来源的一点伤害。若即将受到伤害的角色持有“嘉”印记，则率先移除之(X为你的已损失体力值)",
            
      "圣_mohua":"莫化",
            "圣_mohua_info":"锁定技，每当一名其他角色的体力值于你的回合外发生变动时，若你的手牌数不大于你当前体力值的3倍，你摸一张牌",
            
      "圣_shelie":"涉猎",
            "圣_shelie_info":"锁定技，摸牌阶段，你可以放弃摸牌并失去一点体力，然后从牌堆中依次随机获得四种不同花色的牌各一张",
            
      "圣_gongxin":"攻心",
            "圣_gongxin_info":"锁定技，出牌阶段（限一次），你可以弃置一张♥️花色牌，选择并观看一名其他角色的手牌，然后你可以获得其中一张♥️花色的牌，并弃置其余所有手牌",
            
      "圣_jianxiong":"奸雄",
            "圣_jianxiong_info":"锁定技，每当你受到卡牌造成的伤害时，你立即获得对你造成伤害的牌并令伤害来源展示手牌；然后你可以令一名其他角色摸一张牌（不可为伤害来源）。若如此做，该角色需对伤害来源使用一张【杀】，否则其失去一点体力（此杀无视距离）",
            
      "圣_baquan":"霸权",
            "圣_baquan_info":"锁定技，每当你需要打出一张【闪】时，你可以选择并观看一名其他角色的手牌（不可为对你使用卡牌的角色），然后可以使用其中的一张【闪】",
          
      "圣_luange":"鸾歌",
            "圣_luange_info":"锁定技，准备阶段，你可以跳过本回合内的摸牌阶段，然后将一张牌交给一名其他角色；若如此做，每当你于本回合内后续对该角色使用的【杀】被闪避后，若你已于本回合内使用过技能〖枪舞〗，则你移除〖枪舞〗效果，视为对其使用一张不计入出牌次数限制的【杀】",
            
      "圣_juemo":"绝末",
            "圣_juemo_info":"锁定技，你的进攻/防御距离始终-/+X（X为你已损失体力值）",
            
      "圣_guixin":"归心",
            "圣_guixin_info":"锁定技，每当你因受到伤害/失去体力/恢复体力而使得体力值变动时，每变动1点体力值时你便可以摸一张牌并获得每名其他角色区域里的一张牌，然后你翻面并进行一次〖飞影〗的技能选项",
            
      "圣_weiwu":"魏武",
            "圣_weiwu_info":"觉醒技：当一名已受伤的其他角色的回合即将开始时，若其体力值小于你且其区域内的卡牌数量大于你，你需重置武将牌，令其恢复一点体力并获得其区域内的所有卡牌，然后你失去技能〖奸雄〗〖霸权〗，永久获得技能〖猎雅〗〖飞影〗〖归心〗",
            
      "圣_feiying":"飞影",
            "圣_feiying_info":"锁定技，准备阶段，你需进行一次选项：1.进攻距离+1；2.防御距离+1（该效果持续至下回合初）",
            
      "圣_lieya":"猎雅",
            "圣_lieya_info":"锁定技，出牌阶段（限一次），你可以将一张牌交给一名女性角色，然后获得其区域内的一张牌并于本回合内与其的距离计算视为一；若如此做，其他所有男性角色依次可以对你使用一张【杀】（无视距离）",
            
      "圣_canshi1":"蚕食",
            "圣_canshi1_info":"锁定技，每当你使用牌时，若此牌仅指定了一名角色为目标，你可以移除任意名“傀儡”的“傀”印记，同时选择其为目标（无视距离）",
          
      "圣_canshi2":"蚕食",
            "圣_canshi2_info":"锁定技，每当一名其他角色使用牌时，若该角色已成为“傀儡”，你可以移除该角色的“傀”印记，令此牌无效并获得之",
            
      "圣_cangdao":"苍道",
            "圣_cangdao_info":"锁定技，每当一名角色的判定牌即将生效时，你可以打出一张牌替换并摸一张牌。若你以此法打出的牌为黑色牌，则你可以将一名其他角色横置",
            
            "圣_shenshu":"神术",
            "圣_shenshu_info":"锁定技，每当一名已受伤且未横置的其他角色即将受到伤害时，你令其恢复一点体力值并将其武将牌横置",
            
            "圣_leiyu":"雷狱",
            "圣_leiyu_info":"锁定技，每当你打出一张【闪】时，你可以令一名其他角色进行一次判定：若判定结果为黑色，则你可以对其造成一点雷属性伤害，然后重复此步骤并令每次可造成的伤害量+1",
            
            "圣_yingyuan":"应援",
            "圣_yingyuan_info":"锁定技，出牌阶段(限一次)，你可以弃置任意张牌并选择至多等量名其他角色。若如此做，你摸X张牌(X为你以此法所弃置的牌数)并依次交给以此法所选择的角色一张牌，然后令其中手牌数依旧小于你的角色依次摸一张牌并令手牌数因此而大于你的角色依次交给你一张牌",
            
            "圣_naman":"纳蛮",
            "圣_naman_info":"锁定技，每当你成为其他角色使用【杀】的目标时，你可以交给此【杀】的使用者一张牌并获得此【杀】。若此【杀】的使用者已通过此技能而获得过牌，则你对其造成一点伤害",
            
            "圣_zishu":"自书",
            "圣_zishu_info":"锁定技，每当你获得牌时，你额外摸一张牌",
            
            "圣_zhendu":"鸩毒",
            "圣_zhendu_info":"锁定技，每当一名其他角色使用【酒】时，其失去一点体力，然后你于本回合内不可成为【杀】的目标",
            
            "圣_zhenjiu":"斟酒",
            "圣_zhenjiu_info":"锁定技，每当一名其他角色的准备阶段开始时，你可以弃置一张牌并获得其一张牌。若如此做，视为其使用了一张【酒】",
            
            "圣_qiluan":"戚乱",
            "圣_qiluan_info":"锁定技，每当一名其他角色阵亡后，若无伤害来源或伤害来源为你，你摸三张牌；然后你可以令一名其他角色获得一张【酒】",
            
            "圣_hanyin":"酣饮",
            "圣_hanyin_info":"锁定技，结束阶段，你需弃置所有手牌，然后获得等量枚“酣饮”印记；每当你使用【杀】对一名其他角色造成或受到一名其他角色所造成的伤害时，你失去一点体力值上限，然后对该角色/伤害来源造成X点伤害并令技能〖暴敛〗于本回合内失效(X为你所持有的“酣饮”印记数量)",
            
            "圣_baling":"霸凌",
            "圣_baling_info":"锁定技，出牌阶段(限一次)，若你的手中有红色牌，你可以展示一名其他角色的所有手牌，然后获得其手牌中的所有黑色牌。若如此做，你展示手牌并弃置其中所有的红色牌。若此时你的手牌数大于该角色，你对其造成一点伤害。否则，该角色对你造成一点伤害，然后你获得其所有牌",
            
            "圣_baolian":"暴敛",
            "圣_baolian_info":"锁定技，准备/结束阶段，你增加/失去X/Y点体力值上限(X为你所持有的“酣饮”印记数量/Y为你的已损失体力值)",
            
            "圣_tieji":"铁骑",
            "圣_tieji_info":"锁定技，每当你使用【杀】指定一名其他角色为目标时，你可以令其获得“骑”印记并令此【杀】无视其防具，然后进行一次判定：若判定结果为红色，你令此【杀】不计入出牌次数限制且不可闪避；若判定结果为黑色，则角色需弃置一张与判定结果花色相同的牌，否则你防止此【杀】效果，改为令其失去一点体力",
            
            "圣_xunxi":"迅袭",
            "圣_xunxi_info":"锁定技，你与装备区内坐骑栏有牌的角色的距离视为一；出牌阶段开始时，若你的体力值大于一且手牌中未持有【杀】，你失去一点体力，然后获得一张【杀】",
            
            "圣_lveji":"掠迹",
            "圣_lveji_info":"锁定技，每当你使用【杀】指定一名其他角色为目标时，你可以获得至多X名(X为你已损失体力值)其他角色的一张牌。若你以此法选择的目标角色数未达到X名，你受到一点伤害，然后令所有持有“骑”印记的角色移除“骑”印记摸一张牌并受到一点来自于你的伤害",
            
            "圣_xiaoyuan":"骁缘",
            "圣_xiaoyuan_info":"锁定技，出牌阶段（限一次），你可以将一张装备区内的牌置于一名其他角色的装备区内并与其“结缘”（替换原装备），然后你与其各摸一张牌并互相获得对方的一张手牌。若如此做，你或其体力值较低的一方恢复一点体力。若你与其体力值同，则改为你与其同时恢复一点体力",
            
            "圣_xiaoji":"枭姬",
            "圣_xiaoji_info":"锁定技，每当你失去一张装备区的牌后，你摸X张牌（X为本局游戏内与你“结缘”的角色数+1）",
            
            "圣_liangzhu":"良助",
            "圣_liangzhu_info":"锁定技，每当一名其他角色恢复体力值后，你可以令你或该角色摸两张牌；若你选择的目标为该角色且其为已与你“结缘”，则其摸牌后你摸一张牌",
            
            "圣_qianxi":"潜袭",
            "圣_qianxi_info":"锁定技，出牌阶段（限一次），你可以摸一张牌并弃置一张牌，然后令一名其他角色获得“袭”印记；你与拥有此印记的角色的距离视为一且其仅可使用或打出与你弃置的牌花色相同的手牌",
            
            "圣_mdzhanjue":"斩绝",
            "圣_mdzhanjue_info":"锁定技，你对未受伤/体力值无上限的角色造成的伤害均视为扣减其等量体力值上限/将其体力值上限扣减至4",
            
            "圣_chengmou":"惩谋",
            "圣_chengmou_info":"锁定技，每当你使用【杀】指定一名已受伤的其他角色为目标时，你可以令其摸一张牌并交给你两张牌（不足则全选）若如此做，其将体力值恢复至体力值上限并于当前回合结束时失去以此法恢复的体力值",
            
            "圣_guiming_dying":"归命",
            "圣_guiming_dying_info":"觉醒技：当一名其他角色阵亡后，若伤害来源不为你，你失去技能〖朝变〗〖伪隐〗，永久获得技能〖明政〗〖自律〗，然后恢复一点体力并开启此技能的二次觉醒(觉醒技：当你杀死一名其他角色后，你失去技能〖明政〗〖自律〗 ，永久获得技能〖残蚀〗〖仇海〗，然后增加一点体力值上限并摸三张牌)",
            
            "圣_guiming_source":"归命",
            "圣_guiming_source_info":"觉醒技：当一名其他角色阵亡后，若伤害来源不为你，你失去技能〖朝变〗〖伪隐〗，永久获得技能〖明政〗〖自律〗，然后恢复一点体力并开启此技能的二次觉醒(觉醒技：当你杀死一名其他角色后，你失去技能〖明政〗〖自律〗 ，永久获得技能〖残蚀〗〖仇海〗，然后增加一点体力值上限并摸三张牌)",
            
            "圣_chaobian":"朝变",
            "圣_chaobian_info":"锁定技，出牌阶段（限一次），你可以弃置所有手牌并选择一名其他角色。若如此做，根据其的身份，其需弃置等量张牌并受到来自于你的一点伤害/其获得这些牌然后你恢复一点体力",
            
            "圣_shcanshi":"残蚀",
            "圣_shcanshi_info":"锁定技，准备阶段，你可以摸X张牌。若如此做，本回合内每当你使用一张基本或锦囊牌时，你需选择弃置一张牌或失去一点体力；结束阶段，你可以对一名其他角色造成一点伤害（X为场上受伤角色数量+你已损失体力值）",
            
            "圣_chouhai":"仇海",
            "圣_chouhai_info":"锁定技，若你没有手牌，你造成或受到的伤害均翻倍",
            
            "圣_zilv":"自律",
            "圣_zilv_info":"锁定技，你的手牌上限始终翻倍；当你于回合内对其他角色造成伤害后，你后续使用的牌仅可指定自己为目标",
            
            "圣_mingzheng":"明政",
            "圣_mingzheng_info":"锁定技，出牌阶段(限一次)，你可以弃置一张牌。若此牌为基本牌，你摸三张牌并弃置一张牌；若此牌为锦囊牌，视为你使用一张【五谷丰登】；若此牌为装备牌，视为你使用一张【桃园结义】",
            
            "圣_weiyin":"伪隐",
            "圣_weiyin_info":"锁定技，每当你即将受到其他角色所造成的伤害时，如果伤害来源的手牌数大于你，则防止之",
            
            "圣_wanrong":"婉容",
            "圣_wanrong_info":"锁定技，每当一名其他角色使用红色牌造成伤害时，你摸一张牌",
            
            "圣_yanxiao_ins":"言笑",
            "圣_yanxiao_ins_info":"",
            "圣_yanxiao_rem":"言笑",
            "圣_yanxiao_rem_info":"",
            "圣_yanxiao_buff":"言笑",
            "圣_yanxiao_buff_info":"",
            "圣_yanxiao_debuff":"言笑",
            "圣_yanxiao_debuff_info":"",
            
            "圣_liuli":"流离",
            "圣_liuli_info":"锁定技，每当你成为【杀】的目标时，你可以弃置一张牌将此【杀】的目标转移至一名其他角色(不可为此牌使用者)。若如此做，若你的体力值大于此【杀】当前的目标角色，你失去一点体力；若你的手牌数量小于此【杀】的使用者，你获得此【杀】",
            
            "圣_yanxiao":"言笑",
            "圣_yanxiao_info":"转换技：①出牌阶段，你可以弃置一张♦️卡牌并选择一名其他角色；若如此做，你摸一张牌并令该角色于其下回合准备阶段进行一次判定：若判定结果不为♥️，该角色跳过摸牌阶段与出牌阶段；②出牌阶段，你可以将一张♦️卡牌置于一名角色的武将牌旁并摸一张牌；若如此做，该角色于其回合开始时获得此牌与其判定区内的所有牌",
            
            "圣_fenying":"焚营",
            "圣_fenying_info":"锁定技，每当一名角色失去最后一张手牌后，你摸X张牌；若该角色不为你且其处于横置状态，你对其造成一点火属性伤害(X为你或其体力值较少一方的当前体力值)",
            
            "圣_qianxun":"谦逊",
            "圣_qianxun_info":"锁定技，每当一名其他角色对你造成伤害时，其横置并弃置所有手牌，然后获得你至多X张手牌(X为你或其体力值较少一方的已损失体力值)",
            
            "圣_lingji":"陵稷",
            "圣_lingji_info":"觉醒技：准备阶段，若你的手牌数量为全场最多且累计造成的火属性伤害不小于场上现存活角色数，你令场上所有角色各摸一张牌，然后失去技能〖焚营〗〖谦逊〗，永久获得技能〖摧克〗〖军略〗〖绽火〗",
            
            "圣_cuike":"摧克",
            "圣_cuike_info":"锁定技，准备阶段，若你所持有的“军略”印记的数量为奇数，你可以对一名角色造成一点伤害；若目标角色的当前体力值依旧不小于你，你恢复一点体力；若你所持有的“军略”印记的数量为偶数，你可以横置一名角色并弃置其区域内的至多两张牌。若该角色区域内的卡牌数量不小于你，则改为获得之",
            
            "圣_zhanhuo":"绽火",
            "圣_zhanhuo_info":"限定技：出牌阶段(每五轮限一次)，若你所持有的“军略”印记不少于7枚，你可以移除7枚“军略”印记，获得至多等量已横置角色装备区内的一张牌。若如此做，你需选择其中的一名目标角色，然后对其造成1点火属性伤害。若你所持有的“军略”印记依旧不小于场上现存活角色的X倍，则改为两点火属性伤害(X为你的当前体力值)",
            
            "圣_junlve":"军略",
            "圣_junlve_info":"锁定技，你持有2枚“军略”印记；每当你造成或受到伤害时，你获得等量枚“军略”印记",
            
            "圣_wengua2":"问卦",
            "圣_wengua2_info":"",
            "圣_wengua":"问卦",
            "圣_wengua_info":"锁定技，每名角色可于其出牌阶段交给你一张牌，然后你可以将一张牌(若为你则跳过此步骤)置于牌堆顶/牌堆底并从另一端摸一张牌。若如此做，其需选择一种花色并展示牌堆顶的一张牌：若展示卡牌的花色与其所选择的花色一致，该角色摸一张牌并获得一张【杀】，然后于本回合内使用【杀】无次数限制且与其他所有角色的距离视为一；若展示卡牌的花色与其所选择的花色不同，则其摸两张牌并于本回合内的手牌上限-1",
            
            "圣_zhenmou":"贞谋",
            "圣_zhenmou_info":"锁定技，每当一名男性角色阵亡后，你可以将至多两名现存活的男性角色进行标记。若如此做，该技能将无法再次使用；每当你使用【杀】指定除被标记角色以外的其他人为目标时，被你标记的角色率先视为对其使用一张【杀】",
            
            "圣_fuzhu":"伏诛",
            "圣_fuzhu_info":"限定技：一名男性角色的回合结束时，若牌堆中的【杀】不超过你与该角色已损失体力值之和的十倍，则你可以对其依次使用牌堆中所有的【杀】，然后洗牌。若目标角色因此而阵亡，你将体力值恢复至体力值上限并摸等量张牌；若目标角色未阵亡，你弃置区域内的所有牌并失去一点体力，然后刷新此技能",
            
            "圣_tianming":"天命",
            "圣_tianming_info":"锁定技，每当你成为【杀】的目标时，你获得一枚“隐兵”印记；然后你可以摸X张牌(X为你所持有的“隐兵”印记数量)或摸Y张牌(Y为此【杀】使用者的手牌数且最少为2；若场上无标记角色则强制执行效果2中属于你的部分)；若你选择了前者，则你于摸牌后移除所有“隐兵”印记并受到来自于标记角色的一点伤害；若你选择了后者，则若你已受伤，你恢复一点体力并弃置Y-1张牌，否则，你弃置两张牌，然后获得两枚“隐兵”印记，若被标记角色不为此【杀】的使用者，其也执行相应步骤，并于结束时失去一点体力",
            
            "圣_putian":"普天",
            "圣_putian_info":"锁定技，每当你受到一名其他男性角色造成的伤害后，若场上现存活角色中未存在被你标记的角色，你将其标记；若你当前所持有“隐兵”印记：每当你受到被标记角色造成的伤害时，若此伤害为【杀】所造成，则其失去一点体力值上限，你弃置区域内的所有卡牌并移除所有“隐兵”印记；否则，其失去一点体力",
            
            "圣_mizhao":"密诏",
            "圣_mizhao_info":"锁定技，出牌阶段(限一次)，若你当前持有“隐兵”印记，你可以将所有手牌交给一名未被你标记的其他角色，然后该角色需与你所选择的另一名有手牌的其他角色进行拼点：若该角色拼点胜利或平局，你将手牌数补至与该角色相同并依次移除所有“隐兵”印记。每移除一枚“隐兵”印记便视为该角色对拼点失败角色使用一张【杀】(若此期间有任意一方阵亡则终止移除印记)；若该角色拼点失败， 则视为拼点胜利角色对你与其各使用一张【杀】。若此拼点胜利角色已被你标记，则你率先移除所有“隐兵”印记",
            
            "圣_qieting":"窃听",
            "圣_qieting_info":"锁定技，每当一名于其回合内使用牌未指定除其自己之外的其他角色为目标的角色(不可为你)的回合结束时，若其某一区域内的卡牌数量大于你，你可以摸两张牌并弃置一张牌或获得其卡牌数量大于你的区域内的一张牌；否则，改为可以将其装备栏内的一张牌移动至你对应的装备区(替换原装备)；若其装备区无牌则改为摸一张牌",
            
            "圣_zhouyan":"绉言",
            "圣_zhouyan_info":"锁定技，与你距离为一且装备区内卡牌数量大于你的角色于其回合内随机弃置一张装备牌并于此回合内后续使用的牌仅可指定其自己为目标",
            
            "圣_xianzhou":"献州",
            "圣_xianzhou_info":"限定技：出牌阶段，你可以将装备区内所有的卡牌交给一名其他角色，然后该角色可以使用至多X张装备牌(X为你交给该角色的装备数)；若如此做，其需选择一项：令你恢复X点体力(超出体力值上限的部分改为摸翻倍的牌)；对其攻击范围内的至多X名角色各造成一点伤害；对其攻击范围内的一名角色造成X点伤害",
            
            "圣_anxu":"安恤",
            "圣_anxu_info":"锁定技，出牌阶段(限一次)，你可以弃置一张牌并选择两名手牌数不相等的角色。你令牌数较少的一方获得对方的一张牌，然后令手牌数较多的一方交给对方一张牌。若双方的手牌数因此而相等，你展示牌堆顶的一张牌。若此牌的花色不为♠️，你恢复一点体力并摸一张牌；否则，你失去一点体力并获得此牌",
            
            "圣_shuya":"淑雅",
            "圣_shuya_info":"锁定技，当一名其他角色一次性失去至少两张牌后，每当其于此回合内后续摸牌时，你摸等量张牌",
            
            "圣_zhuiyi":"追忆",
            "圣_zhuiyi_info":"限定技：当你进入濒死状态时，你可以令一名其他角色摸三张牌；然后，若其未受伤且其的手牌数因此而大于其的当前体力值，你失去一点体力值上限并将体力值恢复至一；否则，该角色暂时增加一点体力值上限并恢复已损失的所有体力值，然后于其下回合开始时失去以此法恢复的体力值上限与体力值",
            
            "圣_zenhui":"谮毁",
            "圣_zenhui_info":"锁定技，每当你使用【杀】或黑色锦囊牌仅指定一名角色为目标时，你可以令一名非此牌目标的其他角色(不可为持有“谀”印记的角色)选择一项：交给你一张牌，然后成为此牌的使用者。若如此做，该角色获得“谀”印记；或取消并弃置一张牌(若其无牌则改为失去一点体力)，然后成为此牌的额外目标",

            "圣_jiaojin":"骄矜",
            "圣_jiaojin_info":"锁定技，每当你即将受到伤害时，你可以弃置一张装备牌防止此伤害。然后，若该伤害来源为男性，所有持有“谀”印记的角色移除“谀”印记并视为其发起一次【决斗】；若该角色为女性，所有持有“谀”印记的角色移除“谀”印记并视为对其使用一张【杀】",

            "圣_diyu":"诋谀",
            "圣_diyu_info":"锁定技，每当一名其他角色于其回合外受到【杀】所造成的伤害时，若伤害来源不为你，你与伤害来源各摸一张牌，然后依次弃置一张牌(若其持有“谀”印记则均无需弃牌)",

            "圣_meibunew":"魅步",
            "圣_meibunew_info":"",
            "圣_meibu":"魅步",
            "圣_meibu_info":"锁定技，每当一名其他角色的回合开始时，你可以交给其一张牌。若如此做，该角色于本回合内的所有锦囊与装备牌均视为【杀】，且其使用牌时仅可指定你为目标。当该角色造成伤害时，其失去一点体力并于本回合内后续无法使用任何牌",
            
            "圣_zhixi":"止息",
            "圣_zhixi_info":"锁定技，每当你于回合内使用了X张牌后，你摸X张牌并立即结束此回合(X为你的当前体力值)",
            
            "圣_mumu":"穆穆",
            "圣_mumu_info":"锁定技，准备阶段，你可以弃置你装备区内的所有牌(若你的装备区内无牌则改为失去一点体力)，然后选择弃置一名其他角色装备区内的所有牌；或者获得一名其他角色装备区内的所有牌，若如此做，直至本回合结束前，你无法使用【杀】",
            
            "圣_yanshi":"炎矢",
            "圣_yanshi_info":"锁定技，出牌阶段，你可以弃置两张牌并进入横置状态；若如此做，其他所有角色需依次打出一张【闪】，否则受到一点来自于你的火属性伤害；每当一名角色因此技能而打出【闪】时，你摸一张牌；若你以此法弃置的牌花色不相同，你于本回合内无法再次使用该技能",
            
            "圣_xueyi":"血裔",
            "圣_xueyi_info":"锁定技，准备阶段，若你的当前体力值大于你的当前手牌数，你于本回合内使用〖炎矢〗时无视此技能的负面效果；否则，你于本回合内的手牌上限+X(X为你于本回合内使用技能〖炎矢〗所弃置的牌数+1)",
            
            "圣_faluan":"伐乱",
            "圣_faluan_info":"锁定技，出牌阶段(限一次)，你可以将两张牌交给一名其他角色并视为对其发起拼点。若你赢，你获得其所有牌并令其于本回合内不会成为〖炎矢〗的技能目标，且每当你对除该角色以外的其他角色造成一点伤害时，该角色摸一张牌；若你没赢，你受到来自于其的一点伤害并于本回合内无法使用技能〖炎矢〗",
            
            "圣_zhenlie":"贞烈",
            "圣_zhenlie_info":"锁定技，每当你成为其他角色使用牌的目标时，你可以失去一点体力令此牌对你无效，然后令其摸一张牌。若如此做，你观看其的手牌并弃可以置其中至多X张牌(X为其与你当前体力值之差且至少为1)。若你以此法弃置的牌数不大于你的已损失体力值，该角色展示所有手牌(若其没有手牌则改为弃置装备区内的一张牌)并失去一点体力",
            
            "圣_lieran":"冽然",
            "圣_lieran_info":"锁定技，每当你的判定牌亮出时，你展示牌堆顶的一张牌，若此牌与判定结果牌的颜色不一致，你将判定结果更改为你以此法展示的牌；否则，你获得两张判定牌",
            
            "圣_miji":"秘计",
            "圣_miji_info":"锁定技，每当你的准备或结束阶段开始时(发动成功后于本回合内仅限一次)，你可以进行一次判定：若判定结果为黑色，你摸X张牌并可以将至多等量张手牌置于一名已受伤的其他角色的武将牌旁称为“计”(X为你已损失体力值)；当该角色成为【杀】的目标时，其获得武将牌旁的所有“计”，然后令此【杀】无效",
            
            "圣_lieyin":"烈饮",
            "圣_lieyin_info":"锁定技，游戏开始/每当你的体力值恢复至体力值上限时，你失去X点体力值(X为你当前体力值-1)，然后获得Y枚“烈”印记(Y为此次失去体力值的量+1)；每当你使用【杀】时移除一枚“烈”印记，然后令此【杀】可造成的伤害量翻倍；每当你进入濒死状态时，你移除一枚“烈”印记，然后将体力值恢复至一",
            
            "圣_liaoya":"獠牙",
            "圣_liaoya_info":"锁定技，每当你受到其他角色造成的伤害后，若伤害来源未持有“獠”印记，其获得之。否则，你移除其所持有的“獠”印记并获得其所有牌；你对持有“獠”印记的角色使用【杀】不计入出牌次数限制且不可闪避",
            
            "圣_huangnu":"荒怒",
            "圣_huangnu_info":"觉醒技：准备阶段，若你已受伤且当前未持有“烈”印记，你立即获得4枚“烈”印记并于本回合内的所有手牌均视为【杀】且与其他所有角色的距离计算视为一；此回合结束时，你恢复一点体力，失去技能〖烈饮〗〖獠牙〗，永久获得技能〖猖啸〗〖谑戾〗，然后移除其他所有角色所持有的“獠”印记并获得其所有牌",
            
            "圣_changxiao":"猖啸",
            "圣_changxiao_info":"锁定技，每当你成为其他角色使用【杀】的目标时，你令此牌的使用者摸一张牌，然后你获得一张【杀】；若如此做，你于下个回合结束前对该角色使用的【杀】均不计入出牌次数限制且不可闪避",
            
            "圣_xueli":"谑戾",
            "圣_xueli_info":"锁定技，出牌阶段(限一次)，你可以展示手牌并弃置其中所有红色牌；若如此做，每当你于本回合内即将受到【杀】所造成的伤害时，防止之；然后，所有手牌数大于你的其他角色依次视为对你使用一张【杀】；该技能效果结算结束后，你于本回合内使用【杀】时无视目标角色的防具；结束阶段，若你于本回合内造成的伤害未达到X(X为你于本回合内因此技能而防止的伤害量)，你失去Y点体力(Y为你以此法防止的伤害量与你本回合内所造成的伤害量之差)",
            
            "圣_jieyuan":"竭缘",
            "圣_jieyuan_info":"锁定技，每当你即将对一名体力值不小于你的其他角色造成伤害时，你展示手牌并弃置其中所有的黑色牌，然后令此伤害+X(X为你此次弃置的黑色牌数量且至少为1)；每当你即将受到一名体力值不小于你的其他角色所造成的伤害时，你展示手牌并弃置其中所有的红色牌，然后防止此伤害并令伤害来源失去一点体力",
            
            "圣_yijue":"抑绝",
            "圣_yijue_info":"锁定技，每当你受到其他角色所造成的伤害后，你令伤害来源于其下回合结束前无法恢复体力。若此时你的当前体力值为1，你失去一点体力值上限，然后恢复一点体力",
            
            "圣_fenxin":"焚心",
            "圣_fenxin_info":"锁定技，每当一名其他角色死亡后，若伤害来源曾对你造成过伤害，你将技能〖竭缘〗中的“体力值不小于你”的限制效果移除；若该角色曾对你造成过伤害，你将技能〖竭缘〗中的“弃置所有对应颜色牌”的限制效果移除",
            
            "圣_xunye":"殉业",
            "圣_xunye_info":"锁定技，每当一名手牌数不大于你的其他角色摸牌后，若其手牌数因此而大于你且你已受伤，你恢复一点体力",
            
            "圣_jieming":"节命",
            "圣_jieming_info":"锁定技，每当你受到一点伤害后，你可以令一名角色将手牌补至X(X为该角色的体力值上限与手牌数或已损失体力值较少一方的和且至少为1)；若你以此法选择的目标角色的当前手牌数不小于其的体力值上限，则改为令该角色将当前手牌数翻倍且于其手牌数小于其体力值上限或其下回合开始前均不可再次对其发动该技能",
            
            "圣_quhu":"驱虎",
            "圣_quhu_info":"锁定技，出牌阶段，你可以与一名其他角色进行拼点，若该角色的体力值不大于你，你率先失去一点体力且于下回合开始前不可再次使用该技能。若你赢，你可以令该角色对一名其他角色造成一点伤害。若此时场上角色不大于2，则改为对其造成一点伤害(若你因此法而失去了体力，则改为两点伤害)；若你没赢，你受到一点来自于该角色的伤害(若你因此技能而失去了体力且当前体力值为1，则你率先恢复一点体力)",
            
            "圣_shenzhi":"神智",
            "圣_shenzhi_info":"锁定技，摸牌阶段，若你已受伤，你可以放弃摸牌并弃置所有手牌。若如此做，你恢复一点体力并摸一张牌。若此时你依旧处于受伤状态，你重复此流程并于此流程内额外摸X张牌(X为你以此法恢复体力值的次数+1) ",
            
            "圣_shushen":"淑慎",
            "圣_shushen_info":"锁定技，每当你恢复体力值后，你可以令一名其他角色恢复等量体力值。若该角色的体力值依旧不大于你且你的当前体力值大于1，你失去一点体力并令其摸2+X张牌(X为其已损失体力值)",
            
            "圣_ruosi":"偌思",
            "圣_ruosi_info":"锁定技，每当你于回合外受到其他角色造成的伤害后，你令技能〖淑慧〗于该角色下回合开始前对其首次所产生的效果反转。然后，若你已于上回合内发动过技能〖神智〗，你将武将牌翻面并摸一张牌",
            
            "圣_juxiang":"巨象",
            "圣_juxiang_info":"锁定技，每轮游戏开始时，你随机令X名其他角色获得一张【南蛮入侵】(X为你于上一轮所受到的伤害量)；【南蛮入侵】对你产生的效果改为令你恢复一点体力；其他角色使用的【南蛮入侵】进入弃牌堆后，你摸一张牌并将其置于牌堆顶；每当一名其他角色因响应而打出【杀】时，你视为对其使用一张【杀】",
            
            "圣_lieren":"烈刃",
            "圣_lieren_info":"锁定技，每当你使用【杀】指定目标时，你可以与其拼点：若你赢，你获得其一张手牌(若其无手牌则改为你摸一张牌)；若你没赢，你受到来自其的一点伤害并依次将两张置入弃牌堆的拼点牌收入手中",
            
            "圣_yanyi":"焱裔",
            "圣_yanyi_info":"锁定技，每当你使用牌指定一名装备区内拥有防具牌的其他角色为目标时，你率先对其造成一点火属性伤害，然后获得该角色的防具牌",
            
            "圣_chuli":"除疬",
            "圣_chuli_info":"锁定技，出牌阶段(限一次)，你可以展示所有手牌，然后令一名已受伤的其他角色展示手牌(无牌则跳过此步骤)并恢复所有已损失体力值。若你以此法所展示的双方所有牌中的黑色牌数量不小于红色牌数量，则你弃置所有手牌，该角色失去一点体力值上限",
            
            "圣_qingnang":"青囊",
            "圣_qingnang_info":"锁定技，每当一名角色进入濒死状态时，你可以获得其所有手牌(若其无手牌则改为你弃置所有手牌)(若该角色为你则跳过此步骤)，然后展示牌堆顶的一张牌：若此牌的颜色为红色，则该角色将体力值恢复至1；若此牌的花色为♥️，则改为该角色将体力值恢复至体力值上限",
            
            "圣_renxin":"仁心",
            "圣_renxin_info":"锁定技，每当一名不处于濒死状态的其他角色恢复体力值后，你将体力值调整至与其相同",
            
            "圣_tushe":"图射",
            "圣_tushe_info":"锁定技，出牌阶段开始时，你可以展示手牌，然后弃置其中数量最多的一种类型的牌(若手牌中最多类型的牌含有两种以上，则改为弃置所有手牌)。若你因此技能而弃置了所有手牌，则你摸等量张牌；若如此做，直至你的下回合开始前，每当你使用牌指定目标后，若你的手牌中未含有此类型的牌，则你摸X张牌(X为此牌所指定的目标角色数)",
            
            "圣_chuangli":"疮疬",
            "圣_chuangli_info":"锁定技，每当你摸牌后，若你的手牌中持有♥️花色的基本牌，则你展示手牌并将其弃置之。若此时你持有“牧”印记，则你移除一枚“牧”印记并从牌堆底摸等量张牌",
            
            "圣_limu":"立牧",
            "圣_limu_info":"锁定技，出牌阶段(限一次)，你可以弃置任意张牌，然后恢复一点体力并获得X枚“牧”印记；若你因此技能而弃置了所有手牌，则你摸X张牌(X为你以此法弃置的卡牌数与你的当前体力值之和)。若如此做，你于“牧”印记消耗殆尽前使用牌均无距离与次数限制。结束阶段，你移除武将牌旁所持有的“牧”印记，并根据其数量依次跳过下回合的摸牌阶段、出牌阶段、弃牌阶段",
            
            "圣_chouce":"筹策",
            "圣_chouce_info":"锁定技，每当你的判定牌亮出后：若此次判定结果牌的颜色为红色，你摸一张牌并可以令一名角色获得此次的判定结果牌。若该角色持有“先辅”印记且其已受伤，你令其额外恢复一点体力，然后你进行一次判定；若此次判定结果牌的颜色为黑色，你获得此次判定结果牌并可以弃置一名其他角色的一张牌。若该角色未持有“先辅”印记且其未受伤，你令其额外失去一点体力，然后你进行一次判定",
            
            "圣_tianji":"天嫉",
            "圣_tianji_info":"锁定技，每当你受到一点伤害或恢复一点体力值后，你进行一次判定；若伤害来源持有“先辅”印记，则其移除此印记，你失去一点体力，然后进行一次判定",
            
            "圣_xianfu":"先辅",
            "圣_xianfu_info":"锁定技，游戏/准备阶段开始时，你可以令一名未持有“先辅”印记的其他角色获得一枚“先辅”印记。每当持有“先辅”印记的角色受到伤害时，你受到等量点伤害；每当持有“先辅”印记的角色恢复体力值时，你恢复等量体力值",
            
            "圣_liangyin":"良姻",
            "圣_liangyin_info":"锁定技，每当你的牌置于任意角色的武将牌旁时，你摸X张牌；每当一名其他角色的牌置于任意角色的武将牌旁时，你可以获得其X张牌；每当一名其他角色获得其武将牌旁的牌时，你可以弃置X张牌并对其造成X点伤害(X为此次置于武将牌旁的牌数)",
            
            "圣_housan":"篌散",
            "圣_housan_info":"锁定技，每当一名其他角色于其回合内造成伤害时，该角色将其所有手牌置于武将牌旁称为“箜”",
            
            "圣_kongsheng":"箜声",
            "圣_kongsheng_info":"锁定技，准备阶段，你可以将所有手牌置于一名角色的武将牌旁称为“箜”。每当一名角色的回合结束时，所有武将牌旁持有“箜”的角色获得其武将牌旁的所有“箜”",
            
            "圣_rende":"仁德",
            "圣_rende_info":"锁定技，出牌阶段，若你的当前手牌数大于你的当前体力值，你可以将至多X张手牌交给一名其他角色，然后恢复一点体力；若你的当前手牌数小于你的当前体力值，你可以获得于本回合内成为过此技能目标的角色的至多X张牌(X为你的已损失体力值。若你未受伤，则改为你的当前体力值)，然后失去一点体力(若该角色的手牌因此而小于你，则改为令其恢复一点体力并于本回合内无法再次通过此技能获得该角色的牌)",
            
            "圣_zongzha":"宗诈",
            "圣_zongzha_info":"锁定技，每当一名其他角色于其回合外获得牌后，你令其获得“宗诈”印记并于其回合结束时移除之；每当一名角色的“宗诈”印记被移除时，该角色需弃置所有手牌，然后将一张随机武器牌置入装备栏并获得一张【杀】",
            
            "圣_shimie":"誓灭",
            "圣_shimie_info":"觉醒技：当一名已成为〖仁德〗技能目标的角色因其他角色而阵亡时，你移除伤害来源的“宗诈”印记并对其造成一点伤害。然后你增加X点体力值上限并将体力值恢复至3(X为你的已损失体力值)，失去技能〖仁德〗〖宗诈〗，永久获得技能〖龙怒〗〖结营〗",
            
            "圣_longnu":"龙怒",
            "圣_longnu_info":"转换技：①阴，出牌阶段开始时，你增加一点体力值上限并失去一点体力，然后摸X张牌(X为你的已损失体力值)并于本回合内的红色手牌均视为【火杀】且你使用【杀】时无距离限制；②阳：出牌阶段开始时，你失去一点体力值上限并恢复一点体力，然后摸Y张牌(Y为你的当前体力值)并于本回合内的黑色手牌均视为【雷杀】且你使用【杀】时无次数限制",
            
            "圣_jieying":"结营",
            "圣_jieying_info":"锁定技，你始终处于横置状态且令场上所有横置角色的手牌上限均翻倍；每当你即将受到属性伤害时，你令一名随机其他角色横置并令当前场上所有处于横置状态的角色依次执行〖龙怒〗中对应此次伤害属性的负面效果",
            
            "圣_fazhuan":"法篆",
            "圣_fazhuan_info":"锁定技，游戏开始时/每当你于回合内弃置或于回合外失去牌后，你获得4枚“法篆”印记/根据失去牌的花色获得对应印记：黑桃牌，你获得1枚【紫微】；梅花牌，你获得1枚【后土】；红桃牌，你获得1枚【玉清】；方片牌，你获得1枚【勾陈】",
            
            "圣_dianhua":"点化",
            "圣_dianhua_info":"锁定技，每当你的准备阶段或结束阶段开始时，你跳过本回合的摸牌阶段并进行一次判定，然后将判定牌置于牌堆顶并获得一张与判定牌相同花色的牌",
            
            "圣_yifu":"仪符",
            "圣_yifu_info":"锁定技，出牌阶段(限一次)，你可以进行一次判定，然后移除一枚与判定结果牌相同花色的“法篆”印记(若无此花色印记则无法触发后续效果)。若如此做，你需令一名其他角色获得对应的“法篆符咒”。每当场上任意一名角色持有“法篆符咒”时，你视为拥有该角色持有的“法篆符咒”所对应的额外增益效果",
            "圣_yifu_diamondbuff":"勾陈符咒",
            "圣_yifu_diamondbuff_info":"符咒效果：你令一名其他角色随机使用一张装备牌；</br>额外增益效果：每当你受到伤害后，你可以移除1枚【勾陈】，然后从牌堆中依次随机获得基本/锦囊/装备/延时四种不同类型的牌各一张",
            "圣_yifu_spadebuff":"紫微符咒",
            "圣_yifu_spadebuff_info":"符咒效果：你令一名其他角色受到一点无伤害来源的火属性伤害；</br>额外增益效果：每当一张判定牌即将生效时，你可以移除1枚【紫微】，然后将判定结果改为任意花色",
            "圣_yifu_clubbuff":"后土符咒",
            "圣_yifu_clubbuff_info":"符咒效果：你令一名其他角色失去一点体力并于此符咒失效时恢复一点体力；</br>额外增益效果：每当一名角色进入濒死状态时，你可以移除1枚【后土】，然后令其恢复一点体力",
            "圣_yifu_heartbuff":"玉清符咒",
            "圣_yifu_heartbuff_info":"符咒效果：你令一名其他角色跳过下回合的摸牌阶段；</br>额外增益效果：每当你即将造成伤害时，你可以移除1枚【玉清】并进行一次判定：若判定结果为黑色，则此次造成的伤害+1。若判定结果为红色，则你恢复一点体力",
            
            "圣_ciwei":"慈威",
            "圣_ciwei_info":"锁定技，每当一名其他角色于其回合内使用常规锦囊牌时，若其已于本回合内使用过牌，则你令其取消此牌的所有目标",
            
            "圣_caiyuan":"才媛",
            "圣_caiyuan_info":"锁定技，每当你受到伤害或失去体力值时，若你未持有“才媛”印记，你获得之；结束阶段，若你未持有“才媛”印记，你可以令一名角色将手牌数补至/弃置至其体力值上限；否则，你移除“才媛”印记，然后恢复一点体力",
            
            "圣_hongyi":"弘仪",
            "圣_hongyi_info":"锁定技，出牌阶段(限一次)，你可以弃置X张牌并选择至多等量名其他角色(X为已阵亡角色数且至少为1)。若如此做，每当一名成为此技能目标的角色于你的下回合开始前即将造成伤害时，你令其进行一次判定：若判定结果为黑色，则防止此伤害；若判定结果为红色，则受伤角色获得该角色一张牌。该技能结算后，若你持有“才媛”印记，则你移除此印记并增加一点体力值上限",
            
            "圣_qiaoshi":"樵拾",
            "圣_qiaoshi_info":"锁定技，每当一名其他角色的回合结束时，若该角色的手牌数大于你，你将手牌数补至与其相同；若其手牌数等于你，你摸一张牌并令该角色弃置一张牌；若其手牌数小于你，你令其获得一张【杀】",
            
            "圣_shoujie":"守节",
            "圣_shoujie_info":"锁定技，每当你成为一名其他角色使用牌的目标时，你获得该角色的所有牌。当你于本回合内受到该角色所造成的伤害后，你将所有手牌交给该角色",
            
            "圣_yanyu":"燕语",
            "圣_yanyu_info":"锁定技，出牌阶段，若你的手牌中含有至少一张【杀】时，你可以展示手牌并将其全部弃置，然后摸等量张牌。若如此做，结束阶段，你可以令一名角色摸X张牌(X为你以此法获得的牌数)",
            
            
            
        },
				
		 
        
        skill:{
  //--------------------BUFF光环-------------------//
            "圣_buff_mashu":{
                mod:{
                    globalFrom:function (from,to,distance){
            return distance-1;
        },
                },
            },
            "圣_buff_feiying":{
                mod:{
                    globalTo:function (from,to,distance){
                return distance+1;
        },
                },
            },
            
            
   //--------------------普通技能-------------------//
            "圣_fangzhu":{
                audio:"ext:混沌界:2",
                trigger:{
                    player:"damageAfter",
                },
                direct:true,
                forced:true,
                priority:-1,
                filter:function (event,player){
        return event.source&&event.source!=player;
    },
                content:function (){
        'step 0'
        if(!player.isTurnedOver()){
            player.turnOver(true);
            trigger.source.turnOver(true);
            player.chooseTarget('【放逐】：是否令一名其他角色弃置'+get.cnNumber(player.getDamagedHp())+'张牌并翻面？',function(card,player,target){
            return player!=target;
        })
        }else{
            player.turnOver(false);
            trigger.source.loseHp();
            player.chooseTarget('【放逐】：是否令一名其他角色摸'+get.cnNumber(player.hp)+'张牌并翻面？',function(card,player,target){
            return player!=target;
        })
            event.goto(2);
        }
        'step 1'
        if(result.bool){
            player.logSkill('圣_fangzhu');
            player.line(result.targets[0]);
            result.targets[0].chooseToDiscard(player.getDamagedHp(),'he',true);
            result.targets[0].turnOver();
            event.finish();
           }else{
               event.finish();
           }
        'step 2'
        if(result.bool){
            player.logSkill('圣_fangzhu');
            player.line(result.targets[0]);
            result.targets[0].draw(player.hp);
            result.targets[0].turnOver();
          }else{
               event.finish();
           }
    },
            },
            "圣_xingshang":{
                trigger:{
                    global:"dying",
                },
                forced:true,
                filter:function (event,player){
        return event.player!=player&&event.player.countCards('he')>0;
    },
                content:function (){
        'step 0'
        player.recover();
        player.gainPlayerCard(trigger.player,'he',Infinity,true);
        'step 1'
        game.delay();
        trigger.player.judge();
        'step 2'
        trigger.player.gain(result.card,'gain2');
    },
            },
            "圣_songwei":{
                audio:"ext:混沌界:2",
                trigger:{
                    global:"judgeAfter",
                },
                skillAnimation:"epic",
                animationColor:"thunder",
                derivation:["圣_chuyuan","圣_yange","圣_dengji","圣_tianxings"],
                forced:true,
                direct:true,
                priority:100,
                filter:function (event,player){
        return event.player!=player&&get.color(event.result.card)=='black';
    },
                content:function (){
        'step 0'
       player.draw();
       'step 1'
       if(player.countCards('h')>_status.currentPhase.countCards('h')&&_status.currentPhase.countCards('h')>0){
          player.link(false);
          player.turnOver(false);
          player.unMad();
          player.logSkill('圣_songwei');
          player.line(_status.currentPhase);
          player.gainPlayerCard(_status.currentPhase,'h',Infinity,true);
          player.removeSkill('圣_fangzhu');
          player.removeSkill('圣_xingshang');
          player.addSkill('圣_chuyuan');
          player.addSkill('圣_yange');
          player.addSkill('圣_dengji');
          player.insertPhase();
       }else{event.finish();}
       'step 2'
       player.awakenSkill('圣_songwei');
    },
            },
            "圣_chuyuan":{
                audio:"ext:混沌界:2",
                trigger:{
                    global:"damageEnd",
                },
                filter:function (event,player){
        return event.player.isAlive();
    },
                priority:-1,
                marktext:"元",
                intro:{
                    content:"cards",
                },
                init:function (player){
        player.storage.圣_chuyuan=[];
    },
                logTarget:"player",
                locked:true,
                content:function (){
        'step 0'
        if(trigger.player.hasSkill('圣_chuyuan_mark')||trigger.source.isAlive()&&trigger.source.hasSkill('圣_chuyuan_mark')){
        trigger.player.draw();
        if(!trigger.player.hasSkill('圣_chuyuan_mark')){
        trigger.player.addSkill('圣_chuyuan_mark');
        }
        if(trigger.source&&trigger.source.isAlive()&&trigger.source!=player&&trigger.source!=trigger.player){
            trigger.source.loseHp();
        }
        trigger.player.chooseCard('he',true,'请选择将一张牌置于'+get.translation(player)+'的武将牌上作为“元”');
        }else{
        trigger.player.draw();
        if(!trigger.player.hasSkill('圣_chuyuan_mark')){
        trigger.player.addSkill('圣_chuyuan_mark');
        }
        event.finish();
        }
        'step 1'
       if(result.bool){
        trigger.player.lose(result.cards,ui.special,'visible','toStorage');
        trigger.player.$give(result.cards,player,false);
        game.log(trigger.player,'选择了',result.cards);
        player.storage.圣_chuyuan=player.storage.圣_chuyuan.concat(result.cards);
        player.syncStorage('圣_chuyuan');
        player.markSkill('圣_chuyuan');
        game.log(player,'将',result.cards,'置于武将牌上称为','#y“元”');
        }
    },
                subSkill:{
                    mark:{
                        sub:true,
                    },
                },
            },
            "圣_yange":{
                audio:"ext:混沌界:2",
                trigger:{
                    player:"damageEnd",
                },
                priority:1,
                locked:true,
                filter:function (event,player){
        return get.itemtype(event.cards)=='cards'&&
            get.position(event.cards[0],true)=='o'&&
            game.hasPlayer(function(current){
            return current!=player&&get.distance(current,player)<=1;
        });
    },
                content:function (){
        'step 0'
        event.targets=game.filterPlayer();
        event.targets.sort(lib.sort.seat);
        'step 1'
        if(event.targets.length){
            var target=event.targets.shift();
            if(player!=target&&get.distance(target,player)<=1){
                if(target.countCards('he')>0){
                    player.line(target);
                    target.addTempSkill('圣_yange_mark');
                    target.chooseCard('【燕歌】：请交给'+get.translation(player)+'一张牌','he',true);
                }else{event.goto(3);}
            }else{event.goto(3);}
          }
         'step 2'
        if(result.bool&&result.cards&&result.cards.length){
             player.gain(result.cards[0],target,'gain2');
        }
        'step 3'
        if(event.targets.length){
            event.goto(1);
        }
       'step 4'
        player.chooseTarget('【燕歌】：请将'+get.translation(trigger.cards)+'交给一名成为过此技能目标的角色',true,function(card,player,target){
            return target!=player&&target.hasSkill('圣_yange_mark');
        })
        'step 5'
        if(result.bool){
            player.line(result.targets[0]);
            result.targets[0].gain(trigger.cards,'gain2');
        } 
    },
                ai:{
                    maixie:true,
                    "maixie_hp":true,
                    effect:{
                        target:function (card,player,target){
                if(player.hasSkillTag('jueqing',false,target)) return [1,-1];
                if(get.tag(card,'damage')) return [1,0.55];
            },
                    },
                },
                subSkill:{
                    mark:{
                        sub:true,
                    },
                },
            },
            "圣_dengji":{
                audio:"ext:混沌界:2",
                derivation:["圣_tianxings"],
                trigger:{
                    player:"phaseZhunbeiBegin",
                },
                forced:true,
                unique:true,
                priority:100,
                skillAnimation:true,
                animationColor:"water",
                filter:function (event,player){
        return player.getStorage('圣_chuyuan').length>=3;
    },
                content:function (){
        "step 0"
        player.gainMaxHp();
        "step 1"
        player.recover(player.getDamagedHp());
        "step 2"
        player.removeSkill('圣_yange');
        player.addSkill('圣_tianxings');
        player.gain(player.storage.圣_chuyuan,player,'giveAuto','fromStorage');
        player.unmarkAuto('圣_chuyuan',player.storage.圣_chuyuan);
        "step 3"
        player.awakenSkill(event.name);
    },
            },
            "圣_tianxings":{
                audio:"ext:混沌界:2",
                enable:"phaseUse",
                usable:1,
                delay:false,
                locked:true,
                direct:true,
                filter:function (event,player){
    return player.hasSkill('圣_chuyuan')&&player.getStorage('圣_chuyuan').length>0;
},
                content:function (){
        "step 0"
        if(player.getDamagedHp()>1){
        player.chooseCardButton('【储元】：请选择并获得至多'+get.translation(player.getDamagedHp())+'张“元”',[1,player.getDamagedHp()],player.storage.圣_chuyuan,true);
        }else{
        player.chooseCardButton('【储元】：请选择并获得至多一张“元”',player.storage.圣_chuyuan,true);
        }
        "step 1"
        if(result.bool){
            player.gain(result.links,'gain2','fromStorage');
            player.storage.圣_chuyuan.remove(result.links);
            player.markSkill('圣_chuyuan');
            player.syncStorage('圣_chuyuan');
            if(player.getStorage('圣_chuyuan').length<=0){
             player.unmarkSkill('圣_chuyuan');
             }
        }else{event.finish();}
        "step 2"
        if(result.bool){
            player.chooseToDiscard(get.prompt('圣_tianxings'),'请弃置一张牌并根据你弃置牌的花色执行以下相对应效果：</br>♥️：你恢复一点体力并对其他所有角色造成一点伤害，然后你于本回合内的手牌上限改为0</br>♦️：你可以令一名其他角色获得你的所有手牌，然后你将手牌数补至与其相同</br>♠️：你可以令一名其他角色于本回合结束后开始一个额外的回合，然后你于本回合结束时摸X张牌(X为你的已损失体力值且至少为1)</br>♣️：你摸Y张牌并获得一名其他角色的所有牌，然后令其获得你的一张牌(Y为你的当前手牌数)','he',true);
        }
        "step 3"
        if(result.bool){
        player.logSkill('圣_tianxings');
        event.cards=result.cards;
        }
        "step 4"
        if(result.bool){
        if(get.suit(event.cards)=='heart'){
        player.recover();
        player.addTempSkill('圣_tianxings_heart');
        event.targets=game.filterPlayer();
        event.targets.remove(player);
        event.targets.sort(lib.sort.seat); 
        player.line(event.targets);
        }else{event.goto(6);}
      }
      "step 5"
      if(result.bool){
        if(event.targets.length){
            event.targets.shift().damage(player);
            event.redo();
          }else{event.finish();}
      }
        "step 6"
        if(result.bool){
            if(get.suit(event.cards)=='diamond'){
            player.chooseTarget('【天行】：你可以令一名其他角色获得你的所有手牌，然后你将手牌数补至与其相同',function(card,player,target){
            return player!=target
        })
            }
            if(get.suit(event.cards)=='spade'){
            player.chooseTarget('【天行】：你可以令一名其他角色于本回合结束后开始一个额外的回合，然后你于本回合结束时摸X张牌',function(card,player,target){
            return player!=target
        })
            }
            if(get.suit(event.cards)=='club'){
            player.chooseTarget('【天行】：你摸Y张牌并获得一名其他角色的所有牌，然后令其获得你的一张牌(Y为你的当前手牌数)',function(card,player,target){
            return player!=target
        })
            }
        }
        "step 7"
        if(result.bool){
        if(get.suit(event.cards)=='diamond'){
            event.target=result.targets[0];
            player.line(event.target);
            event.target.gainPlayerCard(player,'h',Infinity,true);
        }
        if(get.suit(event.cards)=='spade'){
            player.line(result.targets[0]);
            result.targets[0].insertPhase();
            result.targets[0].addTempSkill('圣_tianxings_spademark');
            player.addSkill('圣_tianxings_spade');
        }
        if(get.suit(event.cards)=='club'){
            player.draw(player.countCards('h'));
            if(result.targets[0].countCards('he')>0){
            player.line(result.targets[0]);
            player.gainPlayerCard(result.targets[0],'he',Infinity,true);
            }else{
            player.draw(result.targets[0].hp);
            }
            result.targets[0].gainPlayerCard(player,'h',true);
        }
        }
       "step 8"
       if(get.suit(event.cards)=='diamond'){
            player.draw(event.target.countCards('h')-player.countCards('h'));
        }
    },
                subSkill:{
                    heart:{
                        mod:{
                            maxHandcard:function (player,num){
            return num=0;
        },
                        },
                        sub:true,
                    },
                    spademark:{
                        mark:true,
                        marktext:"赐",
                        intro:{
                            content:"该角色于本回合结束后开始一个额外的回合",
                        },
                        sub:true,
                    },
                    spade:{
                        trigger:{
                            player:"phaseEnd",
                        },
                        forced:true,
                        content:function (){
                player.draw(player.getDamagedHp());
                player.removeSkill('圣_tianxings_spade');
            },
                        sub:true,
                    },
                },
            },
            "圣_huituo":{
                audio:"ext:混沌界:2",
                trigger:{
                    player:"damageEnd",
                },
                direct:true,
                forced:true,
                content:function (){
        "step 0"
        player.chooseTarget(get.prompt2('圣_huituo')).set('ai',function(target){
            var player=_status.event.player;
            if(get.attitude(player,target)>0){
                return get.recoverEffect(target,player,player)+1;
            }
            return 0;
        });
        "step 1"
        if(result.bool){
            player.logSkill('圣_huituo',result.targets);
            var target=result.targets[0];
            event.target=target;
            target.judge(function(card){
                if(target.hp==target.maxHp){
                    if(get.color(card)=='red') return -1;
                }
                if(get.color(card)=='red') return 1;
                return 0;
            });
        }
        else{
            event.finish();
        }
        "step 2"
        if(result.color){
            if(result.color=='red'){
                if(event.target.isDamaged()){
                    if(!event.target.countCards('h')){
                        event.target.recover(trigger.num*2);
                    }else{
                        event.target.recover(trigger.num);
                    }
                }
            }
            else{
               if(event.target.isDamaged()){
                   event.target.draw(trigger.num*2);
               }else{
                   event.target.draw(trigger.num);
               }
            }
        }
    },
                ai:{
                    maixie:true,
                    "maixie_hp":true,
                },
            },
            "圣_mingjian":{
            audio:"ext:混沌界:2",
                enable:"phaseUse",
                usable:1,
                filterTarget:function (card,player,target){
        return player!=target;
    },
                locked:true,
                filter:function (event,player){
        return player.countCards('h')>0;
    },
                filterCard:true,
                selectCard:-1,
                discard:false,
                lose:true,
                content:function (){
        "step 0"
        player.$give(cards.length,target);
        target.gain(cards,player);
        "step 1"
        if(!target.hasSkill('圣_mingjian_mark')){
            target.addSkill('圣_mingjian_mark');
        };
        if(!target.hasSkill('圣_mingjian_from')){
            target.addSkill('圣_mingjian_from');
        };
        target.storage.圣_mingjian_mark++;
        target.updateMarks('圣_mingjian_mark');
        "step 2"
        target.storage.圣_mingjian_from=player;
        "step 3"
        if(player.getEnemies().contains(target)){
            target.addTempSkill('圣_mingjian_damage',{player:'phaseEnd'});
        }
        else{
            target.addTempSkill('圣_mingjian_recover',{player:'phaseEnd'});
        }
    },
                ai:{
                    order:1,
                    result:{
                        target:function (player,target){
                if(target.hasSkillTag('nogain')) return 0;
                if(player.countCards('h')==1&&player.countCards('h','du')) return -1;
                if(player.hp<=2&&player.countCards('h','shan')) return 0;
                if(target.countCards('h')+player.countCards('h')>target.hp+2) return 0;
                if(get.attitude(player,target)>3) return 1;
                return 0;
            },
                    },
                },
                group:"圣_mingjian_target",
                subSkill:{
                    from:{
                        onremove:true,
                        mod:{
                            globalFrom:function (from,to,distance){
                    if(from.storage.圣_mingjian_from==to) return -Infinity;
                },
                        },
                        sub:true,
                    },
                    damage:{},
                    recover:{},
                    target:{
                    trigger:{
                    global:"phaseBegin",
                    },
                    forced:true,
                    direct:true,
                    priority:100,
                    content:function (){
                    if(trigger.player.hasSkill('圣_mingjian_damage')){
                    trigger.player.removeSkill('圣_mingjian_damage');
                    trigger.player.line(player,'fire');
                    player.damage(trigger.player);
                    }
                    if(trigger.player.hasSkill('圣_mingjian_recover')){
                    trigger.player.removeSkill('圣_mingjian_recover');
                    if(player.isDamaged()){
                    trigger.player.line(player,'thunder');
                    player.recover(trigger.player);
                    }
                    }
                    },
                    },
                    mark:{
                        charlotte:true,
                        mark:true,
                        marktext:"忠",
                        intro:{
                            content:"该角色的手牌上限+#且可以额外使用#张【杀】",
                        },
                        init:function (player,skill){
                if(!player.storage[skill]) player.storage[skill]=0;
            },
                        onremove:function (player,skill){
            player.storage[skill]=0;
            },
                        mod:{
                            maxHandcard:function (player,num){
                    return num+player.storage.圣_mingjian_mark;
                },
                            cardUsable:function (card,player,num){
                    if(card.name=='sha') return num+player.storage.圣_mingjian_mark;
                },
                        },
                        sub:true,
                    },
                },
            },
            "圣_xingshuai":{
                trigger:{
                    player:"dying",
                },
                forced:true,
                direct:true,
                priority:100,
                content:function (){
        var list=game.filterPlayer();
        for(var i=0;i<list.length;i++){
            if(list[i]!=player&&list[i].hasSkill('圣_mingjian_from')&&list[i].hasSkill('圣_mingjian_mark')){
                player.logSkill('圣_xingshuai');
                list[i].removeSkill('圣_mingjian_mark');
                list[i].removeSkill('圣_mingjian_from');
                player.line(list[i],'thunder');
                list[i].damage(player);
                player.recover();
            }
        }
    },
            },
           "圣_huangkong":{
           audio:"ext:混沌界:2",
                trigger:{
                    global:"phaseBegin",
                },
                forced:true,
                direct:true,
                priority:99,
                filter:function (event,player){
        return player.countCards('h')>0&&event.player!=player&&
            event.player.countCards('h')>0&&game.countPlayer()>=3;
    },
                content:function (){
        "step 0"
        player.chooseCardTarget({
            position:'he',
            filterCard:true,
            selectCard:true,
            filterTarget:function (card,player,target){
                return target!=player&&target!=trigger.player&&!target.hasSkill('圣_youjin_mark');
            },
            prompt:get.prompt('圣_huangkong'),
            prompt2:"请将一张牌交给一名其他角色，然后令该角色与"+get.translation(trigger.player)+"进行拼点",
        }).set('ai',function(target){
            if(get.attitude(player,target)>0){
            var cards=player.getCards('h');
            if(cards.length>3) return true;
            for(var i=0;i<cards.length;i++){
                var useful=get.useful(cards[i]);
                if(useful<5) return true;
                if(cards[i].number>9&&useful<7) return true;
            }
            };
            });
        "step 1"
        if(result.bool){
            player.logSkill('圣_huangkong',result.targets[0]);
            event.target=result.targets[0];
            player.line(event.target);
            event.target.gain(result.cards[0],player,'giveAuto');
        }else{
            event.finish();
        }
        "step 2"
        if(result.bool){
            game.delay();
            event.target.line(trigger.player);
            event.target.chooseToCompare(trigger.player);
        }
        "step 3"
        if(result.bool){
            player.draw();
            event.target.draw();
            trigger.player.skip('phaseDraw');
            trigger.player.skip('phaseUse');
            trigger.player.addTempSkill('圣_huangkong_card');
        }else{
            trigger.player.storage.圣_huangkong_buff=player;
            trigger.player.addTempSkill('圣_huangkong_buff');
            trigger.player.useCard({name:'sha'},player);
           if(event.target.countCards('h')>2){
           event.target.chooseToDiscard(2,'h',true).set('ai',function(card){
            return 6-get.useful(card);
        });
           }else{
               event.target.chooseToDiscard(Infinity,'h',true);
           }
        }
    },
                ai:{
                    expose:1,
                },
                subSkill:{
                    card:{
                        init:function (player){
        player.storage.圣_huangkong_card=0;
    },
                        mod:{
                            maxHandcard:function (player,num){
            return num=player.storage.圣_huangkong_card;
        },
                        },
                        trigger:{
                            player:"phaseDiscardBegin",
                        },
                        forced:true,
                        direct:true,
                        unique:true,
                        charlotte:true,
                        content:function (){
       if(player.maxHp-player.hp>player.hp){
        player.storage.圣_huangkong_card=player.hp;
        player.markSkill('圣_huangkong_card');
        player.syncStorage('圣_huangkong_card');
        game.log(player,'跳过了“摸牌阶段”与“出牌阶段”');
        }else{
        player.storage.圣_huangkong_card=player.maxHp-player.hp;
        player.markSkill('圣_huangkong_card');
        player.syncStorage('圣_huangkong_card');
        if(player.storage.圣_huangkong_card>0){
        game.log(player,'跳过了“摸牌阶段”与“出牌阶段”且于本回合内的手牌上限改为已损失体力值');
        }else{
        game.log(player,'跳过了“摸牌阶段”与“出牌阶段”且于本回合内的手牌上限改为0');
        }
                }
    },
                        sub:true,
                    },
                    buff:{
                        mark:"惶",
                        onremove:true,
                        unique:true,
                        charlotte:true,
                        intro:{
                            content:"本回合内与$的距离视为1",
                        },
                        mod:{
                            globalFrom:function (from,to){
                    if(to==from.storage.圣_huangkong_buff){
                        return -Infinity;
                    }
                },
                        },
                        sub:true,
                    },
                },
            },
            "圣_youjin":{
                trigger:{
                    player:"damageBegin",
                },
                forced:true,
                filter:function (event,player){
        return event.source&&event.source!=player;
    },
                content:function (){
        if(get.distance(trigger.source,player)<=1){
            trigger.num*=2;
        }else{
            trigger.num--;
        }
    },
            },
            "圣_qiuyuan":{
                audio:"ext:混沌界:2",
                trigger:{
                    target:"useCardToTarget",
                },
                forced:true,
                direct:true,
                filter:function (event,player){
        return event.card.name=='sha'&&game.countPlayer()>=3;
    },
                content:function (){
        "step 0"
        player.chooseTarget(get.prompt2('圣_qiuyuan'),function(card,player,target){
            return target!=player&&!_status.event.targets.contains(target)&&_status.event.playerx.canUse('sha',target,false);
        }).set('ai',function(target){
            var trigger=_status.event.getTrigger();
            var player=_status.event.player;
            return get.effect(target,trigger.card,trigger.player,player)+0.1;
        }).set('targets',trigger.targets).set('playerx',trigger.player);
        "step 1"
        if(result.bool){
            var target=result.targets[0];
            player.logSkill('圣_qiuyuan',target);
            event.target=target;
            target.chooseCard({name:'shan'},'交给'+get.translation(player)+
            '一张【闪】并摸一张牌，或成为此【杀】的额外目标').set('ai',function(card){
                return get.attitude(target,_status.event.sourcex)>=0?1:-1;
            }).set('sourcex',player);
            game.delay();
        }
        else{
            event.finish();
        }
       "step 2"
        if(result.bool){
            player.gain(result.cards,event.target,'giveAuto');
            event.target.draw();
            if(trigger.player.hasSkill('圣_huangkong_buff')){
                event.target.showHandcards();
                if(event.target.countCards('h',{name:"sha"})>0){
                   event.target.line(trigger.player);
                    trigger.player.damage(event.target);
                }
            }
            game.delay();
        }
        else{
            trigger.getParent().targets.push(event.target);
            game.log(event.target,'成为了',trigger.player,'使用的【杀】的额外目标');
            if(trigger.player.hasSkill('圣_huangkong_buff')){
                event.target.showHandcards();
                if(event.target.countCards('h',{name:"sha"})>0){
                var hs=event.target.getCards('h','sha');
                    event.target.discard(hs,Infinity,true);
                }
            }
        } 
    },
                ai:{
                    expose:0.2,
                    effect:{
                        target:function (card,player,target){
                if(card.name!='sha') return;
                var players=game.filterPlayer();
                for(var i=0;i<players.length;i++){
                    var target2=players[i];
                    if(player!=target2&&target!=target2&&player.canUse(card,target2,false)&&
                        get.effect(target2,{name:'shacopy',nature:card.nature,suit:card.suit},player,target)<0){
                        if(target.hp==target.maxHp) return [0,1];
                        return [0,0];
                    }
                }
            },
                    },
                },
            },
            "圣_mizhao":{
                enable:"phaseUse",
                usable:1,
                audio:"ext:混沌界:2",
                forced:true,
                prepare:"give2",
                filterTarget:function (card,player,target){
        if(player==target) return false;
        return true;
    },
                filter:function (event,player){
        return player.countCards('he')>0;
    },
                filterCard:true,
                check:function (card){
        if(card.name=='du') return 20;
        return 7-get.value(card);
    },
                discard:false,
                content:function (){
        target.gain(cards,player).delay=false;
        player.recover();
        player.draw(2);
    },
                ai:{
                    result:{
                        target:function (player,target){
                if(ui.selected.cards.length&&ui.selected.cards[0].name=='du'){
                    return -1;
                }
                return 1;
            },
                    },
                    order:2,
                },
            },
            "圣_qianxin":{
                audio:"ext:混沌界:2",
                trigger:{
                    player:"phaseEnd",
                },
                forced:true,
                filter:function (event,player){
        return player.isMaxHandcard()&&player.hp>1;
    },
                content:function (){
        player.loseHp();
    },
                group:"圣_qianxin_card",
                subSkill:{
                    card:{
                        trigger:{
                            player:["phaseBefore","phaseBegin","phaseUse"],
                        },
                        direct:true,
                        forced:true,
                        content:function (){
                        player.skip('phaseDiscard');
    },
                        sub:true,
                    },
                },
            },
            "圣_mohua":{
                trigger:{
                    global:["damageEnd","loseHpEnd","recoverEnd","loseMaxHp"],
                },
                direct:true,
                forced:true,
                priority:-1,
                filter:function (event,player){
        return _status.currentPhase!=player&&
        event.player!=player&&event.num>0&&
        player.countCards('h')<=player.hp*3;
    },
                content:function (){
        player.draw();
    },
            },
            "圣_fanyin":{
                skillAnimation:"epic",
                animationColor:"thunder",
                derivation:["圣_shelie","圣_gongxin"],
                audio:"ext:混沌界:2",
                trigger:{
                    player:"phaseBegin",
                },
                unique:true,
                forced:true,
                priority:100,
                filter:function (event,player){
        return player.countCards('h')>=player.hp*3;
    },
                content:function (){
        "step 0"
        player.recover();
        "step 1"
        player.removeSkill('圣_qianxin');
        player.removeSkill('圣_mohua');
        player.addSkill('圣_shelie');
        player.addSkill('圣_qianxin');
        player.addSkill('圣_gongxin');
        player.awakenSkill('圣_fanyin');
    },
            },
            "圣_shelie":{
                audio:"ext:混沌界:2",
                trigger:{
                    player:"phaseDrawBegin",
                },
                locked:true,
                priority:-1,
                content:function (){
        "step 0"
        trigger.changeToZero();
        player.loseHp();
        "step 1"
        var cards=[];
    for(var i=0;i<ui.cardPile.childNodes.length;i++){
    if(get.suit(ui.cardPile.childNodes[i])=='heart'){
    cards=cards.concat(ui.cardPile.childNodes[i]);
}
}
if(cards.length){
    var card=cards.randomGet();
    player.gain(card,'gain2');
}
        "step 2"
        var cards=[];
    for(var i=0;i<ui.cardPile.childNodes.length;i++){
    if(get.suit(ui.cardPile.childNodes[i])=='diamond'){
    cards=cards.concat(ui.cardPile.childNodes[i]);
}
}
if(cards.length){
    var card=cards.randomGet();
    player.gain(card,'gain2');
}
        "step 3"
        var cards=[];
    for(var i=0;i<ui.cardPile.childNodes.length;i++){
    if(get.suit(ui.cardPile.childNodes[i])=='club'){
    cards=cards.concat(ui.cardPile.childNodes[i]);
}
}
if(cards.length){
    var card=cards.randomGet();
    player.gain(card,'gain2');
}
        "step 4"
        var cards=[];
    for(var i=0;i<ui.cardPile.childNodes.length;i++){
    if(get.suit(ui.cardPile.childNodes[i])=='spade'){
    cards=cards.concat(ui.cardPile.childNodes[i]);
}
}
if(cards.length){
    var card=cards.randomGet();
    player.gain(card,'gain2');
}
    },
                ai:{
                    threaten:1.3,
                },
            },
            "圣_gongxin":{
                audio:"ext:混沌界:2",
                enable:"phaseUse",
                locked:true,
                usable:1,
                filter:function (event,player){
        return player.countCards('h',{suit:'heart'})>0
    },
                filterTarget:function (card,player,target){
        return player!=target&&target.countCards('h')>0;
    },
                filterCard:function (card){
        return get.suit(card)=='heart';
    },
                position:"he",
                content:function (){
        "step 0"
        player.chooseCardButton(target,target.getCards('h')).set('filterButton',function(button){
            return get.suit(button.link)=='heart';
        });
        "step 1"
        if(result.bool){
            player.gain(result.links[0]);
            }
            "step 2"
            if(result.bool){
            game.delay(1);
        }
        "step 3"
        if(result.bool){
            target.chooseToDiscard('h',true,Infinity);
        }
    },
                ai:{
                    order:11,
                    result:{
                        target:function (player,target){
                return -target.countCards('h');
            },
                    },
                    threaten:1.1,
                },
            },
            "圣_yaze":{
                trigger:{
                    player:"recoverAfter",
                },
                priority:-1,
                direct:true,
                forced:true,
                content:function (){
        player.chooseToDiscard('j',Infinity,true);
        player.link(false);
        player.turnOver(false);
        player.unMad();
        player.enableEquip(1);
        player.enableEquip(2);
        player.enableEquip(3);
        player.enableEquip(4);
        player.enableEquip(5);
    },
            },
            "圣_huimin":{
                audio:"ext:混沌界:2",
                trigger:{
                    player:"phaseEnd",
                },
                locked:true,
                priority:100,
                filter:function (event,player){
					return game.countPlayer(function(current){
						if(current.countCards('h')<current.hp){
							return get.sgn(get.attitude(player,current));
						}
						})>0;
				},
                check:function (event,player){
					return game.countPlayer(function(current){
						if(current.countCards('h')<current.hp){
							return get.sgn(get.attitude(player,current));
						}
					})>0;
				},
                prompt2:function (event,player){
        var num=game.filterPlayer(function(current){
						return current.countCards('h')<current.hp;
					});
        return '是否发动【惠民】？','锁定技，结束阶段，你可以观看牌堆顶的“'+get.translation(num.length)+'”张牌，并可以将这些牌按任意顺序分配给任意手牌数不大于当前体力值的角色(若为你则跳过此条件)；分配完毕后，若你的手牌数量不大于你的当前体力值，你恢复一点体力';
    },
                content:function (){
        "step 0"
        var num=game.countPlayer(function(current){
            return current.countCards('h')<current.hp;
        });
        event.cards=get.cards(num);
        "step 1"
        if(event.cards.length>1){
            player.chooseCardButton('惠民：将以下所有牌分配给任意手牌数不大于当前体力值角色',true,event.cards,[1,event.cards.length]).set('ai',function(button){
                if(ui.selected.buttons.length==0) return 1;
                return 0;
            });
        }
        else if(event.cards.length==1){
            event._result={links:event.cards.slice(0),bool:true};
        }
        else{
      if(player.countCards('h')<=player.hp){
        player.recover();
      }
            event.finish();
        }
        "step 2"
        if(result.bool){
            for(var i=0;i<result.links.length;i++){
                event.cards.remove(result.links[i]);
            }
            event.togive=result.links.slice(0);
            player.chooseTarget('将'+get.translation(result.links)+'分配给任意一名手牌数不大于当前体力值角色(若为你则跳过此条件)',true,function(card,player,target){
            return target.countCards('h')<target.hp||target==player;
        }).set('ai',function(target){
                var att=get.attitude(_status.event.player,target);
                if(_status.event.enemy){
                    return -att;
                }
                else if(att>0){
                    return att/(1+target.countCards('h'));
                }
                else{
                    return att/100;
                }
            }).set('enemy',get.value(event.togive[0])<0);
        }
        "step 3"
        if(result.targets.length){
            result.targets[0].gain(event.togive,'draw');
            player.line(result.targets[0],'green');
            game.log(result.targets[0],'获得了',player,'分配的'+get.cnNumber(event.togive.length)+'张牌');
            event.goto(1);
        }
    },
            },
            "圣_shouxi":{
                audio:"ext:混沌界:2",
                trigger:{
                    target:"useCardToBefore",
                },
                locked:true,
                priority:100,
                check:function(event,player){
					if(event.getParent().excluded.contains(player)) return false;
					if(get.attitude(player,event.player)>0){
						return false;
					}
					if(get.tag(event.card,'respondSha')){
						if(player.countCards('h',{name:'sha'})==0){
							return true;
						}
					}
					else if(get.tag(event.card,'respondShan')){
						if(player.countCards('h',{name:'shan'})==0){
							return true;
						}
					}
					else if(get.tag(event.card,'damage')){
						return true;
					}
					else if(event.card.name=='shunshou'){
						return true;
					}
					return false;
				},
                filter:function (event,player){
        return event.player!=player&&
        player.storage.圣_shouxi_mark>0;
    },
                init:function (player){
					if(!player.storage.圣_shouxi) player.storage.圣_shouxi=[];
					player.storage.圣_shouxi_mark=20;
				},
                content:function (){
        "step 0"
        var list=['sha','shan','tao','jiu','taoyuan','wugu','juedou','huogong','jiedao','tiesuo','guohe','shunshou','wuzhong','wanjian','nanman','lebu','bingliang','shandian','xietianzi','caomu'];
        for(var i=0;i<player.storage.圣_shouxi.length;i++){
            list.remove(player.storage.圣_shouxi[i]);
        }
        for(var i=0;i<list.length;i++){
            list[i]=[get.type(list[i]),'',list[i]];
        }
        player.chooseButton([get.prompt('圣_shouxi',trigger.player),[list,'vcard']]).set('ai',function(button){
            return Math.random();
        });
        "step 1"
        if(result.bool){
            var name=result.links[0][2];
            var card=game.createCard(name,get.type(name),'');
            event.cardname=name;
            player.storage.圣_shouxi.add(name);
            player.storage.圣_shouxi_mark--;
            player.markSkill('圣_shouxi_mark');
            player.syncStorage('圣_shouxi_mark');
            player.showCards(get.translation(player)+'声明了'+get.translation(name),card);
        }
        else{
            event.finish();
        }
        "step 2"
        var name=event.cardname;
        trigger.player.chooseToDiscard('守玺：弃置一张'+get.translation(name)+'，否则此牌对'+get.translation(player)+'无效',function(card){
            return card.name==_status.event.cardname;
        }).set('ai',function(card){
            if(_status.event.att<0){
                return 10-get.value(card);
            }
            return 0;
        }).set('att',get.attitude(trigger.player,player)).set('cardname',name);
        
        "step 3"
        if(result.bool==false){
            player.draw();
            player.gainPlayerCard(trigger.player,'he',true);
            trigger.cancel();
        }
        else{
            trigger.player.gainPlayerCard(player,'h',true);
        }
    },
                ai:{
                    effect:{
                        target:function (card,player,target,current){
                if(get.attitude(player,target)<0){
                    return 0.3;
                }
            },
                    },
                },
            },
            "圣_kuangwang":{
                audio:"ext:混沌界:2",
                enable:"phaseUse",
                usable:1,
                locked:true,
                filter:function (event,player){
        return player.countCards('h')>0;
    },
                filterTarget:function(card,player,target){
                return player.canCompare(target);
                },
                content:function (){
        "step 0"
        player.chooseToCompare(target);
        "step 1"
        if(result.bool){
            player.gain(game.createCard('sha'),'gain2');
            player.addTempSkill("圣_kuangwang_use");
        }
        else{
            player.loseHp();
            event.finish();
        }
    },
                ai:{
                    order:10,
                    expose:1,
                    result:{
                        target:function (player,target){
                        if(player.num('h')>=target.num('h')||target.num('h')==1) return -1;
                        return 1;
                        },
                    },
                },
                subSkill:{
                use:{
                mark:true,
                marktext:"狂",
                unique:true,
                charlotte:true,
                intro:{
                content:"已进入“狂妄”状态",
                        },
						mod:{
							cardUsable:function (card){
								if(get.info(card)&&get.info(card).forceUsable) return;
								return Infinity;
							},
							targetInRange:function (){
								return true;
							}
						},
						trigger:{
						player:"useCard",
						},
                audio:"ext:混沌界:2",
                forced:true,
                content:function (){
        player.draw();
    },
						},
                },
            },
            "圣_jieao":{
            trigger:{
            source:"dieAfter",
            },
            forced:true,
            priority:100,
            filter:function (event,player){
            return event.player!=player&&player.hasSkill("圣_kuangwang_use");
            },
            content:function (){
            player.gain(game.createCard('sha'),'gain2');
            player.loseHp();
            },
            },
            "圣_shejian":{
            audio:"ext:混沌界:2",
                trigger:{
                player:"phaseDiscardEnd",
                },
                forced:true,
                direct:true,
				filter:function (event,player){
					if(event.cards){
						var suits=[];
						for(var i=0;i<event.cards.length;i++){
							var suit=get.suit(event.cards[i]);
							if(suits.contains(suit)){
								return false;
							}
							else{
								suits.push(suit);
							}
						}
						return true;
					}
					return false;
				},
                content:function (){
        "step 0"
        player.chooseTarget(get.prompt('圣_shejian'),function(card,player,target){
            return target.countCards('he')&&target.isEnemyOf(player);
        }).ai=function(target){
            var att=get.attitude(player,target);
            if(target.isTurnedOver()){
                if(att>0){
                    return att+5;
                }
                return -1;
            }
            if(player.isTurnedOver()){
                return 5-att;
            }
            return -att;
        };
        "step 1"
        if(result.bool){
            player.logSkill('圣_shejian',result.targets);
            player.gainPlayerCard(result.targets[0],'hej',true);
            if(result.targets[0].countCards('h')<=player.countCards('h')){
            result.targets[0].draw();
            player.draw();
            }
        }
    },
                ai:{
                    threaten:1.7,
                },
            },
            "圣_zhanjue":{
                audio:"ext:混沌界:2",
                enable:"phaseUse",
                filterCard:true,
                locked:true,
                group:["圣_zhanjue1"],
                position:"h",
                selectCard:-1,
                precontent:function (){
        player.loseHp();
    },
                prompt:"请选择一名角色，视为对其发起决斗",
                filter:function (event,player){
        if(!player.countCards('h')) return false;
        return true;
    },
                viewAs:{
                    name:"juedou",
                    cards:[{"node":{"image":{},"info":{},"name":{},"name2":{},"background":{},"intro":{},"range":{}},"storage":{},"vanishtag":[],"_uncheck":[],"suit":"heart","number":13,"name":"shan","cardid":"2106629467","_transform":"translateX(0px)","clone":{"name":"shan","suit":"heart","number":13,"node":{"name":{},"info":{},"intro":{},"background":{},"image":{}},"_transitionEnded":true,"timeout":3742},"timeout":3673,"original":"h"},{"node":{"image":{},"info":{},"name":{},"name2":{},"background":{},"intro":{},"range":{}},"storage":{},"vanishtag":[],"_uncheck":[],"suit":"diamond","number":12,"name":"shan","cardid":"1599696468","_transform":"translateX(112px)","clone":{"name":"shan","suit":"diamond","number":12,"node":{"name":{},"info":{},"intro":{},"background":{},"image":{}},"_transitionEnded":true,"timeout":3743},"timeout":3674,"original":"h"}],
                    suit:"club",
                    number:3,
                },
                ai:{
                    order:3,
                    result:{
                    target:function (player,target){
                    if(player.hp>1) return -1;
                    if(player.hp>1&&player.counCards('h')<3) return -10;
                    },
                    },
                },
            },
            "圣_zhanjue1":{
                trigger:{
                    player:["useCard"],
                },
                unique:true,
                forced:true,
                filter:function (event){
        return event.card&&event.card.name=='juedou';
    },
                content:function (){
        player.draw(player.maxHp-player.hp);
    },
            },
            "圣_qinjin":{
                audio:"ext:混沌界:2",
                trigger:{
                    player:["useCardEnd","respondEnd"],
                },
                forced:true,
                filter:function (event){
        return event.card&&event.card.name=='sha'||event.card.name=='shan';
    },
                content:function (){
        player.recover();
    },
            },
            "圣_ziwen":{
                audio:"ext:混沌界:2",
                enable:"phaseUse",
                derivation:"圣_luzhan",
                skillAnimation:"epic",
                animationColor:"fire",
                filter:function (event,player){
        return player.hp==1;
    },
                locked:true,
                unique:true,
                charlotte:true,
                content:function (){
        "step 0" 
        var cards=[];
        for(var i=0;i<player.maxHp-player.hp;i++){
            cards.push(game.createCard('sha'));
        }
        player.gain(cards,'gain2');
        "step 1"
        player.recover(player.maxHp-player.hp);
        "step 2"
        player.removeSkill('圣_zhanjue');
        player.removeSkill('圣_qinjin');
        player.addSkill('圣_luzhan');
        player.addSkill('圣_qinjin');
        player.addTempSkill('圣_ziwen1');
        player.awakenSkill('圣_ziwen');
    },
                ai:{
                    order:10,
                    result:{
                    player:function (player){
                    if(player.hp==1) return 1;
                    }
                    },
                },
            },
            "圣_luzhan":{
                audio:"ext:混沌界:2",
                enable:"phaseUse",
                locked:true,
                filterTarget:function (event,player,target){
        return player!=target;
    },
                content:function (){
                "step 0"
                player.loseHp();
                "step 1"
                target.gain(game.createCard('sha'),'gain2');
                "step 2"
                player.gainPlayerCard('he',target,true);
                "step 3"
                player.line(target,'fire');
                player.useCard({name:'juedou'},target,'noai','nowuxie').animate=false;
                }, 
                ai:{
                    order:5,
                    result:{
                    target:function (target,player){
                    return  -1;
                    }
                    },
                },
            },
            "圣_ziwen1":{
                trigger:{
                    player:"phaseEnd",
                },
                unique:true,
                charlotte:true,
                forced:true,
                priority:100,
                content:function (){
        "step 0"
        player.loseHp(player.hp)._triggered=null;
        "step 1"
        player.draw(player.maxHp-player.hp);
        player.awakenSkill('圣_ziwen1');
    },
            },
            "圣_lige":{
                
    audio:"ext:混沌界:2",
    trigger:{
        global:"damageEnd",
    },
    filter:function (event,player){
        return (event.card&&event.source&&event.source!=player&&
            event.player.classList.contains('dead')==false&&player.countCards('he'));
    },
    direct:true,
    forced:true,
    priority:-1,
    checkx:function (event,player){
        var att1=get.attitude(player,event.player);
        var att2=get.attitude(player,event.source);
        return att1>0&&att2<=0;
    },
    content:function (){
        "step 0"
        var next=player.chooseToDiscard('he',get.prompt2('圣_lige',trigger.player));
        var check=lib.skill.beige.checkx(trigger,player);
        next.set('ai',function(card){
            if(_status.event.goon) return 8-get.value(card);
            return 0;
        });
        next.set('logSkill','圣_lige');
        next.set('goon',check);
        "step 1"
        if(result.bool){
            trigger.player.judge();
        }
        else{
            event.finish();
        }
        "step 2"
        switch(result.suit){
            case 'heart':trigger.player.recover(trigger.num);break;
            case 'diamond':trigger.player.draw(1+trigger.num);break;
            case 'club':trigger.source.chooseToDiscard('he',1+trigger.num,true);break;
            case 'spade':trigger.source.turnOver()&&trigger.source.loseHp(trigger.num);break;
                 }
    },
    ai:{
        expose:0.3,
    },
            },
            "圣_bingxin":{
                trigger:{
                    player:"phaseDiscardBegin",
                },
                forced:true,
                direct:true,
                filter:function (event,player){
        return player.getHistory('useCard',function(evt){
            return evt.isPhaseUsing()&&['basic','trick','delay'].contains(get.type(evt.card));
        }).length>0&&player.countCards('h')>0;
    },
                content:function (){
        "step 0"
        event.history=player.getHistory('useCard',function(evt){
            return evt.isPhaseUsing()&&['basic','trick','delay'].contains(get.type(evt.card));
        })
        "step 1"
        event._result={};
        if(event.history.length&&player.countCards('h')){
            var card=event.history.shift().card;
            card={name:card.name,nature:card.nature};
            if(lib.filter.cardEnabled(card)){
                if(game.hasPlayer(function(current){
                    return player.canUse(card,current);
                })){
                    lib.skill.圣_bingxin_card.viewAs=card;
                    var next=player.chooseToUse();
                    if(next.isOnline()){
                        player.send(function(card){
                            lib.skill.圣_bingxin_card.viewAs=card;
                        },card)
                    }
                    next.set('openskilldialog','冰心：将一张手牌当'+get.translation(card)+'使用');
                    next.set('norestore',true);
                    next.set('_backupevent','圣_bingxin_card');
                    next.backup('圣_bingxin_card');
                }
            }
        }
        "step 2"
        if(result&&result.bool) event.goto(1);
    },
    group:"圣_bingxin_card",
    subSkill:{
    card:{
   filterCard:function (card){
					return get.itemtype(card)=='card';
				},
				selectCard:true,
				popname:true,
    },
    },
            },
            "圣_qianying":{
                audio:"ext:混沌界:2",
                trigger:{
                    global:"dying",
                },
                usable:1,
                forced:true,
                direct:true,
                priority:100,
                filter:function (event,player){
        return event.player.hp<=0;
    },
                content:function (){
        "step 0"
        player.chooseTarget(get.prompt2('圣_qianying'),function(card,player,target){
						return target!=_status.event.getTrigger().player;
					}).set('ai',function(target){
						var player=_status.event.player;
						var trigger=_status.event.getTrigger();
						if(get.attitude(player,trigger.player)>0){
							var att1=get.attitude(target,player);
							var att2=get.attitude(target,trigger.player);
							var att3=get.attitude(player,target);
							if(att3<0) return 0;
							return att1/2+att2+att3;
						}
						else{
							return 0;
							// return get.attitude(player,target);
						}
					});
        "step 1"
        if(result.bool){
        event.target=result.targets[0];
        player.logSkill('圣_qianying',event,target);
            player.line('thunder',event.target);
            event.target.draw(5);
        }
        else{
            event.finish();
        }
        "step 2"
        var target=event.target;
        var tosave=trigger.player;
        var att=get.attitude(target,tosave);
        var hastao=target.countCards('h','tao');
        target.chooseToDiscard(4,true,'he').set('ai',function(card){
            var hastao=_status.event.hastao;
            var att=_status.event.att;
            if(!hastao&&att>0){
                var suit=get.suit(card);
                for(var i=0;i<ui.selected.cards.length;i++){
                    if(get.suit(ui.selected.cards[i])==suit){
                        return -4-get.value(card);
                    }
                }
            }
            if(att<0&&ui.selected.cards.length==3){
                var suit=get.suit(card);
                for(var i=0;i<ui.selected.cards.length;i++){
                    if(get.suit(ui.selected.cards[i])==suit){
                        return -get.value(card);
                    }
                }
                return -10-get.value(card);
            }
            return -get.value(card);
        }).set('hastao',hastao).set('att',att);
        "step 3"
        if(result.cards&&result.cards.length==4){
            var suits=[];
            for(var i=0;i<result.cards.length;i++){
                suits.add(get.suit(result.cards[i]));
            }
            if(suits.length==4){
            if(trigger.player.hp<1){
                event.target.line(trigger.player);
                trigger.player.recover(1-trigger.player.hp,event.target)
            }}
            else{
            if(player.hp>0){
                player.loseHp();
                }
                player.gain(result.cards,'gain2');
                game.log(player,'获得了',result.cards);
            }
        }
    },
                ai:{
                    expose:0.2,
                    threaten:1.5,
                    save:true,
                },
            },
            "圣_jiang":{
                shaRelated:true,
                audio:"ext:混沌界:2",
                trigger:{
                    player:"useCardToPlayered",
                    target:"useCardToTargeted",
                },
                filter:function (event,player){
        if(!(event.card.name=='juedou'||event.card.name=='sha')) return false;
        return player==event.target||event.getParent().triggeredTargets3.length==1;
    },
                locked:true,
                subSkill:{
                    mark:{
                        sub:true,
                    },
                },
                content:function (){
        "step 0"
        if(trigger.player.countCards('h')!=trigger.target.countCards('h')){
        if(trigger.player.countCards('h')>trigger.target.countCards('h')){
        if(trigger.player.countCards('h')){
        trigger.player.chooseToDiscard('h',true);
        if(player==trigger.player){
            player.addSkill('圣_jiang_mark');
        }
        }
        }else{
        if(trigger.target.countCards('h')){
        trigger.target.chooseToDiscard('h',true);
        if(player==trigger.target){
            player.addSkill('圣_jiang_mark');
        }
        }
        }
        }
        "step 1"
        if(!trigger.target.countCards('h')){
            trigger.target.draw();
        }
        if(!trigger.player.countCards('h')){
            trigger.player.draw();
        }
        "step 2"
        if(player.hp>1){
        if(player==trigger.player){
            trigger.player.loseHp();   
        }else{
            trigger.target.loseHp();
        }
      }else{
      event.goto(4);
      }
        "step 3"
        if(player==trigger.player){
        trigger.player.addMark('_混沌_圣神_圣甲',true);
        }else{
        trigger.target.addMark('_混沌_圣神_圣甲',true);
        }
        "step 4"
        if(player==trigger.player){
            trigger.player.line(trigger.target);
            trigger.player.chooseToCompare(trigger.target);
        }else{
            trigger.target.line(trigger.player);
            trigger.target.chooseToCompare(trigger.player);
        }
        "step 5"
        if(result.bool){
            if(player==trigger.player){
                trigger.player.gain(trigger.cards,'gain2');
                if(trigger.card.name=='sha'){
                trigger.player.getStat().card.sha--;
                }
            }else{
                trigger.target.gain(trigger.cards,'gain2');
            }
        }else{
            if(player==trigger.player){
                if(trigger.player.hasSkill('圣_jiang_mark')){
                    trigger.player.draw(2);
                    trigger.player.removeSkill('圣_jiang_mark');
                }else{
                    trigger.player.draw(); 
                }
            }else{
                if(trigger.target.hasSkill('圣_jiang_mark')){
                    trigger.target.draw(2);
                    trigger.target.removeSkill('圣_jiang_mark');
                }else{
                    trigger.target.draw(); 
                }
            }
        }
        "step 6"
        if(player.hasSkill('圣_jiang_mark')){
            player.removeSkill('圣_jiang_mark');
        }
    },
                ai:{
                    effect:{
                        target:function (card,player,target){
                if(card.name=='sha'&&get.color(card)=='red') return [1,0.6];
            },
                        player:function (card,player,target){
                if(card.name=='sha'&&get.color(card)=='red') return [1,1];
            },
                    },
                },
            },
            "圣_yingyang":{
                trigger:{
                    player:["chooseToCompareAfter","compareMultipleAfter"],
                    target:["chooseToCompareAfter","compareMultipleAfter"],
                },
                forced:true,
                direct:true,
                content:function (){
        if(player==trigger.player){
            if(trigger.num1<=trigger.num2){
                player.logSkill('圣_yingyang');
                player.gainMaxHp();
                player.addSkill('圣_yingyang_buff');
            }
        }else{
            if(trigger.num1>=trigger.num2){
                player.logSkill('圣_yingyang');
                player.gainMaxHp();
                player.addSkill('圣_yingyang_buff');
            }
        }
    },
                subSkill:{
                    buff:{
                        mark:true,
                        marktext:"鹰",
                        intro:{
                            content:"当你与拼点目标双方的拼点牌均亮出后，若对方的拼点牌点数大于1，你掠夺其1点拼点牌点数",
                        },
                        trigger:{
                            player:"compare",
                            target:"compare",
                        },
                        forced:true,
                        direct:true,
                        content:function (){
        if(player==trigger.player){
            if(trigger.num2>1){
            trigger.num2-=1;
            trigger.num1+=1;
            game.log(player,'掠夺了',trigger.target,'的','#y1','点','#g拼点牌点数');
            if(trigger.num1>13){
            game.log(player,'的拼点牌最终点数为','#yK');
            }else{
            game.log(player,'的拼点牌最终点数为',trigger.num1);
            }
            game.log(trigger.target,'的拼点牌最终点数为',trigger.num2);
            }
            player.removeSkill('圣_yingyang_buff');
        }else{
           if(trigger.num1>1){
            trigger.num1-=1;
            trigger.num2+=1;
            game.log(player,'掠夺了',trigger.player,'的','#y1','点','#g拼点牌点数');
            if(trigger.num2>13){
            game.log(player,'的拼点牌最终点数为','#yK');
            }else{
            game.log(player,'的拼点牌最终点数为',trigger.num2);
            }
            game.log(trigger.player,'的拼点牌最终点数为',trigger.num1);
            }
            player.removeSkill('圣_yingyang_buff');
        }
    },
                        sub:true,
                    },
                },
            },
            "圣_hunshang":{
                skillAnimation:true,
                animationColor:"thunder",
                audio:"ext:混沌界:2",
                derivation:["圣_shengzi","圣_shenghun","圣_hunzi"],
                unique:true,
                trigger:{
                    player:"phaseBegin",
                },
                filter:function (event,player){
        return player.getDamagedHp()>4;
    },
                forced:true,
                priority:100,
                content:function (){
        "step 0"
        player.chooseToDiscard('j',Infinity,true);
        player.link(false);
        player.turnOver(false);
        player.unMad();
        player.enableEquip(1);
        player.enableEquip(2);
        player.enableEquip(3);
        player.enableEquip(4);
        player.enableEquip(5);
        "step 1"
        player.addMark('_混沌_圣神_圣甲',player.maxHp-1);
        "step 2"
        player.loseMaxHp(player.maxHp-1)._triggered=null;
        "step 3"
        if(player.hp<1){
            player.recover(1-player.hp);
        }
        "step 4"
        player.removeSkill('圣_jiang');
        player.removeSkill('圣_yingyang');
        player.addSkill('圣_shengzi');
        player.addSkill('圣_shenghun');
        player.addSkill('圣_hunzi');
        player.addSkill('圣_hunshang_maxHp');
        if(player.hasSkill('圣_yingyang_buff')){
        player.removeSkill('圣_yingyang_buff');
        }
        player.awakenSkill('圣_hunshang');
    },
                ai:{
                    threaten:function (player,target){
            if(target.hp==1) return 2;
            return 0.5;
        },
                    maixie:true,
                    effect:{
                        target:function (card,player,target){
                if(!target.hasFriend()) return;
                if(get.tag(card,'damage')==1&&target.hp==2&&!target.isTurnedOver()&&
                _status.currentPhase!=target&&get.distance(_status.currentPhase,target,'absolute')<=3) return [0.5,1];
            },
                    },
                },  
            },
                圣_hunshang_maxHp:{
                trigger:{
                    player:["gainMaxHpBegin","loseMaxHpBegin"],
                },
                priority:100,
                direct:true,
                forced:true,
                unique:true,
                charlotte:true,
                content:function (){
        trigger.cancel();
                  },
                },
            "圣_shengzi":{
                audio:"ext:混沌界:2",
                mod:{
                    maxHandcard:function (player,num){
            return num+player.storage.圣_shengzi;
        },
                },
                intro:{
                    content:function (storage){
            if(storage>0) return '你的手牌上限永久增加+'+storage;
            if(storage<0) return '你的手牌上限永久增加+'+storage;
            return '你的手牌上限无变化';
        },
                },
                marktext:"姿",
                init:function (player){
        player.storage.圣_shengzi=0;
    },
                trigger:{
                    player:"phaseDrawBegin",
                },
                locked:true,
                direct:true,
                filter:function (event){
        return event.num>0&&!event.numFixed;
    },
                content:function (){
        "step 0"
        var num=trigger.num;
        player.chooseTarget(get.prompt('圣_shengzi'),'令至多'+get.translation(num)+'名其他角色摸一张牌并依次视为对其发起拼点',[1,num],function(card,player,target){
            return player!=target;
        },function(target){
            var att=get.attitude(_status.event.player,target);
            return 1-att;
        });
        "step 1"
        if(result.bool){
           player.logSkill('圣_shengzi');
            trigger.changeToZero();
            event.targets=result.targets;
            event.num1=0;
        }else{event.finish();}
        "step 2"
        player.line(event.targets[event.num1]);
        if(!player.countCards('h')){player.draw();}
        event.targets[event.num1].draw();
        player.chooseToCompare(event.targets[event.num1]);
        "step 3"
        if(result.bool){
            var list=[];
            if(get.position(result.player)=='d') list.push(result.player);
            if(get.position(result.target)=='d') list.push(result.target);
            player.gain(list,'gain2','log');
        }else{
           player.draw();
           player.storage.圣_shengzi++;
           player.markSkill('圣_shengzi');
           player.syncStorage('圣_shengzi');
        }
        "step 4"
        if(event.num1<event.targets.length-1){
            event.num1++;
            event.goto(2);
        }else{
            event.finish();
        }
    },
                ai:{
                    threaten:1.6,
                    expose:0.2,
                },
            },
            "圣_shenghun":{
                audio:"ext:混沌界:2",
                trigger:{
                    player:"phaseBegin",
                },
                forced:true,
                filter:function (event,player){
        var num=game.countPlayer(function(current){
            return current.hp>player.hp;
        });
        return num>0&&player.hasSkill('圣_shengzi');
    },
                content:function (){
        "step 0"
        event.num=player.storage.圣_shengzi+1;
        "step 1"
        event.targets=game.filterPlayer();
        event.targets.sort(lib.sort.seat);
        "step 2"
        if(event.targets.length){
        event.num1=event.targets.length;
            var target=event.targets.shift();
            if(target.hp>player.hp){
                player.line(target);
                target.draw(event.num);
                player.discardPlayerCard(target,[1,event.num+player.countCards('e')],'he',true);
            }
            event.redo();
        }
        "step 3"
        if(event.num1>=player.countCards('e')){
        var list=[];
        for(var i=1;i<=5;i++){
            if(!player.getEquip(i)){
                var name=get.inpile('equip'+i).randomGet();
                if(name){
                    var card=game.createCard(name);
                    list.push(card);
                    player.equip(card);
                }
            }
        }
        if(list.length){
            player.$draw(list);
        }
        player.addMark('_混沌_圣神_圣甲',true);
     }
    },
            },
            "圣_yingba":{
                audio:"ext:混沌界:2",
                enable:"phaseUse",
                locked:true,
                filterTarget:function (card,player,target){
        return target.maxHp>1&&player!=target;
    },
                filter:function (event,player){
        return player.maxHp>1;
    },
                content:function (){
        'step 0'
        player.loseMaxHp();
        target.loseMaxHp();
        'step 1'
        target.addMark('圣_yingba_mark');
        'step 2'
        if(target.countCards('h')>player.countCards('h')){
        var num=target.countCards('h')-player.countCards('h');
        target.chooseCard('【英霸】：请选择交给神孙策的牌','h',num,true);
        }else{event.finish();}
        'step 3'
        player.gain(result.cards,target,'giveAuto');
    },
                subSkill:{
                    mark:{
                        mark:true,
                        marktext:"平",
                        intro:{
                            name:"平定",
                            content:"该角色持有#枚“平定”印记",
                        },
                        init:function (player){
                player.storage.圣_yingba_mark=0;
            },
                        sub:true,
                    },
                },
            },
            "圣_fuhai":{
                mod:{
                    targetInRange:function (card,player,target){
            if(target.hasMark('圣_yingba_mark')) return true;
        },
                },
                audio:"ext:混沌界:2",
                trigger:{
                    player:"useCard",
                },
                forced:true,
                filter:function (event,player){
       return event.card&&(get.type(event.card)=='trick'||get.type(event.card)=='basic'&&!['shan','tao','jiu','du'].contains(event.card.name))&&game.hasPlayer(function(current){
           return current!=player&&current.hasMark('圣_yingba_mark');
       });
    },
                content:function (){
        trigger.directHit.addArray(game.filterPlayer(function(current){
            return current!=player&&current.hasMark('圣_yingba_mark');
        }));
    },
                group:["圣_fuhai_target","圣_fuhai_gain"],
                subSkill:{
                    target:{
                        trigger:{
                            player:"useCardToPlayered",
                        },
                        direct:true,
                        forced:true,
                        filter:function (event,player){
                return event.target.hasMark('圣_yingba_mark');
            },
                        content:function (){
                'step 0'
                player.logSkill('圣_fuhai');
                var num=trigger.target.countMark('圣_yingba_mark');
                player.gainMaxHp(num);
                player.draw(num);
                'step 1'
                trigger.target.removeMark('圣_yingba_mark',Infinity);
            },
                        sub:true,
                    },
                    gain:{
                        trigger:{
                            global:"dying",
                        },
                        forced:true,
                        direct:true,
                        filter:function (event,player){
                return event.player.hasMark('圣_yingba_mark');
            },
                        content:function (){
                'step 0'
                player.logSkill('圣_fuhai');
                var num=trigger.player.countMark('圣_yingba_mark');
                player.gainMaxHp(num);
                player.draw(num);
                'step 1'
                trigger.player.removeMark('圣_yingba_mark',Infinity);
            },
                        sub:true,
                    },
                },
            },
            "圣_pinghe":{
                mod:{
                    maxHandcard:function (player,num){
            return num=player.getDamagedHp();
        },
                },
                audio:"ext:混沌界:2",
                trigger:{
                    player:"damageBegin",
                },
                forced:true,
                direct:true,
                priority:-1,
                filter:function (event,player){
       return player.countCards('h')>=event.num&&event.num>0; 
    },
                content:function (){
        'step 0'
        player.chooseCardTarget({
            position:'h',
            filterCard:true,
            selectCard:trigger.num,
            selectTarget:[0,1],
            filterTarget:function (card,player,target){
                return target!=player;
            },
            prompt:get.prompt('圣_pinghe'),
            prompt2:"请选择将"+trigger.num+"张牌交给一名其他角色，然后防止此伤害；若未选择角色则改为将牌弃置之",
        });
        'step 1'
        if(result.bool){
            player.logSkill('圣_pinghe');
            if(result.targets.length){
                result.targets[0].gain(result.cards,player,'giveAuto');
            }else{
                player.discard(result.cards);
            }
        }else{event.finish();}
        'step 2'
        if(trigger.source&&trigger.source!=player&&trigger.source.isAlive()){
            trigger.source.addMark('圣_yingba_mark',trigger.num);
        }
        'step 3'
        trigger.cancel();
    },
            },
            "圣_hunzi":{
                skillAnimation:true,
                animationColor:"metal",
                audio:"ext:混沌界:2",
                trigger:{
                    player:"damageBegin",
                },
                forced:true,
                priority:-2,
                filter:function (event,player){
        return event.source&&event.num>0&&!player.inRange(event.source);
    },
                content:function (){
        'step 0'
        trigger.num=0;
        'step 1'
        player.removeSkill('圣_jiang');
        player.removeSkill('圣_shengzi');
        player.removeSkill('圣_shenghun');
        player.removeSkill('圣_hunshang_maxHp');
        player.addSkill('圣_yingba');
        player.addSkill('圣_fuhai');
        player.addSkill('圣_pinghe');
        'step 2'
        player.gainMaxHp(4);
        'step 3'
        player.drawTo(player.maxHp);
        'step 4'
        player.awakenSkill('圣_hunzi');
    },
            },
            "圣_lingxie_juexing":{
            skillAnimation:"epic",
            animationColor:"metal",
                trigger:{
                    player:"phaseBegin",
                },
                forced:true,
                content:function (){},
            },
            "圣_lingxie":{
                audio:"ext:混沌界:2",
                enable:"phaseUse",
                usable:1,
                locked:true,
                position:"he",
                init:function (player){
        player.storage.圣_lingxie=0;
    },
                filterTarget:function (event,player,target){
        return player!=target;
    },
                selectCard:[1,Infinity],
                filterCard:function (card){
        return get.type(card)=='equip';
    },
                filter:function (event,player){
        return player.countCards('he',{type:'equip'})>0;
    },
                content:function (){
        "step 0"
        event.num=event.cards.length;
        player.storage.圣_lingxie+=event.cards.length;
        player.markSkill('圣_lingxie');
        player.syncStorage('圣_lingxie');
        "step 1"
        if(event.num>0&&player.storage.圣_lingxie<7){
            target.disableEquip(['equip1','equip2','equip3','equip4','equip5'].randomGet());
            event.num--;
            event.goto(1);
        }
        if(event.num>0&&player.storage.圣_lingxie>=7){
        if(!player.hasSkill('圣_lingxie_mark')){
        player.addSkill('圣_lingxie_mark');
        player.useSkill('圣_lingxie_juexing');
        }
            var list=[];
            for(var i=1;i<6;i++){
                if(!target.isDisabled(i)) list.push(i);
            }
            if(list.length) target.disableEquip(list.randomGet());
            event.num--;
            event.goto(1);
        }
       },
                ai:{
                    order:1,
                    result:{
                        target:function (target,player){
                if(player.countCards('he',{type:'equip'})>7) return -1;
                return 0;
            }
                    },
                },
                subSkill:{
                mark:{
                marktext:"械",
                locked:true,
                mark:true,
                intro:{
                content:"〖灵械〗后续触发时不会再重复选择目标角色的已废除装备栏",
                        },
                },
                },
            },
            "圣_linglong":{
                trigger:{
                    player:"useCard",
                },
                direct:true,
                forced:true,
                priority:100,
                content:function (){
     if(get.type(trigger.card,'equip')=='equip'){
             player.logSkill('圣_linglong_equip');
             player.addMark('_混沌_圣神_圣甲',true);
     }
     if(get.type(trigger.card,'delay')=='delay'){
         player.logSkill('圣_linglong_delay');
         var enemies=player.getEnemies();
         if(enemies.length){
             var target=enemies.randomGet();
             player.line(target);
             target.addExpose(0.1);
             target.loseHp();
         }
     }
     if(get.type(trigger.card,'trick')=='trick'){
         player.logSkill('圣_linglong_trick');
         player.draw();
     }
    },
                ai:{
                    threaten:1.4,
                },
            },
            "圣_linglong_equip":{audio:"ext:混沌界:2",},
            "圣_linglong_delay":{audio:"ext:混沌界:2",},
            "圣_linglong_trick":{audio:"ext:混沌界:2",},
            
            "圣_mocai":{
                trigger:{
                    player:"loseAfter",
                },
                forced:true,
                direct:true,
                priority:-1,
                filter:function (event,player){
        return _status.currentPhase!=player&&event.num>0;
    },
                content:function (){
        "step 0"
        game.delay(0.5);
        event.cards=get.cards(trigger.cards.length+trigger.cards.length);
        player.showCards(event.cards);
        "step 1"
        var gained=[];
        var tothrow=[];
        for(var i=0;i<event.cards.length;i++){
            if(get.type(event.cards[i])!='basic'){
                gained.push(event.cards[i]);
            }
            else{
                tothrow.push(event.cards[i]);
            }
        }
        player.gain(gained,'gain2');
        game.cardsDiscard(tothrow);
    },
            },
            "圣_qixing":{
                skillAnimation:"epic",
                animationColor:"fire",
                audio:"ext:混沌界:2",
                enable:"phaseUse",
                usable:1,
                locked:true,
                group:"圣_qixing_draw",
                filter:function (event,player){
        return player.countCards('h')<7&&
            player.countCards('h')&&
            player.countCards('e');
    },
                content:function (){
        "step 0"
        player.loseHp();
        player.chooseToDiscard('he',Infinity,true);
        "step 1"
        player.draw(7-player.countCards('h'));
    },
    ai:{
    order:1,
    result:{
    player:function (player){
    if(player.countCards('he')<2&&player.hp>1) return 1;
    },
    },
    },
                subSkill:{
                    draw:{
                        mod:{
                            maxHandcard:function (player,num){
            return num+=7;
        },
                        },
                        audio:"ext:混沌界:2",
                        trigger:{
                            global:"gameStart",
                        },
                        forced:true,
                        priority:100,
                        content:function (){
        player.draw(7);
    },
                        sub:true,
                    },
                },
            },
            "圣_bagua":{
                audio:"ext:混沌界:2",
                trigger:{
                player:['chooseToRespondBegin','chooseToUseBegin']
                },
                forced:true,
                group:"圣_bagua_draw",
				filter:function (event,player){
					if(event.responded) return false;
					if(!event.filterCard({name:'shan'},player,event)) return false;
					if(event.name=='chooseToRespond'&&!lib.filter.cardRespondable({name:'shan'},player,event)) return false;
					if(player.hasSkillTag('unequip2')) return false;
					var evt=event.getParent();
					if(evt.player&&evt.player.hasSkillTag('unequip',false,{
						name:evt.card?evt.card.name:null,
						target:player,
						card:evt.card
					})) return false;
					return true;
				},
				check:function (event,player){
					if(event&&(event.ai||event.ai1)){
						var ai=event.ai||event.ai1;
						var tmp=_status.event;
						_status.event=event;
						var result=ai({name:'shan'},_status.event.player,event);
						_status.event=tmp;
						return result>0;
					}
					return true;
				},
				content:function (){
					"step 0"
					player.judge('bagua',function(card){return (get.color(card)=='red')?1.5:-0.5});
					"step 1"
					if(result.judge>0){
						trigger.untrigger();
						trigger.responded=true;
						trigger.result={bool:true,card:{name:'shan'}}
					}
				},
				ai:{
					respondShan:true,
					effect:{
						target:function (card,player,target,effect){
							if(player.getEquip('qinggang')&&card.name=='sha'||target.hasSkillTag('unequip2')) return;
							if(player.hasSkillTag('unequip',false,{
								name:card?card.name:null,
								target:player,
								card:card
							})) return;
							if(get.tag(card,'respondShan')) return 0.5;
						}
					}
				},
                subSkill:{
                    draw:{
                        trigger:{
                            target:"shaMiss",
                        },
                        forced:true,
                        priority:-1,
                        content:function (){
                          player.draw();
    },
                        sub:true,
                    },
                },
            },
            "圣_jinnang":{
                forced:true,
                locked:true,
                group:["圣_jinnang1","圣_jinnang2","圣_jinnang3","圣_jinnang4"],
            },
            "圣_jinnang2":{
                audio:"ext:混沌界:2",
                enable:"chooseToUse",
                filterCard:function (card){
        return get.suit(card)=='spade';
    },
                locked:true,
                position:"he",
                selectCard:true,
                viewAsFilter:function (player){
        return player.countCards('he',{suit:'spade'})>0;
    },
                viewAs:{
                    name:"wuxie",
                    suit:"spade",
                    number:8,
                    cards:[{"node":{"image":{},"info":{},"name":{},"name2":{},"background":{},"intro":{},"range":{}},"storage":{},"vanishtag":[],"_uncheck":[],"suit":"spade","number":8,"name":"jiu","cardid":"7478861425","original":"h","_transform":"translateX(0px)","clone":{"name":"jiu","suit":"spade","number":8,"node":{"name":{},"info":{},"intro":{},"background":{},"image":{}},"_transitionEnded":true,"timeout":3018},"timeout":2980}],
                },
                prompt:"将一张♠️卡牌当做【无懈可击】使用",
                check:function (card){return 8-get.value(card)},
                threaten:1.2,
                ai:{
                    basic:{
                        useful:[6,4],
                        value:[6,4],
                    },
                    result:{
                        player:1,
                    },
                    expose:0.2,
                },
            },
            "圣_jinnang3":{
                audio:"ext:混沌界:2",
                enable:["chooseToUse","chooseToRespond"],
                filterCard:function (card){
        return get.suit(card)=='heart';
    },
                locked:true,
                position:"he",
                selectCard:true,
                viewAs:{
                    name:"taoyuan",
                    suit:"heart",
                    number:9,
                    cards:[{"node":{"image":{},"info":{},"name":{},"name2":{},"background":{},"intro":{},"range":{}},"storage":{},"vanishtag":[],"_uncheck":[],"suit":"heart","number":9,"name":"shan","cardid":"1021722471","_transform":"translateX(112px)","clone":{"name":"shan","suit":"heart","number":9,"node":{"name":{},"info":{},"intro":{},"background":{},"image":{}},"_transitionEnded":true,"timeout":4947},"timeout":4735,"original":"h"}],
                },
                viewAsFilter:function (player){
        if(!player.countCards('he',{suit:'heart'})) return false;
    },
                prompt:"将一张♥️牌当做【桃园结义】使用",
                ai:{
                    basic:{
                        order:1,
                        useful:[3,1],
                        value:0,
                    },
                    result:{
                        target:function (player,target){
                return (target.hp<target.maxHp)?2:0;
            },
                    },
                    tag:{
                        recover:0.5,
                        multitarget:1,
                    },
                    wuxie:function (target,card,player,viewer){
            if(target.hp==1) return ;
            if(player==viewer){
                if(player.num('h')-(get.maxUse(player)+player.num('h','wuxie'))>=player.hp+1&&Math.random()>0.7) return ;
            }
            if(viewer.hasJudgeFirend()) return 0;
            if(target.isSafe()) return 0;
        },
                },
            },
            "圣_jinnang1":{
                audio:"ext:混沌界:2",
                enable:["chooseToUse","chooseToRespond"],
                filterCard:function (card){
        return get.suit(card)=='diamond';
    },
                locked:true,
                position:"he",
                selectCard:true,
                viewAs:{
                    name:"huogong",
                    suit:"diamond",
                    number:9,
                    cards:[{"node":{"image":{},"info":{},"name":{},"name2":{},"background":{},"intro":{},"range":{}},"storage":{},"vanishtag":[],"_uncheck":[],"suit":"diamond","number":9,"name":"sha","cardid":"6281856495","_transform":"translateX(0px)","clone":{"name":"sha","suit":"diamond","number":9,"node":{"name":{},"info":{},"intro":{},"background":{},"image":{}},"_transitionEnded":true,"timeout":5111},"timeout":5076,"original":"h"}],
                },
                viewAsFilter:function (player){
        if(!player.countCards('he',{suit:'diamond'})) return false;
    },
                prompt:"将一张♦️牌当做【火攻】使用",
                ai:{
                    basic:{
                        order:4,
                        value:[3,1],
                        useful:1,
                    },
                    wuxie:function (target,card,player,current,state){
            if(get.attitude(current,player)>=0&&state>0) return false;
        },
                    result:{
                        player:function (player){
                var nh=player.countCards('h');
                if(nh<=player.hp&&nh<=4&&_status.event.name=='chooseToUse'){
                    if(typeof _status.event.filterCard=='function'&&
                        _status.event.filterCard({name:'huogong'})){
                        return -10;
                    }
                    if(_status.event.skill){
                        var viewAs=get.info(_status.event.skill).viewAs;
                        if(viewAs=='huogong') return -10;
                        if(viewAs&&viewAs.name=='huogong') return -10;
                    }
                }
                return 0;
            },
                        target:function (player,target){
                if(target.hasSkill('huogong2')||target.countCards('h')==0) return 0;
                if(player.countCards('h')<=1) return 0;
                if(target==player){
                    if(typeof _status.event.filterCard=='function'&&
                        _status.event.filterCard({name:'huogong'})){
                        return -1.5;
                    }
                    if(_status.event.skill){
                        var viewAs=get.info(_status.event.skill).viewAs;
                        if(viewAs=='huogong') return -1.5;
                        if(viewAs&&viewAs.name=='huogong') return -1.5;
                    }
                    return 0;
                }
                return -1.5;
            },
                    },
                    tag:{
                        damage:1,
                        fireDamage:1,
                        natureDamage:1,
                        norepeat:1,
                    },
                    target:function (player,target){
            if(target.hasSkill('huogong2')||target.num('h')==0) return 0;
            if(player.hasSkill('lianying')||player.hasSkill('relianying')||player.hasSkill('shangshi')) return -1;
            if(player.num('h')<=2) return 0;
            var num=0;
            var spade=player.num('h',{suit:'spade'});
            var heart=player.num('h',function(card){
                return get.suit(card)=='heart'&&card.name!='huogong'
            });
            var club=player.num('h',{suit:'club'});
            var diamond=player.num('h',function(card){
                return get.suit(card)=='diamond'&&card.name!='huogong'
            });
            num+=spade+heart+club+diamond;
            if(num<2) return 0;
            if(target==player){
                if(typeof _status.event.filterCard=='function'&&
                    _status.event.filterCard({name:'huogong'})){
                    return -1.5;
                }
                if(_status.event.skill){
                    var viewAs=get.info(_status.event.skill).viewAs;
                    if(viewAs=='huogong') return -1.5;
                    if(viewAs&&viewAs.name=='huogong') return -1.5;
                }
                return 0;
            }
            return -1.5;
        },
                },
            },
            "圣_jinnang4":{
                audio:"ext:混沌界:2",
               enable:"phaseUse",
				filter:function (event,player){
					return player.countCards("h",{suit:"club"})>0;
				},
				filterCard:function (card){
					return get.suit(card)=="club";
				},
				viewAs:{
				name:"tiesuo"
				},
				prompt:"将一张梅花牌当铁锁连环使用",
				check:function (card){
				return 4.5-get.value(card)
				}
            },
            "圣_xueji":{
                audio:"ext:混沌界:2",
                enable:"phaseUse",
                usable:1,
                locked:true,
                filterTarget:function (event,player,target){
        return player!=target;
    },
                selectTarget:function (){
        var player=_status.event.player
        return [1,Math.max(1,player.getDamagedHp())];
    },
                multitarget:true,
                multiline:true,
                line:"fire",
                content:function (){
        "step 0"
        player.loseHp();
        "step 1"
        event.delay=false;
        for(var i=0;i<targets.length;i++){
            if(!targets[i].isLinked()){
                targets[i].link(true);
                event.delay=true;
            }
        }
        "step 2"
        if(event.delay){
            game.delay();
        }
        "step 3"
        targets[0].damage('fire');
    },
                ai:{
                    order:11,
                    result:{
                    target:function (player,target){
                    if(player.hp+player.countCards('h',{name:"tao"})>2) return -1;
                    },
                    },
                    basic:{
                        order:5,
                        useful:1,
                        value:5.5,
                    },
                    tag:{
                        respond:2,
                        respondSha:2,
                        damage:1,
                    },
                },
            },
            "圣_huxiao":{
                trigger:{
                    player:"useCardToPlayered",
                },
                forced:true,
                direct:true,
                filter:function (event,player){
        return event.target&&event.card&&
        event.card.name=='sha'&&
        event.target.hasSkill('圣_huxiao_mark');
    },
                content:function (){
           player.getStat().card.sha--;
    },
    group:"圣_huxiao_add",
                subSkill:{
                add:{
                trigger:{
                    source:"damageEnd",
                },
                forced:true,
                direct:true,
                filter:function (event,player){
        return event.nature=='fire';
    },
                content:function (){
        trigger.player.addTempSkill('圣_huxiao_mark');
    },
                },
                    mark:{
                        marktext:"啸",
                        locked:true,
                        mark:true,
                        intro:{
                            content:"神银屏对该角色使用【杀】无次数限制",
                        },
                        sub:true,
                    },
                },
            },
            "圣_shengyou":{
                audio:"ext:混沌界:2",
                trigger:{
                    player:"phaseBegin",
                },
                forced:true,
                content:function (){
        if(!player.getEquip(1)){
            if(trigger.name=='phase'){
            player.useCard(game.createCard('qinglong','spade',13),player);
        }
        }
        else{
            player.recover();
        }
    },
            },
            "圣_hunji":{
                skillAnimation:"epic",
                animationColor:"fire",
                audio:"ext:混沌界:2",
                trigger:{
                    player:"phaseEnd",
                },
                forced:true,
                unique:true,
                derivation:"圣_shengyou",
                filter:function (event,player){
        return player.getStat('damage')>=player.hp;
    },
                content:function (){
        "step 0"
        if(player.isDamaged()){
            player.recover();
        }
        else{
            player.draw();
        }
        "step 1"
        player.addSkill('圣_shengyou');
        player.awakenSkill('圣_hunji');
    },
            },
            "圣_yueying":{
            audio:"ext:混沌界:2",
                trigger:{
                    player:"phaseEnd",
                },
                priority:-1,
                forced:true,
                content:function (){
        "step 0"
        event.target=game.filterPlayer().randomGet(player);
        if(!event.target){
            event.finish();
            return;
        }
        player.line(event.target);
        "step 1"
        event.target.damage();
        "step 2"
        if(player.isDamaged()){
        player.recover();
        }else{
        player.draw(2);
        }
    },
            },
            "圣_tianzi":{
                trigger:{
                    player:"damageEnd",
                },
                forced:true,
                priority:100,
                filter:function (event,player){
        return event.source&&event.source.sex=='male';
    },
                content:function (){
                trigger.source.addTempSkill('圣_tianzi_End');
    },
    subSkill:{
    End:{
    init:function (player){
    player.goMad();
    },
    onremove:function (player){
    player.unMad();
    }
    },
    },
            },
            "圣_meixin":{
                audio:"ext:混沌界:2",
                enable:"phaseUse",
                usable:1,
                locked:true,
                filter:function (event,player){
        return game.countPlayer(function(current){
            return current!=player;
        })>1&&player.countCards('he');
    },
                check:function (card){return 10-get.value(card)},
                filterCard:true,
                position:"he",
                filterTarget:function (card,player,target){
        if(player==target) return false;
        if(!target.countCards("h")) return false;
        if(ui.selected.targets.length==1){
            return target.canUse({name:'juedou'},ui.selected.targets[0]);
        }
        return true;
    },
                targetprompt:["首战","次战"],
                selectTarget:2,
                multitarget:true,
                content:function (){
                "step 0"
                player.turnOver();
                "step 1"
                targets[0].goMad();
                targets[1].goMad();
                "step 2"
                targets[1].gainPlayerCard('h',Infinity,targets[0],true);
                "step 3"
                targets[1].line(player);
                "step 4"
                game.delay(1);
                "step 5"
                player.gainPlayerCard('h',Infinity,targets[1],true);
                "step 6"
                player.chooseCard('请选择交给'+get.translation(targets[0])+'的牌','he',targets[0].hp,true);
                "step 7"
                player.line(targets[0]);
			           		player.$give(result.cards.length,targets[0]);
                "step 8"
                game.delay(1);
                targets[0].gain(result.cards,player);
                "step 9"
                player.chooseCard('请选择交给'+get.translation(targets[1])+'的牌','he',targets[1].hp,true);
                "step 10"
                player.line(targets[1]);
			           		player.$give(result.cards.length,targets[1]);
                "step 11"
                game.delay(1);
                targets[1].gain(result.cards,player);
                "step 12"
                if(targets[0].isAlive()&&targets[1].isAlive()){
                targets[0].line(targets[1]);
                targets[0].useCard({name:'juedou'},'nowuxie',targets[1],'noai').animate=false;
                }
                "step 13"
                if(targets[0].isAlive()&&targets[1].isAlive()){
                targets[1].line(targets[0]);
                targets[1].useCard({name:'juedou'},'nowuxie',targets[0],'noai').animate=false;
                }
                "step 14"
                targets[0].unMad();
                targets[1].unMad();
    },
                ai:{
                    order:8,
                    result:{
                        target:function (player,target){
                if(ui.selected.targets.length==0){
                    return -3;
                }
                else{
                    return get.effect(target,{name:'juedou'},ui.selected.targets[0],target);
                }
            },
                    },
                    expose:0.4,
                    threaten:3,
                },
            },
            "圣_tiaoxin":{
            audio:"ext:混沌界:2",
                audio:"ext:混沌界:2",
                enable:"phaseUse",
                usable:1,
                locked:true,
                filterCard:true,
                selectCard:true,
                position:"h",
                filter:function (event,player){
        return player.countCards('h')>0;
    },
                filterTarget:function (card,player,target){
        return target!=player&&target.countCards('he')>0;
    },
                content:function (){
    "step 0"
    player.discardPlayerCard(target,true);
    "step 1"
    if(cards[0].name=='sha'||result.links[0].name=='sha'){
        if(cards[0].name=='sha'){
            target.damage(player,true);
        }
        if(result.links[0].name=='sha'&&target.isAlive()){
            player.damage(target,true);
          }
        }else{
            player.draw();
            target.draw();
         }    
      },
                ai:{
                    order:4,
                    expose:0.2,
                    result:{
                        target:-1,
                        player:function (player,target){
                if(target.countCards('h')==0) return 0;
                if(target.countCards('h')==1) return -0.1;
                if(player.hp<=2) return -2;
                if(player.countCards('h','shan')==0) return -1;
                return -0.5;
            },
                    },
                    threaten:1.1,
                },
            },
            "圣_youlin":{
                trigger:{
                    player:"damageAfter",
                },
                priority:-1,
                forced:true,
                filter:function (event,player){
        return event.num>0&&!player.storage._混沌_圣神_圣甲;
    },
                content:function (){
        player.addMark('_混沌_圣神_圣甲',true);
     },
                group:"圣_youlin_loseHp",
                subSkill:{
                    loseHp:{
                        trigger:{
                            player:"damageBegin",
                        },
                        priority:101,
                        forced:true,
                        filter:function (event,player){
        return player.storage._混沌_圣神_圣甲&&
            event.source&&event.source!=player;
    },
                        content:function (){
        trigger.source.loseHp();
     },
                        sub:true,
                    },
                },
            },
            "圣_longyi":{
            skillAnimation:"epic",
            animationColor:"metal",
            audio:"ext:混沌界:2",
                trigger:{
                    player:["phaseBegin","dying"],
                },
                priority:100,
                forced:true,
                unique:true,
                derivation:["圣_tianxing","圣_gufa"],
                filter:function (event,player){
        return !player.countCards('h')||player.hp<=1;
    },
                content:function (){
        "step 0"
        if(player.hp<1){
        player.recover(1-player.hp);
     }
        player.draw(2);
        "step 1"
        player.removeSkill('圣_tiaoxin');
        player.removeSkill('圣_youlin');
        player.addSkill('圣_tianxing');
        player.addSkill('圣_gufa');
        player.awakenSkill('圣_longyi');
        "step 2"
        player.insertPhase();
  },
            },
            "圣_tianxing":{
                audio:"ext:混沌界:2",
                trigger:{
                    player:"phaseBegin",
                },
                locked:true,
                priority:-1,
                content:function (){
        "step 0"
        player.skip('phaseDraw');
        "step 1"
        if(game.countPlayer()>5){
        event.cards=get.cards(7);
        }else{
        event.cards=get.cards(4);
        }
        if(player.maxHp-player.hp>2){
        var num=player.maxHp-player.hp;
          }else{
        var num=2;
          }
          if(num<event.cards.length){
        player.chooseCardButton(event.cards,[num,Infinity],'天星：请将至少'+get.translation(num)+'张牌置于牌堆顶',true).set('ai',ai.get.buttonValue);
        }else{
        player.chooseCardButton(event.cards,[1,Infinity],'天星：请将至少一张牌置于牌堆顶',true).set('ai',ai.get.buttonValue);
        }
        "step 2"
        if(result.bool){
            var xing=[];
            for(var i=0;i<result.links.length;i++){
                xing.push(result.links[i]);
                cards.remove(result.links[i]);
            }
                player.gain(cards,'gain2');
                if(cards.length>=3){
                    player.addTempSkill('圣_tianxing_mark');
                }
            while(xing.length){
                ui.cardPile.insertBefore(xing.pop(),ui.cardPile.firstChild);
            }
        }
    },
                subSkill:{
                    mark:{
                        sub:true,
                    },
                },
            },
            "圣_gufa":{
                audio:"ext:混沌界:2",
                enable:"phaseUse",
                usable:1,
                locked:true,
                filterTarget:function (card,player,target){
        return player!=target&&target.countCards('h')>0;
    },
                filterCard:true,
                selectCard:-1,
                position:"h",
                filter:function (event,player){
        return player.countCards('h')>0&&!player.hasSkill('圣_tianxing_mark');
    },
                content:function (){
        "step 0"
        event.num=cards.length;
        "step 1"
        player.draw();
        "step 2"
        player.chooseToCompare(target);
        "step 3"
        if(result.bool){
            event.cards=get.cards();
            player.showCards(event.cards);
        }else{
            target.useCard({name:'sha'},player,false);
            event.finish();
        }
        "step 4"
        if(result.bool){
           if(get.color(event.cards)=='black'){
              player.line(target);
              target.damage(player);
              player.draw(event.num);
        }else{
            player.useCard({name:'sha'},target,false);
        }
        }
    },
            },
            "圣_liqu":{
                audio:"ext:混沌界:2",
                trigger:{
                    source:"damageAfter",
                },
                forced:true,
                direct:true,
                priority:-1,
                filter:function (event,player){
        if(event._notrigger.contains(event.player)) return false;
        return event.card&&event.card.name=='sha'&&event.player.isAlive()&&event.player.countGainableCards(player,'he')>0;
    },
                content:function (){
        "step 0"
        player.gainPlayerCard(get.prompt2('圣_liqu',trigger.player),trigger.player,'he',[1,2],'visibleMove').set('ai',function(card){
            var player=_status.event.player;
            var evt=_status.event.target;
            if(get.type(card)=='equip'){
                if(get.attitude(player,evt)>0&&game.hasPlayer(function(current){
                    return (player.canUse({name:'juedou'},current)&&current!=evt.target&&get.effect(current,{name:'juedou'},player,player)>2);
                })){
                    return 5;
                }
                else if(game.hasPlayer(function(current){
                    return (player.canUse({name:'juedou'},current)&&current!=evt&&current!=player&&get.effect(current,{name:'juedou'},player,player)<0);
                })){
                    return 1;
                }
                else return 4;
            };
            return 3;
        }).set('logSkill',['圣_liqu',trigger.player]);
        "step 1"
        if(result.bool){
            if(get.type(result.cards[0])=='equip'&&get.type(result.cards[1])=='equip'){
                player.loseHp();
             }
             if(get.type(result.cards[0])=='basic'&&get.type(result.cards[1])=='basic'){
               player.lose(result.cards[0],ui.special2);
               player.lose(result.cards[1],ui.special2);
               player.gain(game.createCard('juedou'),'gain2');
           }
           }else{event.finish();}
        "step 2"
        if(result.bool){
           if(result.cards.length==2){
               trigger.player.draw();
           }
        }
         
    },
                ai:{
                    halfneg:true,
                },
            },
            "圣_wushuang":{
                mod:{
                    selectTarget:function (card,player,range){
            if(card.name=='juedou') range[1]+=2;
            if(card.name=='sha') range[1]+=2;
        },
                    cardUsable:function (card,player,num){
            if(card.name=='sha') return num+2;
        },
                },
                trigger:{
                    player:"shaBegin",
                },
                forced:true,
                filter:function (event,player){
        return !event.directHit;
    },
                priority:-1,
                content:function (){
        if(typeof trigger.shanRequired=='number'){
            trigger.shanRequired++;
        }
        else{
            trigger.shanRequired=2;
        }
    },
                group:"圣_wushuang_juedou",
                subSkill:{
                    juedou:{
                        audio:"ext:混沌界:2",
                        trigger:{
                            player:"juedou",
                            target:"juedou",
                        },
                        forced:true,
                        filter:function (event,player){
                return event.turn!=player;
            },
                        priority:-1,
                        content:function (){
                "step 0"
                var next=trigger.turn.chooseToRespond({name:'sha'},'请打出一张杀响应决斗');
                next.set('prompt2','（共需打出2张杀）');
                next.autochoose=lib.filter.autoRespondSha;
                next.set('ai',function(card){
                    var player=_status.event.player;
                    var trigger=_status.event.getTrigger();
                    if(get.attitude(trigger.turn,player)<0&&trigger.turn.countCards('h','sha')>1){
                        return get.unuseful2(card);
                    }
                    return -1;
                });
                "step 1"
                if(result.bool==false){
                    trigger.directHit=true;
                }
            },
                        ai:{
                            result:{
                                target:function (card,player,target){
                        if(card.name=='juedou'&&target.countCards('h')>0) return [1,0,0,-1];
                    },
                            },
                        },
                        sub:true,
                    },
                },
            },
            "圣_shenyu":{
                skillAnimation:"epic",
                animationColor:"metal",
                audio:"ext:混沌界:2",
                trigger:{
                    source:"dieAfter",
                },
                filter:function (event,player){
        return event.player!=player&&player.isDamaged();
    },
                derivation:["圣_kuangbao","圣_shenfen"],
                unique:true,
                forced:true,
                content:function (){
        "step 0"
        player.removeSkill('圣_liqu');
        player.removeSkill('圣_wushuang');
        "step 1"
        player.addSkill('圣_kuangbao');
        player.addSkill('圣_shenfen');
        "step 2"
        player.recover();
        player.useCard(game.createCard('fangtian','diamond',13),player);
        player.useCard(game.createCard('chitu','diamond',13),player);
        "step 3"
        player.awakenSkill('圣_shenyu');
    },
            },
            "圣_kuangbao":{
                audio:"ext:混沌界:2",
                unique:true,
                marktext:"暴",
                intro:{
                    content:"mark",
                },
                init:function (player){
        player.storage.圣_kuangbao=0;
    },
                trigger:{
                    source:"damageEnd",
                    player:["damageEnd","loseHpEnd"],
                },
                forced:true,
                filter:function (event){
        return event.num>0; 
    },
                content:function (){
        player.storage.圣_kuangbao+=trigger.num;
        player.markSkill('圣_kuangbao');
        player.syncStorage('圣_kuangbao');
    },
                ai:{
                    combo:"shenfen",
                    maixie:true,
                    "maixie_hp":true,
                },
                group:["圣_kuangbao_draw","圣_kuangbao_sha"],
                subSkill:{
                    draw:{
                        trigger:{
                            player:"phaseDrawBegin",
                        },
                        forced:true,
                        filter:function (event,player){
               return player.storage.圣_kuangbao>0; 
            },
                        content:function (){
                player.gain(game.createCard('sha'),'gain2');
            },
                        sub:true,
                    },
                    sha:{
                        mod:{
                            cardUsable:function (card,player,num){
            if(card.name=='sha') return num+=player.storage.圣_kuangbao;
        },
                        },
                        sub:true,
                    },
                },
            },
            "圣_shenfen":{
                audio:"ext:混沌界:2",
                enable:"phaseUse",
                usable:1,
                locked:true,
                filter:function (event,player){
        return player.storage.圣_kuangbao>=6;
    },
                skillAnimation:"epic",
                animationColor:"metal",
                content:function (){
        "step 0"
        player.storage.圣_kuangbao-=6;
        player.syncStorage('圣_kuangbao');
        player.updateMarks('圣_kuangbao');
        "step 1"
        event.targets=game.filterPlayer();
        event.targets.remove(player);
        event.targets.sort(lib.sort.seat);
        event.targets2=event.targets.slice(0);
        player.line(event.targets,'green');
        "step 2"
        if(event.targets2.length){
            var cur=event.targets2.shift();
            if(cur){
                cur.chooseToDiscard('e',Infinity,true);
                cur.chooseToDiscard('h',true,4).set('ai',function(card){
            return 6-get.useful(card);
        });
                cur.damage(true,player);
            }
            event.redo();
                 }
            "step 3"
            var cards=[];
        for(var i=0;i<player.maxHp-player.hp;i++){
            cards.push(game.createCard('sha'));
        }
        player.gain(cards,'gain2');
    },
                ai:{
                    combo:"圣_kuangbao",
                    order:10,
                    result:{
                        player:function (player){
                return game.countPlayer(function(current){
                    if(current!=player){
                        return get.sgn(get.damageEffect(current,player,player));
                    }
                });
            },
                    },
                },
            },
            "圣_gongao":{
                audio:"ext:混沌界:2",
                trigger:{
                    global:"dying",
                },
                filter:function (event,player){
        return event.player!=player&&event.player.hp<=0;
    },
                forced:true,
                priority:1,
                content:function (){
                "step 0"
                player.gainMaxHp();
                player.recover();
                "step 1"
                if(trigger.source&&trigger.source!=player&&!player.isDamaged()){
                player.line(trigger.source,'thunder');
                trigger.source.draw();
                if(trigger.source.countCards('h')>trigger.player.countCards('h')){
                player.gainPlayerCard(trigger.source,'he',2,true);
                trigger.source.useCard({name:'sha'},player,false);
                }else{
                player.gainPlayerCard(trigger.source,'he',true);
                }
                }
             },
            },
            "圣_gongao_juexing":{
                trigger:{
                    global:"dying",
                },
                filter:function (event,player){
        return event.player!=player&&event.player.hp<=0;
    },
                forced:true,
                priority:1,
                direct:true,
                group:"圣_gongao_juexing_phaseEnd",
                content:function (){
                "step 0"
        player.logSkill('圣_gongao');
        player.gainMaxHp();
        player.recover();
        "step 1"
        if(player.hp>player.countCards('h')){
        player.draw(player.hp-player.counCards('h'));
        }
    },
                subSkill:{
                    phaseEnd:{
                trigger:{
                    player:"phaseAfter",
                },
                filter:function (event,player){
        return player.hp==1;
    },
                forced:true,
                priority:1,
                content:function (){
                if(player.maxHp>player.countCards('h')){
        player.draw(player.maxHp-player.countCards('h'));
       }
    },
            },
                },
            },
            "圣_weizhong":{
                audio:"ext:混沌界:2",
                trigger:{
                    player:["recoverEnd","damageEnd","loseHpEnd","loseMaxHpEnd","gainMaxHpEnd"],
                },
                forced:true,
                filter:function (event,player){
                   return event.num>0;
    },
                priority:-1,
                content:function (){
        player.draw(trigger.num);
    },
            },
            "圣_benghuai":{
                audio:"ext:混沌界:2",
                trigger:{
                    player:"useCardAfter",
                },
                priority:-1,
                forced:true,
                direct:true,
                content:function (){
                "step 0"
                if(player.hp<=player.storage.圣_benghuai_recover&&player.hp>1){
                    player.logSkill('圣_benghuai');
                    player.loseHp();
                  }
                "step 1"
                if(player.storage.圣_benghuai_recover>0){
                player.storage.圣_benghuai_recover=0;
                player.markSkill('圣_benghuai_recover');
                player.syncStorage('圣_benghuai_recover');
                }
    },
    group:["圣_benghuai_maxHp","圣_benghuai_recover"],
    subSkill:{
    recover:{
    init:function (player){
        player.storage.圣_benghuai_recover=0;
    },
    trigger:{
         player:"useCardBegin",
                },
                priority:-1,
                forced:true,
                direct:true,
                filter:function (event,player){
                return player.hp>0;
                },
                content:function (){
                player.storage.圣_benghuai_recover+=player.hp;
                player.markSkill('圣_benghuai_recover');
                player.syncStorage('圣_benghuai_recover');
    },
    },
    maxHp:{
            trigger:{
               player:"phaseEnd",
             },
                priority:-1,
                forced:true,
                direct:true,
                filter:function (event,player){
        return player.maxHp>1;
    },
                content:function (){
                player.logSkill('圣_benghuai');
                player.loseMaxHp();
    },
    },
    },
            },
            "圣_juemo":{
                mod:{
                    globalFrom:function (from,to,distance){
            return distance+(from.maxHp-from.hp);
        },
                    globalTo:function (from,to,distance){
            return distance+=(to.maxHp-to.hp);
        },
                },
            },
            "圣_juyi":{
                skillAnimation:"epic",
                animationColor:"thunder",
                audio:"ext:混沌界:2",
                derivation:["圣_gongao_juexing","圣_weizhong","圣_benghuai"],
                trigger:{
                    player:"phaseBegin",
                },
                filter:function (event,player){
        return player.maxHp>5&&player.isDamaged();
    },
                forced:true,
                unique:true,
                content:function (){
        "step 0"
        player.loseMaxHp();
        "step 1"
        player.draw(player.maxHp-player.hp);
        "step 2"
        player.removeSkill('圣_gongao');
        player.removeSkill('圣_juemo');
        player.addSkill('圣_gongao_juexing');
        player.addSkill('圣_weizhong');
        player.addSkill('圣_benghuai');
        player.awakenSkill('圣_juyi');
    },
            },
            "圣_wansha":{
                audio:"ext:混沌界:2",
                trigger:{
                    global:"dying",
                },
                priority:100,
                filter:function (event,player){
        return event.player!=player&&event.player.hp<=0;
    },
                check:function (event,player){
        return get.attitude(player,event.player)<0;
    },
                forced:true,
                content:function (){
        "step 0"
        if(trigger.source&&trigger.source!=player&&trigger.source.isAlive()){
            if(!trigger.source.countCards('h')) trigger.source.draw();
            if(!trigger.player.countCards('h')) trigger.player.draw();
            player.line(trigger.player);
            trigger.player.line(trigger.source);
            trigger.player.chooseToCompare(trigger.source);
        }
        "step 1"
        if(result.bool){
            trigger.player.die();
            trigger.source.die();
        }else{
            trigger.player.die();
        }
        "step 2"
        if(!trigger.source||trigger.source&&trigger.source==player){
            trigger.player.die();
        }
        "step 3"
        if(player.isDamaged()){
        player.recover();
        }
    },
            },
            "圣_weimu":{
                trigger:{
                    target:"useCardToBefore",
                },
                forced:true,
                priority:100,
                filter:function (event,player){
        return event.card&&
            get.color(event.card)=='black'&&
            event.player!=player;
    },
                content:function (){
        "step 0"
        player.gain(trigger.cards);
        player.$gain2(trigger.cards);
        "step 1"
        trigger.cancel();
    },
            },
            "圣_luanwu":{
                audio:"ext:混沌界:2",
                unique:true,
                enable:"phaseUse",
                limited:true,
                locked:true,
                selectCard:true,
                skillAnimation:"epic",
                animationColor:"thunder",
                filter:function (event,player){
        return !player.hasSkill('圣_luanwu_mark')&&
            player.countCards('h',{name:'sha'});
    },
                filterCard:function (card){
        return get.name(card)=='sha';
    },
                filterTarget:function (card,player,target){
        return target!=player;
    },
                selectTarget:-1,
                multitarget:true,
                multiline:true,
                content:function (){
        "step 0"
        player.addSkill('圣_luanwu_damage');
        "step 1"
        event.current=player.next;
        event.currented=[];
        "step 2"
        event.currented.push(event.current);
        event.current.animate('target');
        event.current.chooseToUse('乱武','<li>使用：对相邻角色一张【杀】<li>取消：失去一点体力',{name:'sha'},function(card,player,target){
            if(player==target) return false;
            if(!player.canUse('sha',target)) return false;
            if(get.distance(player,target)<=1) return true;
            if(game.hasPlayer(function(current){
                return current!=player&&get.distance(player,current)<get.distance(player,target);
            })){
                return false;
            }
            return true;
        });
        "step 3"
        if(result.bool==false){
            event.current.loseHp();
            player.storage.圣_luanwu_damage_loseHp++;
            player.syncStorage('圣_luanwu_damage_loseHp');
        }
        event.current=event.current.next;
        if(event.current!=player&&!event.currented.contains(event.current)){
            game.delay(0.5);
            event.goto(2);
        }
        "step 4"
        if(player.storage.圣_luanwu_damage_draw>player.storage.圣_luanwu_damage_loseHp){
            player.awakenSkill('圣_luanwu');
            player.removeSkill('圣_luanwu_damage');
        }else{
            player.removeSkill('圣_luanwu_damage');
            player.addTempSkill('圣_luanwu_mark');
        }
    },
                ai:{
                    order:1,
                    result:{
                        player:1,
                    },
                },
                mark:true,
                intro:{
                    content:"limited",
                },
                init:function (player,skill){
        player.storage[skill]=false;
    },
                subSkill:{
                    mark:{
                        sub:true,
                    },
                    damage:{
                    onremove:function (player){
                    player.storage.圣_luanwu_damage_draw=0;
                    player.storage.圣_luanwu_damage_loseHp=0;
                    },
                        init:function (player){
        player.storage.圣_luanwu_damage_draw=0;
        player.storage.圣_luanwu_damage_loseHp=0;
    },
                        trigger:{
                            global:"damageEnd",
                        },
                        forced:true,
                        direct:true,
                        filter:function (event,player){
                return event.source&&event.source.countCards('he');
            },
                        content:function (){
        "step 0"
        player.line(trigger.source);
        trigger.source.chooseCard('交给'+get.translation(player)+'一张牌','he',true).set('ai',function(card){
            var evt=_status.event.getParent();
            if(get.attitude(_status.event.player,evt.player)>2){
                if(card.name=='jiu') return 120;
                if(card.name=='tao') return 110;
            }
            return 100-get.value(card);
        });
        "step 1"
        if(result.bool&&result.cards&&result.cards.length){
            trigger.source.line(player);
            player.gain(result.cards,trigger.source,'giveAuto');
            player.storage.圣_luanwu_damage_draw++;
            player.syncStorage('圣_luanwu_damage_draw');
        }
    },
                        sub:true,
                    },
                },
            },
            "圣_yuhua":{
                mod:{
                    ignoredHandcard:function (card,player){
            if(get.type(card)!='basic'){
                return true;
            }
        },
                },
            },
            "圣_xianchen":{
                audio:"ext:混沌界:2",
                trigger:{
                    player:"phaseEnd",
                },
                direct:true,
                forced:true,
                filter:function (event,player){
        return player.countCards('h');
    },
                subSkill:{
                    mark:{
                        sub:true,
                    },
                },
                content:function (){
        'step 0'
        var list=['wuzhong','taoyuan','wugu','nanman','wanjian','guohe','shunshou','zhuge','bagua','chitu','dilu','muniu'];
        for(var i=0;i<list.length;i++){
            list[i]=[get.type(list[i]),'',list[i]];
        }
        player.chooseButton([get.prompt2('圣_xianchen'),[list,'vcard']]).set('ai',function(button){
            return Math.random();
        });
        'step 1'
        if(result.bool){
            player.logSkill('圣_xianchen');
            var name=result.links[0][2];
            event.cardname=name;
        if(!player.hasSkill('圣_xianchen_mark')){
            player.showHandcards();
            player.discard(player.getCards('h',{type:'basic'}),Infinity,true);
            player.addSkill('圣_xianchen_mark');
        }else{
            event.goto(3);
        }
        }
        else{
            if(player.hasSkill('圣_xianchen_mark')){
            player.removeSkill('圣_xianchen_mark');
            }
            event.finish();
        }
        'step 2'
        if(result.bool){
        game.delay(2);
        }
        'step 3'
        if(result.bool){
        player.judge(function(card){
          if(get.suit(card)=='heart') return 4;
              return -4;
         });
        }
        'step 4'
        if(result.bool==true){
            player.gain(game.createCard(event.cardname),'gain2');
            event.goto(0);
        }else{
           player.loseHp();
           if(player.hasSkill('圣_xianchen_mark')){
            player.removeSkill('圣_xianchen_mark');
            }
        }
        'step 5'
        var cards=[];
    for(var i=0;i<ui.cardPile.childNodes.length;i++){
    if(get.suit(ui.cardPile.childNodes[i])=='heart'){
    cards=cards.concat(ui.cardPile.childNodes[i]);
}
}
if(cards.length){
    var card=cards.randomGet();
    player.gain(card,'gain2');
}
    },
            },
            "圣_qirang":{
                audio:"ext:混沌界:3",
                enable:"phaseUse",
                locked:true,
                filter:function (event,player){
        return !player.hasSkill('圣_qirang_end')&&
        player.countCards('h',{type:'basic'})<player.countCards('he');
    },
                filterCard:function (card){
        return get.type(card)!='basic';
    },
                selectCard:true,
                position:"he",
                discard:false,
                content:function (){
       'step 0'
        if(get.type(cards[0],'trick')=='trick'&&get.type(cards[0],'delay')!='delay'){
            player.addMark('_混沌_圣神_圣甲',true);
            if(!player.hasSkill('圣_qirang_trick')){
            player.addTempSkill('圣_qirang_trick');
            }else{
            player.addTempSkill('圣_qirang_end');
            }
            var e=get.inpile('equip');
        player.gain(game.createCard(e.randomGet()),'draw')
        }
        'step 1'
        if(get.type(cards[0],'equip')=='equip'){
            player.addMark('_混沌_圣神_圣甲',true);
            if(!player.hasSkill('圣_qirang_equip')){
            player.addTempSkill('圣_qirang_equip');
            }else{
            player.addTempSkill('圣_qirang_end');
            }
        var d=get.inpile('delay');
        player.gain(game.createCard(d.randomGet()),'draw')
        }
        'step 2'
        if(get.type(cards[0],'delay')=='delay'){
            player.addMark('_混沌_圣神_圣甲',true);
            if(!player.hasSkill('圣_qirang_delay')){
            player.addTempSkill('圣_qirang_delay');
            }else{
             player.addTempSkill('圣_qirang_end');
            }
           var t=get.inpile('trick');
        player.gain(game.createCard(t.randomGet()),'draw')
        }
        'step 3'
        game.log(player,'将',cards,'置于了牌堆顶');
        ui.cardPile.insertBefore(cards.pop(),ui.cardPile.firstChild);
    },
                subSkill:{
                    end:{
                    },
                    trick:{
                    },
                    equip:{
                    },
                    delay:{
                    },
                },
            },
            "圣_longying":{
                group:["圣_longying1","圣_longying2","圣_longying3","圣_longying4"],
                ai:{
					skillTagFilter:function (player,tag){
						switch(tag){
							case 'respondSha':{
								if(player.countCards('he',{suit:'diamond'})<1) return false;
								break;
							}
							case 'respondShan':{
								if(player.countCards('he',{suit:'club'})<1) return false;
								break;
							}
							case 'save':{
								if(player.countCards('he',{suit:'heart'})<1) return false;
								break;
							}
						}
					},
					save:true,
					respondSha:true,
					respondShan:true,
					effect:{
						target:function (card,player,target){
							if(get.tag(card,'recover')&&target.hp>=1) return [0,0];
							if(!target.hasFriend()) return;
							if((get.tag(card,'damage')==1||get.tag(card,'loseHp'))&&target.hp>1) return [0,1];
						}
					},
					threaten:function (player,target){
						if(target.hp==1) return 2;
						return 0.5;
					},
				}
            },
            "圣_longying1":{
            audio:"ext:混沌界:2",
                enable:["chooseToRespond","chooseToUse"],
                filterCard:function (card,player){
        return get.suit(card)=='diamond';
    },
                selectCard:true,
                locked:true,
                position:"he",
                viewAs:{
                    name:"sha",
                    nature:"fire",
                    suit:"diamond",
                    number:7,
                    cards:[{"node":{"image":{},"info":{},"name":{},"name2":{},"background":{},"intro":{},"range":{}},"storage":{},"vanishtag":[],"_uncheck":[],"suit":"diamond","number":7,"name":"sha","nature":"fire","cardid":"1013858366","_transform":"translateX(459px)","clone":{"name":"sha","suit":"diamond","number":7,"node":{"name":{},"info":{},"intro":{},"background":{},"image":{}},"_transitionEnded":true,"timeout":219},"timeout":175,"original":"h"}],
                },
                viewAsFilter:function (player){
       return player.countCards('he',{suit:'diamond'})>=1;
    },
                prompt:"将一张♦️牌当【火杀】使用或打出",
                check:function (card){return 4-get.value(card)},
                ai:{
                    basic:{
                        useful:[5,1],
                        value:[5,1],
                    },
                    order:function (){
            if(_status.event.player.hasSkillTag('presha',true,null,true)) return 10;
            return 3;
        },
                    result:{
                        target:function (player,target){
                if(player.hasSkill('jiu')&&!target.getEquip('baiyin')){
                    if(get.attitude(player,target)>0){
                        return -6;
                    }
                    else{
                        return -3;
                    }
                }
                return -1.5;
            },
                    },
                    tag:{
                        respond:true,
                        respondSha:true,
                        respondShan:true,
                        damage:function (card){
                if(card.nature=='poison') return;
                return 1;
            },
                        natureDamage:function (card){
                if(card.nature) return 1;
            },
                        fireDamage:function (card,nature){
                if(card.nature=='fire') return 1;
            },
                        thunderDamage:function (card,nature){
                if(card.nature=='thunder') return 1;
            },
                        poisonDamage:function (card,nature){
                if(card.nature=='poison') return 1;
            },
                    },
                },
            },
            "圣_longying2":{
                audio:"ext:混沌界:2",
                enable:["chooseToUse","chooseToRespond"],
                filterCard:function (card){
        return get.suit(card)=='heart';
    },
                locked:true,
                position:"he",
                selectCard:true,
                viewAs:{
                    name:"tao",
                    suit:"heart",
                    number:8,
                    cards:[{"node":{"image":{},"info":{},"name":{},"name2":{},"background":{},"intro":{},"range":{}},"storage":{},"vanishtag":[],"_uncheck":[],"suit":"heart","number":8,"name":"shan","cardid":"6557578367","_transform":"translateX(437.14285714285717px)","clone":{"name":"shan","suit":"heart","number":8,"node":{"name":{},"info":{},"intro":{},"background":{},"image":{}},"_transitionEnded":true,"timeout":274},"timeout":257,"original":"h"}],
                },
                viewAsFilter:function (player){
        return player.countCards('he',{suit:'heart'})>=1;
    },
                check:function (card){
        if(_status.event.type=='dying') return 1;
        return 4-get.value(card);
    },
                prompt:"将一张♥️牌当做【桃】使用",
                ai:{
                    basic:{
                        order:function (card,player){
                if(player.hasSkillTag('pretao')) return 5;
                return 2;
            },
                        useful:[8,6.5,5,4],
                        value:[8,6.5,5,4],
                    },
                    result:{
                        target:function (player,target){
                // if(player==target&&player.hp<=0) return 2;
                var nd=player.needsToDiscard();
                var keep=false;
                if(nd<=0){
                    keep=true;
                }
                else if(nd==1&&target.hp>=2&&target.countCards('h','tao')<=1){
                    keep=true;
                }
                var mode=get.mode();
                if(target.hp>=2&&keep&&target.hasFriend()){
                    if(target.hp>2||nd==0) return 0;
                    if(target.hp==2){
                        if(game.hasPlayer(function(current){
                            if(target!=current&&get.attitude(target,current)>=3){
                                if(current.hp<=1) return true;
                                if((mode=='identity'||mode=='versus'||mode=='chess')&&current.identity=='zhu'&&current.hp<=2) return true;
                            }
                        })){
                            return 0;
                        }
                    }
                }
                if(target.hp<0&&target!=player&&target.identity!='zhu') return 0;
                var att=get.attitude(player,target);
                if(att<3&&att>=0&&player!=target) return 0;
                var tri=_status.event.getTrigger();
                if(mode=='identity'&&player.identity=='fan'&&target.identity=='fan'){
                    if(tri&&tri.name=='dying'&&tri.source&&tri.source.identity=='fan'&&tri.source!=target){
                        var num=game.countPlayer(function(current){
                            if(current.identity=='fan'){
                                return current.countCards('h','tao');
                            }
                        });
                        if(num>1&&player==target) return 2;
                        return 0;
                    }
                }
                if(mode=='identity'&&player.identity=='zhu'&&target.identity=='nei'){
                    if(tri&&tri.name=='dying'&&tri.source&&tri.source.identity=='zhong'){
                        return 0;
                    }
                }
                if(mode=='stone'&&target.isMin()&&
                player!=target&&tri&&tri.name=='dying'&&player.side==target.side&&
                tri.source!=target.getEnemy()){
                    return 0;
                }
                return 2;
            },
                    },
                    tag:{
                        respondTao:true,
                        respond:true,
                        recover:1,
                        save:1,
                    },
                },
            },
            "圣_longying3":{
                audio:"ext:混沌界:2",
                enable:"chooseToUse",
                filterCard:function (card){
        return get.suit(card)=='spade';
    },
                locked:true,
                position:"he",
                selectCard:true,
                viewAsFilter:function (player){
        return player.countCards('he',{suit:'spade'})>=1;
    },
                viewAs:{
                    name:"wuxie",
                    suit:"spade",
                    number:2,
                    cards:[{"node":{"image":{},"info":{},"name":{},"name2":{},"background":{},"intro":{},"range":{}},"storage":{},"vanishtag":[],"_uncheck":[],"suit":"spade","number":2,"name":"cixiong","cardid":"9263726365","clone":{"name":"cixiong","suit":"spade","number":2,"node":{"name":{},"info":{},"intro":{},"background":{},"image":{}},"_transitionEnded":true,"timeout":1861},"timeout":1828,"original":"h"}],
                },
                prompt:"将一张♠️卡牌当做【无懈可击】使用",
                check:function (card){return 8-get.value(card)},
                threaten:1.2,
                ai:{
                    tag:{
                    respond:true,
                    respondWuxie:true,
                    },
                    basic:{
                        useful:[6,4],
                        value:[6,4],
                    },
                    result:{
                        player:1,
                    },
                    expose:0.2,
                },
            },
            "圣_longying4":{
                audio:"ext:混沌界:2",
                enable:["chooseToUse","chooseToRespond"],
                prompt:function (){
        return '将一张♣️牌当作【闪】使用';
    },
                position:"he",
                selectCard:true,
                locked:true,
                check:function (card){return 8-get.value(card)},
                viewAs:{
                    name:"shan",
                    suit:"club",
                    number:5,
                },
                filterCard:function (card){
        return get.suit(card)=='club';
    },
                viewAsFilter:function (player){
        return player.countCards('he',{suit:'club'})>=1;
    },
                ai:{
                tag:{
                respond:true,
                respondShan:1,
                },
                    basic:{
                        useful:[7,2],
                        value:[7,2],
                    },
                },
            },
            "圣_nijing":{
                mod:{
                    maxHandcard:function (player,num){
            return num+=num+2;
        },
                },
                audio:"ext:混沌界:2",
                trigger:{
                    player:"phaseDrawBegin",
                },
                priority:-1,
                forced:true,
                filter:function (event,player){
                return player.hp>1;
                },
                content:function (){
                "step 0"
            trigger.num+=player.hp-1;
                "step 1"
            player.loseHp(player.hp-1);
    },
            },
            "圣_longhun":{
                trigger:{
                    player:"dyingBegin",
                },
                forced:true,
                priority:100,
                filter:function (event,player){
        return player.hp<=0;
    },
                content:function (){
            player.draw(player.maxHp-player.hp-1);
    },
    group:"圣_longhun_recover",
    subSkill:{
    recover:{
    trigger:{
    player:"recoverAfter",
    },
    forced:true,
    priority:-1,
    filter:function (event,player){
    return player.hp==1;
    },
    content:function (){
    player.draw(player.maxHp-player.hp-1);
    },
    },
    },
            },
            "圣_shenxian":{
                trigger:{
                    global:"discardAfter",
                },
                filter:function (event,player){
        if(event.player==player||_status.currentPhase==player) return false;
        for(var i=0;i<event.cards.length;i++){
        if(get.type(event.cards[i])=='basic'&&event.cards[i].isInPile()) return true;
        }
        return false;
    },
                priority:-1,
                forced:true,
                content:function (){
                "step 0"
                player.$gain2(trigger.cards);
                "step 1"
                game.delay();
                player.gain(trigger.cards);
    },
                ai:{
                    threaten:1.5,
                },
            },
            "圣_luange":{
                audio:"ext:混沌界:2",
                trigger:{
                    player:"phaseBegin",
                },
                forced:true,
                direct:true,
                priority:-1,
                filter:function (event,player){
        return player.countCards('h');
    },
                content:function (){
        "step 0"
        player.chooseCardTarget({
            position:'h',
            filterCard:true,
            selectCard:true,
            filterTarget:function (card,player,target){
                return target!=player;
            },
            prompt:get.prompt('圣_luange'),
            prompt2:"跳过摸牌阶段并将一张手牌交给一名其他角色，然后每当你于本回合内对其使用的【杀】被闪避后可触发额外效果",
        });
        "step 1"
        if(result.bool){
            player.logSkill('圣_luange');
            player.skip('phaseDraw');
            result.targets[0].gain(result.cards,player,'giveAuto');
            result.targets[0].addTempSkill('圣_luange_mark');
        }else{
        event.finish();
        }
    },
                group:"圣_luange_buff",
                subSkill:{
                    mark:{
                        mark:true,
                        marktext:"枪",
                        intro:{
                            content:"神星彩对该角色使用的【杀】被闪避后可触发额外效果",
                        },
                        sub:true,
                    },
                    buff:{
                        trigger:{
                            player:"shaMiss",
                        },
                        forced:true,
                        filter:function (event,player){
                return event.target.hasSkill('圣_luange_mark')&&
                    player.hasSkill('圣_qiangwu_mark')||
                    player.hasSkill('圣_qiangwu_king');
            },
                        content:function (){
                "step 0"
                if(player.hasSkill('圣_qiangwu_mark')){
                    player.removeSkill('圣_qiangwu_mark');
                    }
                 if(player.hasSkill('圣_qiangwu_king')){
                    player.removeSkill('圣_qiangwu_king');
                    }
                "step 1"
                player.useCard({name:"sha"},trigger.target,false);
            },
                        sub:true,
                    },
                },
            },
            "圣_qiangwu":{
                audio:"ext:混沌界:2",
                enable:"phaseUse",
                locked:true,
                filter:function (event,player){
        return !player.hasSkill('圣_qiangwu_mark')&&
        !player.hasSkill('圣_qiangwu_king');
    },
                content:function (){
        "step 0"
        player.judge(function(card){
            if(get.number(card)>1&&get.number(card)<13) return -6;
            return 0;
        })
        "step 1"
        if(result.bool==false){
        player.addTempSkill('圣_qiangwu_mark');
        player.storage.圣_qiangwu_mark=result.number;
        game.log(player,'于本回合内使用点数比',player.storage.圣_qiangwu_mark,'小的【杀】无距离限制；使用点数于',player.storage.圣_qiangwu_mark,'相等的【杀】不可被闪避；使用点数比',player.storage.圣_qiangwu_mark,'大的【杀】无次数限制')
        }else{
        player.addTempSkill('圣_qiangwu_king');
        game.log(player,'于本回合内使用【杀】时无距离与次数限制且不可闪避');
        }
    },
                ai:{
                    result:{
                        player:1,
                    },
                    order:11,
                },
                subSkill:{
                has:{
                trigger:{
                player:"phaseEnd",
                },
                forced:true,
                direct:true,
                content:function (){
                player.removeSkill('圣_qiangwu_has');
                },
                sub:true,
                },
                    mark:{
                        mark:true,
                        marktext:"枪",
                        group:["圣_qiangwu_small","圣_qiangwu_same","圣_qiangwu_big"],
                        onremove:function (player){
        player.storage.圣_qiangwu_mark=0;
    },
                        init:function (player){
        player.storage.圣_qiangwu_mark=0;
    },
                        intro:{
                            content:"☆当前的技能判定点数为#；</br></br>★每当你使用【杀】时，若此【杀】的点数：<li>小于#：此【杀】无视距离且会率先掠夺目标角色装备区内的防具牌<li>等于#：此【杀】不可闪避且会使你恢复等量体力值<li>大于#：此【杀】不计入出牌次数限制且可造成的伤害量+1",
                        },
                        mod:{
                            aiOrder:function (player,card,num){
            if(card.name=='sha'&&card.number>player.storage.圣_qiangwu_mark) return num+2;
        },
                            targetInRange:function (card,player){
            if(_status.currentPhase==player&&card.name=='sha'&&card.number<player.storage.圣_qiangwu_mark) return true;
        },
                            cardUsable:function (card,player){
            if(_status.currentPhase==player&&card.name=='sha'&&card.number>player.storage.圣_qiangwu_mark) return Infinity;
        },
                        },
                        sub:true,
                    },
                    small:{
                        trigger:{
                            player:"useCardToPlayered",
                        },
                        forced:true,
                        filter:function (event,player){
        return event.card.name=='sha'&&
            event.card.number<player.storage.圣_qiangwu_mark&&
            event.target.getCards('e',{subtype:'equip2'}).length>0;
    },
                        content:function (){
        player.gain(trigger.target.getEquip(2),trigger.target,'give',true);
    },
                        sub:true,
                    },
                    same:{
                        trigger:{
                            player:"useCardToPlayered",
                        },
                        filter:function (event,player){
        return event.card.name=='sha'&&
            event.card.number==player.storage.圣_qiangwu_mark;
    },
                        forced:true,
                        content:function (){
        "step 0"
        trigger.getParent().directHit.add(trigger.target);
        "step 1"
        player.recover();
    },
                        sub:true,
                    },
                    big:{
                        trigger:{
                            player:"useCard",
                        },
                        forced:true,
                        priority:-1,
                        filter:function (event,player){
        return event.card.name=='sha'&&
            event.card.number>player.storage.圣_qiangwu_mark;
    },
                        content:function (){
       if(!trigger.baseDamage) trigger.baseDamage=1;
        trigger.baseDamage+=1;
    },
                        sub:true,
                    },
                    king:{
                        mark:true,
                        marktext:"枪",
                        intro:{
                            content:"你于本回合内使用【杀】无距离与次数限制且不可闪避",
                        },
                        mod:{
                            targetInRange:function (card,player){
            if(card.name=='sha') return true;
        },
                            cardUsable:function (card,player,num){
            if(card.name=='sha') return Infinity;
        },
                        },
                        trigger:{
                            player:"useCardToPlayered",
                        },
                        filter:function (event,player){
                          return event.card.name=='sha';
    },
                        forced:true,
                        content:function (){
        trigger.getParent().directHit.add(trigger.target);
    },
                        sub:true,
                    },
                },
            },
            "圣_shensu":{
                audio:"ext:混沌界:2",
                trigger:{
                    player:["phaseBegin","phaseUseBegin","phaseEnd"],
                },
                forced:true,
                direct:true,
                content:function (){
        "step 0"
        player.chooseTarget(get.prompt2('圣_shensu'),function(card,player,target){
            if(target.isFriendOf(player)) return false;
            return lib.filter.targetEnabled({name:'sha'},player,target);
        }).ai=function(target){
            return get.effect(target,{name:'sha'},player);
        }
        "step 1"
        if(result.bool){
            player.logSkill('圣_shensu');
            player.useCard({name:'sha'},result.targets,false);
        }
    },
                ai:{
                    expose:0.2,
                    threaten:1.3,
                },
            },
            "圣_leili":{
                mod:{
                    cardEnabled:function (card,player){
            if(card.name=='sha'&&_status.currentPhase==player&&
                _status.event.getParent('phaseUse')){
                return false;
            }
        },
                },
                enable:"phaseUse",
                filter:function (event,player){
        return player.countCards('h','sha')>0;
    },
                filterCard:{
                    name:"sha",
                },
                prepare:function (cards,player){
        player.$throw(cards,1000);
    },
                discard:false,
                delay:0.5,
                content:function (){
        "step 0"
        player.draw();
        "step 1"
        for(var i=0;i<cards.length;i++){
            cards[i].discard();
        }
      },
                ai:{
                    basic:{
                        order:1,
                    },
                    result:{
                        player:1,
                    },
                },
            },
            "圣_jixi":{
                audio:"ext:混沌界:2",
                trigger:{
                    global:"damageAfter",
                },
                filter:function (event,player){
        return _status.currentPhase!=player&&
        event.player!=player&&event.source&&
        event.source!=player&&event.player.isAlive();
    },
                check:function (event,player){
      return get.attitude(player,event.player)<0;
      },
                priority:-1,
                locked:true,
                prompt2:function (event,player){
                return '是否发动【疾袭】？','锁定技，每当一名其他角色（'+get.translation(event.player)+'）于你的回合外受到伤害后，若伤害来源不为你，你可以对其造成一点雷属性伤害。若如此做，你将武将牌翻面';
                },
                content:function (){
            "step 0"
            player.line(trigger.player,'thunder');
            trigger.player.damage(player,'thunder',true);
            "step 1"
            player.turnOver();
    },
    ai:{
    expose:1,
    },
            },
            "圣_yishi":{
            mark:true,
                init:function (player){
        player.storage.圣_yishi=0;
    },
                intro:{
                    content:function (storage){
                        if(storage>0) return '<li>当前“棋盘”中已置入'+storage+'枚“弈”</br></br></br><盘中局，弈中离，苍生亦如棋；阴阳鼎，墨玉灵，相斥亦相卿---神郭嘉>';
                        if(storage<0) return '<li>当前“棋盘”中已置入'+storage+'枚“弈”</br></br></br><盘中局，弈中离，苍生亦如棋；阴阳鼎，墨玉灵，相斥亦相卿---神郭嘉>';
                        return '<li>当前“棋盘”中未置入任何“弈”</br></br></br><盘中局，弈中离，苍生亦如棋；阴阳鼎，墨玉灵，相斥亦相卿---神郭嘉>';
                    },
                },
                audio:"ext:混沌界:3",
                trigger:{
                    global:"useCardAfter",
                },
                locked:true,
                priority:-1,
                check:function (event,player){
      return player.hp>3&&player.storage.圣_yishi<4;
      },
                prompt2:function (event,card){
        return '是否发动【弈逝】？','锁定技，每当一名角色主动使用的锦囊牌（'+get.translation(event.card)+'）进入牌堆后，你可以将一枚“弈”置入“棋盘”并进行一次判定：若判定结果为黑色，你失去一点体力；若判定结果为红色，你获得此牌。若如此做，你即将受到的伤害均累计+X；当“棋盘”中的“弈”累计达到十枚或更多后，你立即死亡（X为“棋盘”中所拥有的“弈”数量）';
    },
                filter:function (event,player){
        if(get.type(event.card,'trick')!='trick') return false;
        if(event.cards){
						for(var i=0;i<event.cards.length;i++){
							if(event.cards[i].isInPile()) return true;
						}
					}
					return false;
    },
                content:function (){
        "step 0"
        player.storage.圣_yishi++;
        player.markSkill('圣_yishi');
        player.syncStorage('圣_yishi');
        "step 1"
         player.judge(function(card){
            if(get.color(card)=='black') return -1;
            return 1;
            });
        "step 2"
        if(result.color){
            if(result.color=='red'){
                player.gain(trigger.cards,'gain2');
            }
            else{
                player.loseHp();
            }
        }
    },
                group:["圣_yishi_die","圣_yishi_damage"],
                subSkill:{
                    damage:{
                        trigger:{
                            player:"damageBefore",
                        },
                        filter:function (event,player){
        return player.storage.圣_yishi>0;
    },
                        forced:true,
                        direct:true,
                        content:function (){
          trigger.num+=player.storage.圣_yishi;
    },
                        sub:true,
                    },
                    die:{
                        trigger:{
                            player:"judgeAfter",
                        },
                        filter:function (event,player){
        return player.storage.圣_yishi>=10;
    },
                        forced:true,
                        direct:true,
                        content:function (){
              player.die();
    },
                        sub:true,
                    },
                },
            },
            "圣_tiance":{
            audio:"ext:混沌界:3",
                trigger:{
                    player:["damageEnd","loseHpEnd"],
                },
                forced:true,
                direct:true,
                filter:function (event,player){
                return event.num>0;
                },
                content:function (){
        "step 0"
        player.chooseTarget(get.prompt2('圣_tiance')).set('ai',function(target){
            var player=_status.event.player;
            if(get.attitude(player,target)>0){
                return get.recoverEffect(target,player,player)+1;
            }
            return 0;
        });
        "step 1"
        if(result.bool){
            event.target=result.targets[0];
            player.logSkill('圣_tiance',event.target);
            if(player.hasSkill('圣_yishi')){
            if(!player.storage.圣_yishi){
            event.target.draw(player.maxHp-player.hp);
            }else{
            event.target.draw(player.maxHp-player.hp+player.storage.圣_yishi);
            }
            if(player.storage.圣_yishi&&player.storage.圣_yishi>event.target.maxHp-event.target.hp){
            event.target.chooseToDiscard('he',player.storage.圣_yishi-(event.target.maxHp-event.target.hp),true).set('ai',function(card){
            return 6-get.useful(card);
        });
            }
            }else{
            event.target.draw(player.maxHp-player.hp);
            }
        }
        "step 2"
        if(result.bool){
        if(event.target!=player&&event.target.isDamaged()&&result.cards.length>=2){
                event.target.recover();
            }
        if(event.target!=player&&result.cards.length>0&&result.cards.length<=player.countCards('h')){
                player.gain(result.cards,'gain2');
            }else{
                event.finish();
            }
            }
           "step 3"
         if(result.bool){
             if(player.countCards('h',{type:'trick'})>0){
                     player.chooseCard('h',{type:'trick'},[1,2],'是否交给'+get.translation(event.target)+'至多两张锦囊牌？');  
                 }
             else{
                 event.finish();
             }
         }
        "step 4"
        if(result.bool){
            player.logSkill('圣_tiance_mark',event.target);
            player.$give(result.cards.length,event.target);
            event.target.gain(result.cards,player);  
            if(player.storage.圣_yishi>0){
            player.storage.圣_yishi--;
            player.markSkill('圣_yishi');
            player.syncStorage('圣_yishi');
            }
        } 
    },
                ai:{
                    maixie:true,
                    "maixie_hp":true,
                    effect:{
                        target:function (card,player,target){
                if(get.tag(card,'damage')){
                    if(player.hasSkillTag('jueqing',false,target)) return [1,-2];
                    if(!target.hasFriend()) return;
                    var num=1;
                    if(get.attitude(player,target)>0){
                        if(player.needsToDiscard()){
                            num=0.7;
                        }
                        else{
                            num=0.5;
                        }
                    }
                    if(target.hp>=4) return [1,num*2];
                    if(target.hp==3) return [1,num*1.5];
                    if(target.hp==2) return [1,num*0.5];
                }
            },
                    },
                },
                subSkill:{
                mark:{
                audio:"ext:混沌界:2",
                unique:true,
                charlotte:true,
                },
                },
            },
            "圣_shenmou":{
                trigger:{
                    global:"judgeEnd",
                },
                direct:true,
                forced:true,
                priority:100,
                filter:function (event,player){
        if(get.owner(event.result.card)){
            return false;
        }
        if(event.nogain&&event.nogain(event.result.card)){
            return false;
        }
        return true;
    },
                content:function (){
        player.gain(game.createCard(trigger.result.card),'gain2');
    },
            },
            "圣_jigong":{
                audio:"ext:混沌界:2",
                enable:"phaseUse",
                usable:1,
                forced:true,
                content:function (){
        player.draw(game.countPlayer());
        player.addTempSkill('圣_jigong2');
        player.addTempSkill('圣_jigong2_damage');
    },
                ai:{
                    order:11,
                    result:{
                    player:1,
                    },
                },
            },
            "圣_jigong2":{
                mod:{
                    attackFrom:function (){
            return -Infinity;
        },
                    maxHandcard:function (player,num){
            var damage=player.getStat().damage;
            if(typeof damage=='number') return num-player.hp+damage;
            return 0;
        },
                },
                trigger:{
                    player:"phaseEnd",
                },
                forced:true,
                filter:function (event,player){
        return !player.getStat('damage');
    },
                content:function (){
        player.loseHp();
    },
                subSkill:{
                    damage:{
                        init:function (player){
        player.storage.圣_jigong2_damage=0;
    },
                        mark:true,
                        intro:{
                            content:"你最多可以保留#张手牌",
                        },
                        trigger:{
                            source:"damageAfter",
                        },
                        forced:true,
                        content:function (){
          player.storage.圣_jigong2_damage+=trigger.num;
          player.markSkill('圣_jigong2_damage');
        },
                        sub:true,
                    },
                },
            },
            "圣_shifei":{
                audio:"ext:混沌界:2",
                trigger:{
                player:['chooseToRespondBegin','chooseToUseBegin']
                },
                forced:true,
				filter:function (event,player){
					if(!_status.currentPhase) return false;
					if(event.responded) return false;
					if(!event.filterCard({name:'shan'},player,event)) return false;
					if(event.name!='chooseToUse'&&!lib.filter.cardRespondable({name:'shan'},player,event)) return false;
					return true;
				},
				check:function (event,player){
					if(get.attitude(player,_status.currentPhase)>0) return true;
					var nh=_status.currentPhase.countCards('h')+1;
					var players=game.filterPlayer();
					for(var i=0;i<players.length;i++){
						if(players[i].countCards('h')>nh){
							if(!player.hasShan()||get.attitude(player,players[i])<=0) return true;
						}
					}
					return false;
				},
                content:function (){
    "step 0"
    player.line(_status.currentPhase,'thunder');
    player.discardPlayerCard(_status.currentPhase,'hej',true);
    "step 1"
    player.chooseTarget(get.prompt('圣_shifei'),function(card,player,target){
            return player!=target
        });
        "step 2"
        if(result.bool){
            player.line(result.targets[0],'thunder');
            result.targets[0].draw();
            if(result.targets[0].countCards('h')>_status.currentPhase.countCards('h')){
            if(player.countCards('he')) player.chooseToDiscard('he',true).set('ai',function(card){
            return 6-get.useful(card);
        });
            trigger.untrigger();
            trigger.responded=true;
            trigger.result={bool:true,card:{name:'shan'}}
            }
        }
     },
            },
            "圣_dihui":{
                trigger:{
                    global:"phaseBegin",
                },
                direct:true,
                forced:true,
                filter:function (event,player){
        return event.player!=player;
    },
                content:function (){
        trigger.player.addTempSkill('圣_dihui_card');
    },
                subSkill:{
                    card:{
                        mod:{
                            maxHandcard:function (player,num){
                    return num-1;
                },
                        },
                        sub:true,
                    },
                },
            },
            "圣_jueqing":{
                audio:"ext:混沌界:2",
                trigger:{
                    global:["damageBegin","recoverBegin"],
                },
                forced:true,
                filter:function (event,player){
        return _status.currentPhase!=event.player&&
            event.player.countCards('h')&&
            event.player.hp>0;
    },
                content:function (){
        'step 0'
        trigger.cancel();
        'step 1'
        trigger.player.loseHp();
        'step 2'
        if(trigger.player.countCards('h')){
        trigger.player.showHandcards();
        }else{
        event.finish();
        }
        'step 3'
        if(trigger.player.countCards('h')){
        if(trigger.player.countCards('h',{color:"red"})){
        trigger.player.discard(trigger.player.getCards('h',{color:'red'}),Infinity,true);
        }else{
         if(trigger.player!=player){
        trigger.player.loseHp();
         }
        }
      }
    },
            },
            "圣_wuxin":{
                trigger:{
                    player:"recoverAfter",
                },
                forced:true,
                filter:function (event,player){
        return player.countCards('h');
    },
                content:function (){
        player.chooseToDiscard('h',Infinity,true);
    },
            },
            "圣_shangshi":{
                audio:"ext:混沌界:4",
                trigger:{
                    player:["loseAfter","damageAfter","loseHpAfter"],
                },
                forced:true,
                direct:true,
                priority:-1,
                filter:function (event,player){
        return player.isDamaged()&&
            player.countCards('h')<=player.getDamagedHp();
    },
                content:function (){
        'step 0'
        if(_status.currentPhase==player){
            player.logSkill('圣_shangshi');
            player.draw(player.getDamagedHp());
        }
        else{
            if(player.countCards('h')<player.getDamagedHp()){
            player.logSkill('圣_shangshi');
            player.drawTo(player.getDamagedHp());
            }
        }
    },
    ai:{
        maixie:true,
        "maixie_hp":true,
        threaten:0.8,
        effect:{
            target:function (card,player,target){
                if(get.tag(card,'damage')){
                    if(!target.hasFriend()) return;
                    if(target.hp>=4) return [0.5,get.tag(card,'damage')*2];
                }
            },
        },
    },
            },
            "圣_longyin":{
                audio:"ext:混沌界:2",
                trigger:{
                    global:"shaBegin",
                },
                forced:true,
                direct:true,
                filter:function (event,player){
        return event.target&&
            player.countCards('he')>0&&
            event.card.name=='sha'&&
            _status.currentPhase==event.player&&
            event.parent.parent.parent.name=='phaseUse';
    },
                content:function (){
        "step 0"
        var go=false;
        if(get.attitude(player,trigger.player)>0){
                go=true;
        }
        if(trigger.player!=player){
        var next=player.chooseToDiscard(get.prompt('longyin'),'弃置一张牌并与'+get.translation(trigger.player)+'一同摸一张牌，然后令其本次使用的【杀】不计入使用次数','he');
        }else{
        var next=player.chooseToDiscard(get.prompt('longyin'),'弃置一张牌并摸一张牌，然后令你本次使用的【杀】不计入使用次数','he');
        }
        next.logSkill=['圣_longyin',trigger.player];
        next.set('ai',function(card){
            if(_status.event.go){
                return 6-get.value(card);
            }
            return 0;
        });
        next.set('go',go);
        "step 1"
        if(result.bool){
        trigger.player.getStat().card.sha--;
          }
        "step 2"
        if(result.bool){
            if(trigger.player!=player){
                trigger.player.draw();
                player.draw();
            }else{
                player.draw();
            }
            player.storage.圣_longyix++;
            player.markSkill('圣_longyix');
            player.syncStorage('圣_longyix');
        }
    },
                ai:{
                    expose:0.2,
                },
            },
            "圣_rongzheng":{
                audio:"ext:混沌界:2",
                trigger:{
                    global:"damageBegin",
                },
                locked:true,
                priority:100,
                check:function (event,player){
      return get.attitude(player,event.player)>0&&
                  player.hp>2;
      },
                filter:function (event,player){
        return event.source&&event.source!=player&&
            event.card&&event.card.name=='sha'&&event.player!=player&&
            player.storage.圣_longyix>0;
    },
                content:function (){
                "step 0"
            player.storage.圣_longyix--;
            player.markSkill('圣_longyix');
            player.syncStorage('圣_longyix');
            "step 1"
            trigger.cancel();
            "step 2"
            player.draw();
            trigger.source.useCard({name:'sha'},player);
    },
                ai:{
                    threaten:1.2,
                    expose:1,
                },
            },
            "圣_longyix":{
            marktext:"龙",
                intro:{
                    content:"你当前持有#枚“龙义”印记",
                },
                init:function (player){
        player.storage.圣_longyix=1;
        player.markSkill('圣_longyix');
        player.syncStorage('圣_longyix');
    },
                trigger:{
                    global:"gameStart",
                },
                forced:true,
                priority:100,
                content:function (){
        game.log(player,'获得了一枚“龙义”印记')
    },
                ai:{
                },
            },
            "圣_niepan":{
                skillAnimation:"epic",
                animationColor:"fire",
                audio:"ext:混沌界:2",
                trigger:{
                player:"dying",
                },
                locked:true,
                unique:true,
                priority:100,
                check:function (event,player){
      return player.countCards('h',{name:"tao"})+player.countCards('h',{name:"jiu"})<1-player.hp;
      },
                content:function (){
        "step 0"
        player.chooseToDiscard('j',Infinity,true);
        player.link(false);
        player.turnOver(false);
        player.unMad();
        player.enableEquip(1);
        player.enableEquip(2);
        player.enableEquip(3);
        player.enableEquip(4);
        player.enableEquip(5);
        "step 1"
        player.awakenSkill('圣_niepan');
        player.recover(player.maxHp-player.hp);
        "step 2"
        player.chooseToDiscard('hej',true,Infinity);
        player.draw(4);
    },
            },
            "圣_tianyu":{
                trigger:{
                    player:"phaseEnd",
                },
                forced:true,
                priority:100,
                filter:function (event,player){
        return game.hasPlayer(function(current){
            return current!=player&&!current.isLinked();
        });
    },
                content:function (){
       var enemies=player.getEnemies();
         if(enemies.length){
             var target=enemies.randomGet();
             player.line(target);
             target.addExpose(0.1);
             target.link(true);
         }
    },
                group:"圣_tianyu_link",
                subSkill:{
                    link:{
                        trigger:{
                            player:"linkBefore",
                        },
                        priority:100,
                        forced:true,
                        filter:function (event,player){
        return !player.isLinked();
    },
                        content:function (){
        trigger.cancel();
        game.log(player,'无法被横置');
    },
                        sub:true,
                    },
                },
            },
            "圣_huanyu":{
                audio:"ext:混沌界:2",
                enable:"phaseUse",
                usable:1,
                locked:true,
                filter:function (event,player){
        return player.countCards('he',{suit:'club'})>0;
    },
                filterTarget:true,
                selectTarget:function (){
                 return [1,3];
    },
                position:"he",
                filterCard:{
                    suit:"club",
                },
                check:function (card){
        return 8-get.value(card);
    },
                multitarget:true,
                multiline:true,
                line:true,
                content:function (){
        "step 0"
        event.delay=false;
        for(var i=0;i<targets.length;i++){
            if(!targets[i].isLinked()){
                targets[i].link(true);
                event.delay=true;
            }
            else{
                targets[i].link(false);
                event.finish();
            }
        }
         "step 1"
          player.chooseControl('焱凤燎原','霆凤风暴','cancel').set('ai',function(event,player){
							if(player.isDamaged()) return 0;
							if(!player.isDamaged()) return 1;
							return 0;
						}).set('prompt','请选择一项');
        "step 2"
        if(result.index==0){
            player.line(target,'fire');
            target.damage('fire');
            player.recover();
        }
        if(result.index==1){
            player.line(target,'thunder');
            target.damage('thunder');
            player.draw(2);
        }
        if(result.index==2){
        trigger.cancel();
        }
        "step 3"
        if(event.delay){
            game.delay();
        }
    },
                ai:{
                    threaten:1.5,
                    order:10,
                    result:{
                        target:function (player,target){
                var eff=get.damageEffect(target,player,target,'fire');
                if(target.isLinked()){
                    return eff/10;
                }
                else{
                    return eff;
                }
            },
                    },
                },
            },
           "圣_caishi":{
                audio:"ext:混沌界:2",
                trigger:{
                    player:"phaseDrawBegin",
                },
                forced:true,
                direct:true,
                content:function (){
        "step 0"
       player.chooseControl('谦敛','文论','墨尘','cancel2').set('prompt','【才识】：请选择一项效果并执行').set('prompt2','<li>〖谦敛〗：少摸一张牌。若如此做，每当你于本回合内发动〖忠鉴〗时可以额外展示自己的一张牌；<li>〖文论〗：手牌上限-1。若如此做，每当你于本回合内发动〖忠鉴〗时可以额外展示对方的一张牌；<li>〖墨尘〗：额外摸两张牌，若如此做，你于本回合内不能发动〖忠鉴〗，手牌上限+2且使用牌时仅可指定其他角色或自己为目标(单选)；').set('ai',function(event){
            switch(Math.floor(Math.random()*6)){
                case 0:return '谦敛';
                case 1:case 4:case 5:return '文论';
                case 2:return '墨尘';
            }
        });
        "step 1"
        if(result.index==0){
            player.logSkill('圣_caishi_qianlian');
            trigger.num--;
            player.addTempSkill('圣_caishi_qianlian');
            game.log(player,'选择了','#g〖谦敛〗','，每当',player,'于本回合内发动技能','#g【忠鉴】','时可以额外展示自己的一张牌');
            event.finish();
        }
        if(result.index==1){
            player.logSkill('圣_caishi_wenlun');
            player.storage.圣_zhongjian--; 
            player.markSkill('圣_zhongjian');
            player.syncStorage('圣_zhongjian');
            player.addTempSkill('圣_caishi_wenlun');
            game.log(player,'选择了','#g〖文论〗','，每当',player,'于本回合内发动技能','#g【忠鉴】','时可以额外展示目标的一张牌');
            event.finish();
        }
        if(result.index==2){
        player.logSkill('圣_caishi_mochen');
        trigger.num+=2; 
        player.storage.圣_zhongjian+=2;
        player.markSkill('圣_zhongjian');
        player.syncStorage('圣_zhongjian');
        player.addTempSkill('圣_zhongjian_delay');
        }
        if(result.index==3){
         event.finish();
        }
        "step 2"
        player.chooseControlList(['本回合内使用牌仅可指定自己为目标','本回合内使用牌仅可指定其他角色为目标'],true);
        "step 3"
        if(result.index==0){
            player.addTempSkill('圣_caishi_player');
            game.log(player,'选择了','#g〖墨尘〗','，',player,'于本回合内无法发动技能','#g【忠鉴】','且使用牌仅可指定自己为目标');
        }
        if(result.index==1){
            player.addTempSkill('圣_caishi_target');
            game.log(player,'选择了','#g〖墨尘〗','，',player,'于本回合内无法发动技能','#g【忠鉴】','且使用牌仅可指定其他角色为目标');
        }
    },
                subSkill:{
                    qianlian:{
                        audio:"ext:混沌界:2",
                        sub:true,
                    },
                    wenlun:{
                        audio:"ext:混沌界:2",
                        sub:true,
                    },
                    mochen:{
                        audio:"ext:混沌界:2",
                    },
                    player:{
                        mod:{
                            playerEnabled:function (card,player,target){
                    if(player!=target) return false;
                },
                        },
                        sub:true,
                    },
                    target:{
                        mod:{
                            playerEnabled:function (card,player,target){
                    if(player==target) return false;
                },
                        },
                        sub:true,
                    },
                },
            },
            "圣_zhongjian":{
                audio:"ext:混沌界:2",
                enable:"phaseUse",
                locked:true,
                filter:function (event,player){
        if(!player.countCards('h')) return false;
        return game.hasPlayer(function(current){
            return current!=player&&current.countCards('h')!=current.hp&&current.countCards('h')>0;
        })&&!player.hasSkill('圣_zhongjian_delay');
    },
                filterCard:true,
                selectCard:function (){
        return _status.event.player.hasSkill('圣_caishi_qianlian')?[1,2]:[1,1];
    },
                check:function (){
        return Math.random();
    },
                discard:false,
                lose:false,
                filterTarget:function (card,player,target){
        return target!=player&&target.countCards('h')!=target.hp&&target.countCards('h')>0;
    },
                content:function (){
        "step 0"
        player.showCards(cards);
        if(!target.hasSkill('圣_zhongjian_damage')){
            target.addTempSkill('圣_zhongjian_damage',{player:"phaseEnd"});
        }
        "step 1"
        if(target.countCards('h')>target.hp){
        if(target.countCards('h')-target.hp>=2){
        var num=target.countCards('h')-target.hp;
        }else{
        if(target.countCards('h')>2){
        var num=2;}else{
        var num=target.countCards('h');}
        }}else{
            if(target.hp-target.countCards('h')>=2){
        var num=target.hp-target.countCards('h');
        }else{
        if(target.hp>2){
        var num=2;}else{
        var num=target.hp;}
        }
        }
        if(num<=0){
            event.finish();
            return;
        }
        if(player.hasSkill('圣_caishi_wenlun')){
            var hs=target.getCards('h').randomGets(num+1);
        }else{
            var hs=target.getCards('h').randomGets(num);
        }
        target.showCards(hs);
        var suits=[];
        var colors=[];
        var numbers=[];
        for(var i=0;i<cards.length;i++){
            suits.add(get.suit(cards[i]));
            colors.add(get.color(cards[i]));
            numbers.add(get.number(cards[i]));
        }
        event.bool1=false;
        event.bool2=false;
        event.bool3=false;
        for(var i=0;i<hs.length;i++){
            if(!event.bool1&&colors.contains(get.color(hs[i]))) event.bool1=true;
            if(!event.bool2&&numbers.contains(get.number(hs[i]))) event.bool2=true;
            if(!event.bool3&&suits.contains(get.suit(hs[i]))) event.bool3=true;
        }
        "step 2"
        if(event.bool1){
            player.chooseControl(function(event,player){
                return _status.event.bool?0:1;
            }).set('bool',(get.attitude(player,target)>=0||player.countCards('h')<target.countCards('h'))).set('choiceList',['摸两张牌','获得'+get.translation(target)+'一张牌']);
        }
        else{
            event.goto(4);
        }
        "step 3"
        if(result&&typeof result.index=='number'){
            if(result.index==0){player.draw(2);}
            else{player.gainPlayerCard(target,'hej',true);}
        }
        "step 4"
        if(event.bool2){
            player.discard(cards);
        }else{
            player.addTempSkill('圣_zhongjian_delay');
        }
        "step 5"
        if(event.bool3){
            player.line(target,'thunder');
            target.damage(player);
        }
        "step 6"
        if(!event.bool1&&!event.bool2&&!event.bool3){
            player.storage.圣_zhongjian--;
            player.popup('杯具');
       }
    },
    ai:{
					order:10,
					result:{
						player:function (player,target){
							var num=target.countCards('h')-target.hp;
							if(get.attitude(player,target)<0) return 1.5*num;
							return 0;
						}
					}
				},
                init:function (player){
        player.storage.圣_zhongjian=0;
    },
                mark:true,
                onremove:true,
                intro:{
                    content:function (storage){
            if(storage>0) return '你的手牌上限+'+storage;
            if(storage<0) return '你的手牌上限'+storage;
            return '你的手牌上限无变化';
        },
                },
                mod:{
                    maxHandcard:function (player,num){
            return num+player.storage.圣_zhongjian;
        },
                },
                group:"圣_zhongjian_zero",
                subSkill:{
                    damage:{
                        mark:true,
                        marktext:"鉴",
                        intro:{
                    content:"该角色已被标记",
                },
                        sub:true,
                    },
                    delay:{
                        sub:true,
                    },
                    zero:{
                        trigger:{
                            player:"phaseEnd",
                        },
                        direct:true,
                        forced:true,
                        content:function (){
                player.storage.圣_zhongjian=0;
                player.markSkill('圣_zhongjian');
                player.syncStorage('圣_zhongjian');
            },
                        sub:true,
                    },
                },
            },
            "圣_dongcha":{
                trigger:{
                    player:"damageBegin",
                },
                forced:true,
                filter:function (event,player){
        return event.num>0&&event.source&&
            event.source!=player&&
            _status.currentPhase!=player&&
            event.source.hasSkill('圣_zhongjian_damage');
    },
                content:function (){
        "step 0"
        trigger.source.removeSkill('圣_zhongjian_damage');
        "step 1"
        trigger.cancel();
        "step 2"
        if(trigger.source.countCards('h')>player.countCards('h')){
        player.draw(trigger.source.countCards('h')-player.countCards('h'));
        }
    },
            },
            "圣_luoshen":{
                init:function (player){
        player.storage.圣_luoshen=0;
    },
                intro:{
                    content:function (storage){
                        if(storage>0) return '本回合因此技能获得'+storage+'张牌';
                        if(storage<0) return '本回合因此技能获得'+storage+'张牌';
                        return '未发动';
                    },
                },
      audio:"ext:混沌界:2",
      trigger:{
      player:'phaseBegin'
                },
				locked:true,
				content:function (){
					"step 0"
					player.judge(function(card){
						if(get.suit(card)!='heart') return 1.5;
						return -1.5;
					});
					"step 1"
					if(result.judge>0){
						player.gain(result.card,'gain2');
						player.storage.圣_luoshen++;
      player.markSkill('圣_luoshen');
      player.syncStorage('圣_luoshen');
					}
					else{
						event.finish();
					}
					"step 2"
					if(result.bool){
						event.goto(0);
						player.logSkill('圣_luoshen');
					}
				},
                group:"圣_luoshen_Over",
                subSkill:{
                    Over:{
                        audio:"ext:混沌界:2",
                        trigger:{
                            player:"phaseEnd",
                        },
                        forced:true,
                        direct:true,
                        priority:100,
                        content:function (){
        "step 0"
        if(player.storage.圣_luoshen<=2){
            player.storage.圣_luoshen=0;
                player.markSkill('圣_luoshen');
                player.syncStorage('圣_luoshen');
        }
       else{
           player.storage.圣_luoshen=0;
                player.markSkill('圣_luoshen');
                player.syncStorage('圣_luoshen');
                event.finish();
       }
       "step 1"
        player.chooseTarget(get.prompt('圣_luoshen_Over'),function(card,player,target){
            return target.isEnemyOf(player);
        }).ai=function(target){
            var att=get.attitude(player,target);
            if(target.isTurnedOver()){
                if(att>0){
                    return att+5;
                }
                return -1;
            }
            if(player.isTurnedOver()){
                return 5-att;
            }
            return -att;
        };
        "step 2"
        if(result.bool){
            player.logSkill('圣_luoshen_Over',result.targets);
            result.targets[0].turnOver();
        }
    },
                        ai:{
                            threaten:1.7,
                        },
                        sub:true,
                    },
                },
            },
            "圣_fanghua":{
                audio:"ext:混沌界:2",
                trigger:{
                    global:"turnOverAfter",
                },
                forced:true,
                filter:function (event,player){
        return event.player.isTurnedOver()&&
        event.player!=player;
        },
                content:function (){
        trigger.player.loseHp();
    },
                ai:{
                    expose:0,
                },
            },
            "圣_xishui":{
                audio:"ext:混沌界:2",
                group:"圣_xishui2",
                enable:['chooseToRespond','chooseToUse'],
                filterCard:function (card){
        return get.suit(card)=='spade'||get.suit(card)=='club'||get.suit(card)=='diamond';
    },
                position:"he",
                locked:true,
                viewAs:{
                    name:"shan",
                    suit:"spade",
                    number:13,
                },
                viewAsFilter:function (player){
        if(!player.countCards('he')) return false;
    },
                prompt:"将一张非♥️手牌当做【闪】打出",
                check:function (){return 1},
                ai:{
                    respondShan:true,
                    skillTagFilter:function (player){
            if(!player.countCards('he')) return false;
        },
                    effect:{
                        target:function (card,player,target,current){
                if(get.tag(card,'respondShan')&&current<0) return 0.6
            },
                    },
                    basic:{
                        useful:[7,2],
                        value:[7,2],
                    },
                },
            },
            "圣_xishui2":{
                audio:"ext:混沌界:2",
                trigger:{
                    player:["useCardEnd","respondEnd"],
                },
                filter:function (event,player){
        return event.card&&event.card.name=='shan';
    },
                forced:true,
                direct:true,
                content:function (){
        "step 0"
        player.chooseTarget(get.prompt('圣_xishui2'),function(card,player,target){
            return target.isEnemyOf(player);
        }).ai=function(target){
            var att=get.attitude(player,target);
            if(target.isTurnedOver()){
                if(att>0){
                    return att+5;
                }
                return -1;
            }
            if(player.isTurnedOver()){
                return 5-att;
            }
            return -att;
        };
        "step 1"
        if(result.bool){
            player.logSkill('圣_xishui2',result.targets);
            result.targets[0].turnOver();
        }
    },
    ai:{
       expose:1,
    },
            },
           "圣_longmai":{
                audio:"ext:混沌界:2",
                enable:"phaseUse",
                usable:1,
                locked:true,
                filterCard:function (card){
        return get.type(card)!='basic';
    },
                selectCard:true,
                position:'h',
                filter:function (event,player){
        return player.storage.圣_fanghun>=player.hp&&
        player.countCards('h',{type:'basic'})<player.countCards('h');
    },
                content:function (){
        "step 0"
        player.storage.圣_fanghun-=player.hp;
        player.markSkill('圣_fanghun');
        player.syncStorage('圣_fanghun');
        "step 1"
        player.recover();
        player.gain(get.cardPile(function(card){
            return card.name=='sha';
        }),'gain2');
        player.gain(get.cardPile(function(card){
            return card.name=='shan';
        }),'gain2');
        "step 2"
        if(!player.hasSkill('longdan')&&!player.hasSkill('圣_longmai_longdan')){
        player.addTempSkill('圣_longmai_longdan',{player:"phaseBegin"});
        }
    },
                ai:{
                order:10,
                result:{
                        player:1,
                    },
                },
            },
            "圣_longmai_longdan":{
                trigger:{
                    player:["useCard","respond"],
                },
                direct:true,
                forced:true,
                locked:true,
                unique:true,
                charlotte:true,
                filter:function (event){
                return event.skill=='圣_longmai_longdan_sha'||
                event.skill=='圣_longmai_longdan_shan'||
                event.skill=='longdan_sha'||
                event.skill=='longdan_shan';
            },
                content:function (){
                player.draw(player.hp);
            },
            group:["圣_longmai_longdan_sha","圣_longmai_longdan_shan"],
                subSkill:{
                    sha:{
                        audio:"ext:混沌界:2",
                        enable:['chooseToRespond','chooseToUse'],
                        locked:true,
                        filterCard:{
                            name:"shan",
                        },
                        viewAs:{
                            name:"sha",
                        },
                        viewAsFilter:function (player){
                if(!player.countCards('h','shan')) return false;
            },
                        prompt:"将一张闪当杀使用或打出",
                        check:function (){return 1},
                        ai:{
                            effect:{
                                target:function (card,player,target,current){
                        if(get.tag(card,'respondSha')&&current<0) return 0.6
                    },
                            },
                            respondSha:true,
                            skillTagFilter:function (player){
                    if(!player.countCards('h','shan')) return false;
                },
                            order:function (){
                    return get.order({name:'sha'})+0.1;
                },
                            useful:-1,
                            value:-1,
                            basic:{
                                useful:[5,1],
                                value:[5,1],
                            },
                            result:{
                                target:function (player,target){
                        if(player.hasSkill('jiu')&&!target.getEquip('baiyin')){
                            if(get.attitude(player,target)>0){
                                return -6;
                            }
                            else{
                                return -3;
                            }
                        }
                        return -1.5;
                    },
                            },
                            tag:{
                                respond:1,
                                respondShan:1,
                                damage:function (card){
                        if(card.nature=='poison') return;
                        return 1;
                    },
                                natureDamage:function (card){
                        if(card.nature) return 1;
                    },
                                fireDamage:function (card,nature){
                        if(card.nature=='fire') return 1;
                    },
                                thunderDamage:function (card,nature){
                        if(card.nature=='thunder') return 1;
                    },
                                poisonDamage:function (card,nature){
                        if(card.nature=='poison') return 1;
                    },
                            },
                        },
                        sub:true,
                    },
                    shan:{
                        audio:"ext:混沌界:2",
                        enable:['chooseToRespond','chooseToUse'],
                        locked:true,
                        filterCard:{
                            name:"sha",
                        },
                        viewAs:{
                            name:"shan",
                        },
                        prompt:"将一张杀当闪打出",
                        check:function (){return 1},
                        viewAsFilter:function (player){
                if(!player.countCards('h','sha')) return false;
            },
                        ai:{
                            respondShan:true,
                            skillTagFilter:function (player){
                    if(!player.countCards('h','sha')) return false;
                },
                            effect:{
                                target:function (card,player,target,current){
                        if(get.tag(card,'respondShan')&&current<0) return 0.6
                    },
                            },
                            order:4,
                            useful:-1,
                            value:-1,
                            basic:{
                                useful:[7,2],
                                value:[7,2],
                            },
                        },
                        sub:true,
                    },
                },
            },
            "圣_fanghun":{
                init:function (player){
        player.storage.圣_fanghun=0;
    },
                intro:{
                    content:"当前共持有#枚印记",
                },
                trigger:{
                    source:"damageAfter",
                },
                forced:true,
                direct:true,
                priority:-1,
                content:function (){
        player.storage.圣_fanghun+=trigger.num*2;
        player.markSkill('圣_fanghun');
        player.syncStorage('圣_fanghun');
    },
            },
            "圣_fuhan":{
            audio:"ext:混沌界:2",
                skillAnimation:true,
                animationColor:"fire",
                trigger:{
                    player:"phaseBegin",
                },
                forced:true,
                unique:true,
                priority:100,
                charlotte:true,
                filter:function (event,player){
        var num=game.countPlayer(function(current){
            return current.group=='shu'
        });
        return player.storage.圣_fanghun>=num;
    },
                content:function (){
        "step 0"
        player.awakenSkill('圣_fuhan');
        if(player.storage.圣_fanghun>0){
        if(player.hp==1){
            player.recover(player.storage.圣_fanghun);
        }
        else{
            player.draw(player.storage.圣_fanghun);
        }
     }
       "step 1"
       player.storage.圣_fanghun=0;
        player.markSkill('圣_fanghun');
        player.syncStorage('圣_fanghun');
       "step 2"
       var list=[];
        var list2=[];
        var players=game.players.concat(game.dead);
        for(var i=0;i<players.length;i++){
            list2.add(players[i].name);
            list2.add(players[i].name1);
            list2.add(players[i].name2);
        }
        for(var i in lib.character){
            if(lib.character[i][1]!='shu') continue;
            if(list2.contains(i)) continue;
            list.push(i);
        }
        var name=list.randomGet();
        var skills=lib.character[name][3];
        for(var i=0;i<skills.length;i++){
            player.addSkill(skills[i]);
        }
        game.delay(2);
    },
            },
            "圣_fankui":{
            marktext:"馈",
                intro:{
                    content:"已获得#枚“馈”印记",
                },
                init:function (player){
        player.storage.圣_fankui=0;
    },
                trigger:{
                    player:"damageEnd",
                },
                priority:100,
                forced:true,
                direct:true,
                content:function (){
                "step 0"
        player.storage.圣_fankui+=trigger.num+1;
        player.markSkill('圣_fankui');
        player.syncStorage('圣_fankui');
       "step 1"
                if(trigger.source&&trigger.source!=player){
                player.judge(function(card){
            if(get.color(card)=='black') return 1;
            return 0;
            }) 
                }
                "step 2"
                if(result.color){
            if(result.color=='black'){
                player.gainPlayerCard(
                [1,trigger.num],
                get.prompt('圣_fankui',trigger.source),
                trigger.source,get.buttonValue,'he').set('logSkill',['圣_fankui',trigger.source]);
            }}
            },
            ai:{
                            "maixie_defend":true,
                            effect:{
                                target:function (card,player,target){
                if(player.countCards('he')>1&&get.tag(card,'damage')){
                    if(player.hasSkillTag('jueqing',false,target)) return [1,-1.5];
                    if(get.attitude(target,player)<0) return [1,1];
                }
            },
                            },
                        },
            },
            "圣_guicai":{
     audio:"ext:混沌界:2",
     trigger:{
        global:"judge",
         },
				direct:true,
				forced:true,
				priority:-1,
				content:function (){
					"step 0"
					if(player.isDamaged()){
					if(!player.countCards('h')){
					player.draw(4+player.getDamagedHp());
					}else{
					player.draw(1+player.getDamagedHp());
					}
					}else{
					if(!player.countCards('h')){
					player.draw(4);
					}else{player.draw();}
					}
					"step 1"
					player.chooseCard(get.translation(trigger.player)+'的'+(trigger.judgestr||'')+'判定为'+
					get.translation(trigger.player.judging[0])+'，'+get.prompt('圣_guicai'),'he').set('ai',function(card){
						var trigger=_status.event.getTrigger();
						var player=_status.event.player;
						var judging=_status.event.judging;
						var result=trigger.judge(card)-trigger.judge(judging);
						var attitude=get.attitude(player,trigger.player);
						if(attitude==0||result==0) return 0;
						if(attitude>0){
							return result-get.value(card)/2;
						}
						else{
							return -result-get.value(card)/2;
						}
					}).set('judging',trigger.player.judging[0]);
					"step 2"
					if(result.bool){
						player.respond(result.cards,'圣_guicai','highlight','noOrdering');
					}
					else{
					if(player.hasSkill('圣_fankui')){
					if(player.hp>=player.storage.圣_fankui){
					player.chooseToDiscard('he',true).set('ai',function(card){
            return 6-get.useful(card);
        });
					}}else{
				 player.chooseToDiscard('he',2,true).set('ai',function(card){
            return 6-get.useful(card);
        });
					}
						event.finish();
					}
					"step 3"
					if(result.bool){
						if(trigger.player.judging[0].clone){
							trigger.player.judging[0].clone.classList.remove('thrownhighlight');
							game.broadcast(function(card){
								if(card.clone){
									card.clone.classList.remove('thrownhighlight');
								}
							},trigger.player.judging[0]);
							game.addVideo('deletenode',player,get.cardsInfo([trigger.player.judging[0].clone]));
						}
						game.cardsDiscard(trigger.player.judging[0]);
						trigger.player.judging[0]=result.cards[0];
						trigger.orderingCards.addArray(result.cards);
						game.log(trigger.player,'的判定牌改为',result.cards[0]);
						game.delay(2);
					}
				},
				ai:{
					tag:{
						rejudge:1,
					}
				}
            },
            "圣_baiyin":{
                skillAnimation:"epic",
                animationColor:"thunder",
                audio:"ext:混沌界:2",
                trigger:{
                    player:"damageAfter",
                },
                priority:-2,
                forced:true,
                unique:true,
                derivation:["圣_renjie","圣_lianpo","圣_jilue"],
                filter:function (event,player){
        return player.storage.圣_fankui>=3;
    },
                content:function (){
        "step 0"
    player.recover();
    player.link(false);
    player.turnOver(false);
    player.unMad();
        "step 1"
    player.removeSkill('圣_fankui');
    player.removeSkill('圣_guicai');
        "step 2"
    player.addSkill('圣_renjie');
    player.addSkill('圣_lianpo');
    player.addSkill('圣_jilue');
    "step 3"
    if(player.hp>player.countCards('h')){
    player.draw(player.hp-player.countCards('h'));
    }
    "step 4"
    player.awakenSkill('圣_baiyin');
    },
            },
            "圣_renjie":{
                audio:"ext:混沌界:2",
                mark:true,
                trigger:{
                    player:["damageEnd","loseHpEnd","loseEnd"],
                },
                forced:true,
                filter:function (event,player){
        return _status.currentPhase!=player&&event.num>0;
    },
                init:function (player){
        player.storage.圣_renjie=3;
    },
                content:function (){
        player.storage.圣_renjie+=trigger.num;
        player.markSkill('圣_renjie');
        player.syncStorage('圣_renjie');
    },
                intro:{
                    content:"当前共持有#枚印记",
                },
                group:"圣_renjie_recover",
                subSkill:{
                recover:{
                trigger:{
                    player:"recoverEnd",
                },
                forced:true,
                filter:function (event,player){
        return event.card&&event.num>0&&player.storage.圣_renjie>0;
    },
                content:function (){
        player.storage.圣_renjie--;
        player.markSkill('圣_renjie');
        player.syncStorage('圣_renjie');
    },
                },
                },
                ai:{
                    maixie:true,
                    "maixie_hp":true,
                    effect:{
                        target:function (card,player,target){
                if(player.hasSkillTag('jueqing',false,target)) return [1,-2];
                if(get.tag(card,'damage')){
                    if(target.hp==target.maxHp){
                        if(!target.hasSkill('圣_jilue')){
                            return [0,1];
                        }
                        return [0.7,1];
                    }
                    return 0.7;
                }
            },
                        player:function (card,player){
                if(_status.currentPhase!=player) return;
                if(_status.event.name!='chooseToUse'||_status.event.player!=player) return;
                if(get.type(card)=='basic') return;
                if(get.tag(card,'gain')) return;
                if(get.value(card,player,'raw')>=7) return;
                if(player.hp<=2) return;
                if(!player.hasSkill('圣_jilue')||player.storage.圣_renjie==0){
                    return 'zeroplayertarget';
                }
            },
                    },
                },
            },
            "圣_lianpo":{
            init:function (player){
        player.storage.圣_lianpo=0;
    },
            trigger:{
        player:"phaseAfter",
    },
    forced:true,
    filter:function (event,player){
    return player.storage.圣_lianpo>0;
    },
    content:function (){
    "step 0"
    player.storage.圣_lianpo--;
    player.markSkill('圣_lianpo');
    player.syncStorage('圣_lianpo');
    "step 1"
    player.draw();
    player.insertPhase();
    },
    group:"圣_lianpo_mark",
    subSkill:{
        mark:{
        trigger:{
        source:"dyingEnd",
    },
    forced:true,
    direct:true,
    content:function (){
    player.storage.圣_lianpo++;
    player.markSkill('圣_lianpo');
    player.syncStorage('圣_lianpo');
    },
        },
    },
            },
            "圣_jilue":{
                forced:true,
                locked:true,
                group:["圣_jilue_turnOver","圣_jilue_draw","圣_jilue_gong","圣_jilue_shou"],
            },
            "圣_jilue_shou":{
                audio:"ext:混沌界:2",
                trigger:{
                    player:"damageBefore",
                },
                locked:true,
                priority:-2,
                filter:function (event,player){
        return event.num>0&&player.storage.圣_renjie>0;
    },
                content:function (){
        "step 0"
        player.storage.圣_renjie--;
        player.markSkill('圣_renjie');
        player.syncStorage('圣_renjie');
        "step 1"
        trigger.num--;
    },
            },
            "圣_jilue_gong":{
                audio:"ext:混沌界:2",
                trigger:{
                    source:"damageBefore",
                },
                locked:true,
                priority:-1,
                check:function (event,player){
      return get.attitude(player,event.source)<0;
      },
                filter:function (event,player){
        return event.num>0&&player.storage.圣_renjie>0;
    },
                content:function (){
        "step 0"
        player.storage.圣_renjie--;
        player.markSkill('圣_renjie');
        player.syncStorage('圣_renjie');
        "step 1"
        trigger.num++;
    },
            },
            "圣_jilue_draw":{
                audio:"ext:混沌界:2",
                trigger:{
                    player:"useCardAfter",
                },
                locked:true,
                priority:-1,
                check:function (event,player){
      return player.countCards('h')<=1||player.storage.圣_renjie>4;
      },
                filter:function (event,player){
        return event.card&&player.storage.圣_renjie>0&&
        _status.currentPhase==player;
    },
                content:function (){
        "step 0"
        player.storage.圣_renjie--;
        player.markSkill('圣_renjie');
        player.syncStorage('圣_renjie');
        "step 1"
        player.draw();
    },
            },
            "圣_jilue_turnOver":{
                audio:"ext:混沌界:2",
                trigger:{
                    player:"damageEnd",
                },
                forced:true,
                direct:true,
                priority:100,
                check:function (event,player){
      return get.attitude(player,event.source)<0;
      },
                filter:function (event,player){
        return event.source&&event.source.countCards('he')>0&&
        event.source!=player&&
        player.storage.圣_renjie>0;
    },
                content:function (){
        "step 0"
        player.discardPlayerCard('he',get.prompt('圣_jilue_turnOver',trigger.source),trigger.source);
        "step 1"
        if(result.bool){
        player.logSkill('圣_jilue_turnOver',trigger.source);
        player.storage.圣_renjie--;
        player.markSkill('圣_renjie');
        player.syncStorage('圣_renjie');
        trigger.source.turnOver();
        }
    },
                ai:{
                    threaten:1.3,
                },
            },
        "圣_xuanlie":{
                audio:"ext:混沌界:2",
                trigger:{
                    player:"damageBegin",
                },
                check:function (event,player){
      return get.attitude(player,event.source)<0||
      get.attitude(player,event.source)>0&&!player.hasSkill('圣_danmu_mark');
      },
                filter:function (event,player){
        return event.num>0&&event.source&&event.source!=player;
    },
                locked:true,
                priority:-1,
                content:function (){
        "step 0"
        player.judge(function(card){
            if(get.color(card)=='red') return 1;
            return 0;
        });
        "step 1"
        if(result.color){
        if(result.color=='black'){
            if(player.hasSkill('圣_danmu_mark')){
                player.discardPlayerCard('请弃置'+get.translation(trigger.source)+'至多'+get.translation(trigger.num+2)+'张牌',trigger.source,'he',[1,trigger.num+2],true);
            }
            else{
                player.discardPlayerCard('请弃置'+get.translation(trigger.source)+'至多'+get.translation(trigger.num+1)+'张牌',trigger.source,'he',[1,trigger.num+1],true);
            }
        }
        else{
            if(player.hasSkill('圣_danmu_mark')){
                trigger.num--;
                player.line(trigger.source);
                trigger.source.damage(player);
            }
            else{
                trigger.num--;
            }
        }
        }
    },
                ai:{
                    "maixie_defend":true,
                    expose:0.4,
                },
            },
            "圣_danmu":{
                trigger:{
                    player:["phaseBegin","damageEnd","recoverEnd"],
                },
                forced:true,
                direct:true,
                priority:100,
                filter:function (event,player){
        return !player.hasSkill('圣_danmu_mark');
    },
                content:function (){
       player.addSkill('圣_danmu_mark');
       game.log(player,'获得了','#y“啖”','印记');
},
                subSkill:{
                    mark:{
                        mark:true,
                        marktext:"啖",
                        intro:{
                            content:"已拥有“啖”印记",
                        },
                        sub:true,
                    },
                },
            },
            "圣_hunyong":{
                trigger:{
                    global:"phaseBefore",
                },
                locked:true,
                check:function (event,player){
      return get.attitude(player,event.player)>0;
      },
                prompt:function (event,player){
        return "是否对"+get.translation(event.player)+"发动【魂勇】？";
    },
                filter:function (event,player){
        return event.player!=player&&
            player.isDamaged()&&
            player.hasSkill('圣_danmu_mark');
    },
                content:function (){
        "step 0"
        player.removeSkill('圣_danmu_mark');
        player.draw(player.maxHp-player.hp);
        "step 1"
        player.chooseCard('he',[1,player.countCards('h')],'请交给'+get.translation(trigger.player)+'任意张牌或取消并视为对其使用一张【杀】');
        "step 2"
        if(result.bool){
            player.logSkill('圣_hunyong_draw');
            trigger.player.gain(result.cards,player,'giveAuto');
            trigger.player.addTempSkill('圣_hunyong_draw');
        }
        else{
            player.logSkill('圣_hunyong_sha');
            player.randomDiscard('h',true);
            player.useCard({name:"sha"},trigger.player);
        }
    },
                subSkill:{
                    sha:{
                    audio:"ext:混沌界:2",
                    },
                    draw:{
                    audio:"ext:混沌界:2",
                        direct:true,
                        locked:true,
                        unique:true,
                        charlotte:true,
                        mod:{
                            maxHandcard:function (player,num){
            return num+1;
        },
                        },
                        sub:true,
                    },
                },
            },
            "圣_xiangle":{
                mod:{
                    targetEnabled:function (card,player,target,now){
                if(card.name=='sha') return false;   
        },
                    cardEnabled:function (card,player){
            if(card.name=='sha'&&_status.currentPhase==player&&
                _status.event.getParent('phaseUse')){
                return false;
            }
        },
                },
            },
            "圣_fangquan":{
                audio:"ext:混沌界:2",
                trigger:{
                    player:"phaseBegin",
                },
                forced:true,
                direct:true,
                filter:function (event,player){
        return player.countCards('he');
    },
                content:function (){
        'step 0'
        player.chooseCardTarget({
            position:'he',
            filterCard:true,
            selectCard:true,
            filterTarget:function (card,player,target){
                return target!=player&&get.distance(player,target)<=game.roundNumber;
            },
            prompt:get.prompt2('圣_fangquan'),
        });
        'step 1'
        if(result.bool){
            player.logSkill('圣_fangquan');
            event.target=result.targets[0];
            player.line(event.target);
            event.target.gain(result.cards,player,'giveAuto');
            event.target.draw();
            event.target.addSkill('圣_fangquan_mark');
        }else{event.finish();}
        'step 2'
        event.target.chooseToUse('h','请使用一张带有伤害标签的牌，若你于此阶段内造成伤害则触发额外效果',function(card){
                var type=get.type(card,player);
                return (type=='basic'||type=='trick')&&get.tag(card,'damage')>0;
            });
        'step 3'
        event.target.removeSkill('圣_fangquan_mark');
    },
                group:"圣_fangquan_source",
                subSkill:{
                    ins:{
                        sub:true,
                    },
                    mark:{
                        sub:true,
                    },
                    source:{
                        trigger:{
                            global:"damageEnd",
                        },
                        forced:true,
                        direct:true,
                        priority:1,
                        filter:function (event,player){
                return event.source&&
                    !event.source.hasSkill('圣_fangquan_ins')&&
                    event.source.hasSkill('圣_fangquan_mark');
            },
                        content:function (){
                'step 0'
                player.draw(trigger.num);
                player.skip('phaseUse');
                player.skip('phaseDiscard');
                'step 1'
                trigger.source.addSkill('圣_fangquan_ins');
                trigger.source.insertPhase();
            },
                        sub:true,
                    },
                },
            },
            "圣_ruoyu":{
                skillAnimation:true,
                animationColor:"fire",
                audio:"ext:混沌界:2",
                trigger:{
                    global:"phaseEnd",
                },
                forced:true,
                direct:true,
                derivation:["圣_jiaogong","圣_guzhi","圣_hanxing","圣_anle"],
                filter:function (event,player){
       return event.player.hasSkill('圣_fangquan_ins')&&event.player.isAlive(); 
    },
                content:function (){
        'step 0'
        if(trigger.player.isDamaged()&&player.isDamaged()){
            trigger.player.removeSkill('圣_fangquan_ins');
            player.setAvatar('混沌_圣神_liushanx','混沌_圣神_liushanx_hanxing');
            player.logSkill('圣_ruoyu');
            trigger.player.recover();
            player.gainPlayerCard('h',trigger.player,Infinity,true);
            player.gainMaxHp();
            player.recover();
            player.removeSkill('圣_fangquan');
            player.removeSkill('圣_xiangle');
            player.addSkill('圣_jiaogong');
            player.addSkill('圣_guzhi');
        }else{
            trigger.player.removeSkill('圣_fangquan_ins');
            event.finish();
        }
        'step 1'
        player.awakenSkill('圣_ruoyu');
    },
            },
            "圣_jiaogong":{
                audio:"ext:混沌界:2",
                enable:"phaseUse",
                usable:1,
                filterTarget:function (card,player,target){
        return player!=target;
    },
                filter:function (event,player){
        return player.countCards('h')>0;
    },
                filterCard:true,
                selectCard:-1,
                discard:false,
                lose:false,
                delay:false,
                content:function (){
        'step 0'
        event.target=target;
        'step 1'
        event.target.gain(cards,player,'giveAuto');
        event.target.addMark('圣_jiaogong_mark',cards.length);
        'step 2'
        if(event.target.isDamaged()&&event.target.hasMark('圣_jiaogong_mark')){
            event.target.removeMark('圣_jiaogong_mark');
            event.target.recover();
            if(event.target.countCards('h')){
            event.target.chooseCard('h',true);
            event.target.line(player);
            }else{
                event.goto(4);
            }
        }else{
            player.line(event.target);
            event.target.damage(player);
            event.target.loseMaxHp();
            event.target.useCard({name:'sha'},player);
            event.finish();
        }
        'step 3'
        player.gain(result.cards[0],event.target,'giveAuto');
        'step 4'
        event.goto(2);
    },
                subSkill:{
                    mark:{
                        mark:true,
                        marktext:"贡",
                        intro:{
                            content:"该角色获得了#份“贡品”",
                        },
                        sub:true,
                    },
                },
            },
            "圣_guzhi":{
                audio:"ext:混沌界:2",
                trigger:{
                    global:["dyingBegin","dieBegin"],
                },
                forced:true,
                direct:true,
                derivation:["圣_hanxing","圣_anle"],
                filter:function (event,player){
        return event.player==player||event.player.hasMark('圣_jiaogong_mark');
    },
                content:function (){
        if(trigger.player==player){
        player.logSkill('圣_guzhi_anle');
        player.loseMaxHp();
        player.recover(1-player.hp);
        player.removeSkill('圣_jiaogong');
        player.addSkill('圣_anle');
        player.setAvatar('混沌_圣神_liushanx','混沌_圣神_liushanx');
        player.awakenSkill('圣_guzhi');
    }else{
        if(trigger.player.hasMark('圣_jiaogong_mark')){
            player.logSkill('圣_guzhi_hanxing');
            if(player.isDamaged()){
                player.recover(trigger.player.countMark('圣_jiaogong_mark'));
            }
            player.removeSkill('圣_jiaogong');
            player.addSkill('圣_hanxing');
            player.awakenSkill('圣_guzhi');
        }
           }
    },
    subSkill:{
    hanxing:{
    skillAnimation:true,
    animationColor:"fire",
    audio:"ext:混沌界:2",
    },
    anle:{
    audio:"ext:混沌界:2",
    skillAnimation:true,
    animationColor:"fire",
    }
    }
            },
            "圣_hanxing":{
                audio:"ext:混沌界:2",
                trigger:{
                    player:"phaseBegin",
                },
                forced:true,
                content:function (){
        'step 0'
        player.gainMaxHp();
        player.recover();
        'step 1'
        event.targets=game.filterPlayer();
        event.targets.sort(lib.sort.seat);
        player.line(event.targets,'fire');
        'step 2'
        if(event.targets.length){
            var target=event.targets.shift();
            event.target=target;
            event.target.line(player,'fire');
            if(player!=event.target&&event.target.countCards('he')){
                event.target.chooseCard('he',true,'【汉兴】：请将一张牌交给'+get.translation(player));
            }else{event.goto(5)}
        }else{event.finish();}
        'step 3'
        player.gain(result.cards[0],event.target,'giveAuto');
        'step 4'
       if(event.target.countCards('h')<player.countCards('h')){
           event.target.recover();
           event.target.draw();   
       }
        'step 5'
        event.goto(2);
    },
            },
            "圣_anle":{
                audio:"ext:混沌界:2",
                mod:{
                    globalTo:function (from,to,distance){
            return distance+=(to.storage.圣_anle);
        },
                },
                marktxet:"安乐",
                intro:{
                    content:"你的防御距离+#",
                },
                init:function (player){
        player.storage.圣_anle=0;
    },
                trigger:{
                    player:"phaseBegin",
                },
                forced:true,
                content:function (){
        'step 0'
        player.loseMaxHp();
        'step 1'
        player.addMark('圣_anle');
    },
            },
            "圣_kurou":{
                audio:"ext:混沌界:2",
                enable:"phaseUse",
                locked:true,
                filterTarget:function (card,player,target){
        return target!=player;
    },
                content:function (){
                "step 0"
                player.gainPlayerCard('he',target,true);
                target.gainPlayerCard('he',player,true);
                "step 1"
                player.loseHp();
                target.loseHp();
                "step 2"
                if(player.hp>target.hp){
                if(player.countCards('he')){
                player.chooseToDiscard('he',true).set('ai',function(card){
            return 6-get.useful(card);
        });
                }
                }else{
                if(target.countCards('he')){
                target.chooseToDiscard('he',true).set('ai',function(card){
            return 6-get.useful(card);
        });
                }
                }
    },
                ai:{
                    order:10,
                    expose:1,
                    result:{
                        target:function (target,player){
                if(player.hp+player.num('h','tao')>3) return -1;
                return 0;
            }
                    },
                },
            },
            "圣_yanzhan":{
                trigger:{
                    player:"shaBegin",
                },
                direct:true,
                forced:true,
                filter:function (event,player){
        return event.card&&get.color(event.card)=='red';
    },
                content:function (){
        trigger.directHit=true;
    },
            },
            "圣_zhaxiang":{
                audio:"ext:混沌界:2",
                trigger:{
                    player:"loseHpAfter",
                },
                forced:true,
                priority:-1,
                line:"fire",
                content:function (){
                "step 0"
                player.draw(trigger.num*3);
                "step 1"
        if(_status.currentPhase==player){
        if(!player.hasSkill('圣_zhaxiang_buff')){
            player.addTempSkill('圣_zhaxiang_buff');
            player.addTempSkill('圣_zhaxiang_mark');
        player.storage.圣_zhaxiang_mark++;
        player.markSkill('圣_zhaxiang_mark');
        player.syncStorage('圣_zhaxiang_mark')
            }else{
        player.storage.圣_zhaxiang_mark++;
        player.markSkill('圣_zhaxiang_mark');
        player.syncStorage('圣_zhaxiang_mark');
            }
        }
        else{
            player.line(_status.currentPhase,'fire');
            _status.currentPhase.damage(player,'fire',true);
        }
    },
                ai:{
                    maihp:true,
                },
                subSkill:{
                    buff:{
                        mod:{
                            cardUsable:function (card,player,num){
            if(card.name=='sha') return num+=player.storage.圣_zhaxiang_mark;
        },
                            targetInRange:function (card,player){
            if(card.name=='sha') return true;
        },
                        },
                        trigger:{
                            source:"damageBefore",
                        },
                        forced:true,
                        content:function (){
                     trigger.nature='fire';
    },
                        sub:true,
                    },
                    mark:{
                    init:function (player){
                player.storage.圣_zhaxiang_mark=0;
            },
                        onremove:function (player){
                player.storage.圣_zhaxiang_mark=0;
            },
                    },
                },
            },
            "圣_zhuchang":{
                trigger:{
                    player:"phaseDrawBegin",
                },
                forced:true,
                priority:-1,
                content:function (){
        "step 0"
        trigger.changeToZero();
        "step 1"
        player.draw(2);
        player.draw('bottom',2);
        "step 2"
        player.randomDiscard('h',2,true);
    },
            },
            "圣_qizhi":{
                audio:"ext:混沌界:2",
                trigger:{
                    player:"useCardToPlayered",
                },
                direct:true,
                forced:true,
                filter:function (event,player){
        if(!event.targets) return false;
        if(!event.isFirstTarget) return false;
        if(_status.currentPhase!=player) return false;
        if(event.noai) return false;
        return game.hasPlayer(function(target){
            return !event.targets.contains(target)&&target.countCards('he')>0;
        });
    },
                content:function (){
        "step 0"
        player.chooseTarget(get.prompt('圣_qizhi'),'将一名角色的一张牌置入牌堆底并令其摸一张牌，若此牌不为基本牌，则你摸一张牌',function(card,player,target){
            return !_status.event.targets.contains(target)&&target.countCards('he')>0;
        }).set('ai',function(target){
            var player=_status.event.player;
            if(target==player) return 2;
            if(get.attitude(player,target)<=0){
                return 1
            }
            if(target.hasSkill('圣_qizhi_mark')){
                return -6;
            }
            return 0.5;
        }).set('targets',trigger.targets);
        "step 1"
        if(result.bool){
            player.getHistory('custom').push({圣_qizhi:true});
            if(!event.isMine()&&!_status.connectMode) game.delay();
            player.logSkill('圣_qizhi',result.targets);
            player.chooseCardButton(result.targets[0],result.targets[0].getCards('he'),'请将该角色的一张牌置入牌堆底',true);
            event.target=result.targets[0];
        }else{event.finish();}
        "step 2"
        if(result.bool){
        if(get.type(result.links[0])!='basic'){player.draw();}
        ui.cardPile.appendChild(result.links[0]);
        event.target.draw();   
        if(event.target.countCards('h')>=player.countCards('h')&&event.target!=player){
        player.gainPlayerCard(event.target,'h',true);}
        if(player.hasSkill('圣_jinqu_buff')){
        player.storage.圣_jinqu_buff++;
        player.markSkill('圣_jinqu_buff');
        player.syncStorage('圣_jinqu_buff');}
        if(game.countPlayer()>2&&event.target!=player){
        if(!event.target.hasSkill('圣_qizhi_mark')){
        event.target.addTempSkill('圣_qizhi_mark');}
        else{player.loseHp();}
        }
        }
    },
                subSkill:{
                    mark:{
                        sub:true,
                    },
                },
            },
            "圣_jinqu":{
            audio:"ext:混沌界:2",
                trigger:{
                    player:"phaseBegin",
                },
                forced:true,
                direct:true,
                filter:function (event,player){
        return player.isDamaged()&&player.countCards('he')>0;
    },
                content:function (){
        "step 0"
        var num=player.maxHp-player.hp;
        player.chooseToDiscard(get.prompt('圣_jinqu'),'你可以弃置至多'+get.translation(num)+'张牌，若如此做，当你本回合弃牌阶段弃置的牌数不小于当前体力值时，你可以额外摸牌','he',[1,num]);
        "step 1" 
        if(result.bool){
        player.logSkill('圣_jinqu');
        player.addSkill('圣_jinqu_buff');
        player.storage.圣_jinqu_buff+=result.cards.length;
        player.markSkill('圣_jinqu_buff');
        player.syncStorage('圣_jinqu_buff');
        }
    },
                subSkill:{
                    buff:{
                        mark:true,
                        marktext:"趋",
                        init:function (player){
                player.storage.圣_jinqu_buff=0;
            },
                        onremove:function (player){
                player.storage.圣_jinqu_buff=0;
            },
                        intro:{
                            content:"若你于弃牌阶段弃置的牌不少于你的当前体力值，则你摸#张牌",
                        },
                        trigger:{
                            player:"phaseDiscardEnd",
                        },
                        forced:true,
                        direct:true,
                        content:function (){
                "step 0"
                if(trigger.cards&&trigger.cards.length>=player.hp){
                player.logSkill('圣_jinqu');
                player.draw('bottom',player.storage.圣_jinqu_buff);
                }
                "step 1"
                player.removeSkill('圣_jinqu_buff');
            },
                        sub:true,
                    },
                },
            },
            "圣_zongkui":{
                audio:"ext:混沌界:3",
                trigger:{
                    global:"gameStart",
                    player:["phaseBefore","damageAfter"],
                    source:"damageEnd",
                },
                forced:true,
                direct:true,
                filter:function (event,player){
        return game.hasPlayer(function(current){
            return current!=player&&!current.hasSkill('圣_guju_mark');
        });
    },
                content:function (){
        "step 0"
        player.chooseTarget(get.prompt2('圣_zongkui'),function(card,player,target){
						if(_status.event.round&&!target.isMinHp()) return false;
						return target!=player&&!target.hasSkill('圣_guju_mark');
					}).set('ai',function(target){
						var num=target.isMinHp()?0.5:(1+Math.random());
						if(get.attitude(_status.event.player,target)<0){
							num+=0.5;
						}
						return num;
					}).set('round',event.triggername=='roundStart');
        "step 1"
        if(result.bool){
            var target=result.targets[0];
            player.logSkill('圣_zongkui',target);
            target.addSkill('圣_guju_mark');
            player.storage.圣_guju++;
            player.syncStorage('圣_guju');
            player.markSkill('圣_guju');
        }
    },
                ai:{
                    threaten:1.4,
                },
            },
            "圣_guju":{
            init:function (player){
        player.storage.圣_guju=0;
    },
                trigger:{
                    global:["damageEnd","loseHpEnd","recoverEnd","loseMaxHp"],
                },
                forced:true,
                priority:100,
                filter:function (event,player){
        return event.player!=player&&event.num>0&&
        event.player.hasSkill('圣_guju_mark');
    },
                content:function (){
                if(player.isDamaged()){
                    player.recover();
                    trigger.player.removeSkill('圣_guju_mark');
                }
                else{
                    player.draw();
                }
    },
                subSkill:{
                    mark:{
                        mark:true,
                        marktext:"傀",
                        intro:{
                            content:"该角色已成为“傀儡”",
                        },
                        unique:true,
                        charlotte:true,
                        sub:true,
                    },
                },
            },
            "圣_baijia":{
                skillAnimation:true,
                animationColor:"thunder",
                audio:"ext:混沌界:2",
                derivation:["圣_canshi"],
                priority:100,
                unique:true,
            trigger:{
            player:"phaseBegin",
            },
            forced:true,
            filter:function (event,player){
        return player.isDamaged()&&player.storage.圣_guju>=player.hp;
            },
            content:function (){
            "step 0"
            player.link(false);
            player.turnOver(false);
            player.unMad();
            "step 1"
            player.recover();
            "step 2"
            var list=game.filterPlayer();
					for(var i=0;i<list.length;i++){
						if(list[i]!=player&&!list[i].hasSkill('圣_guju_mark')){
							list[i].addSkill('圣_guju_mark');
							player.line(list[i],'thunder');
						}
					}
            "step 3"
            player.addSkill("圣_canshi");
            "step 4"
            player.awakenSkill("圣_baijia");
            },
            },
            "圣_canshi":{
                group:["圣_canshi1","圣_canshi2"],
            },
            "圣_canshi1":{
                audio:"ext:混沌界:2",
                trigger:{
                    player:"useCardToBefore",
                },
                filter:function (event,player){
        if(!event.targets||event.targets.length!=1) return false;
        var info=get.info(event.card);
        if(info.multitarget) return false;
        if(info.allowMultiple==false) return false;
        return game.hasPlayer(function(current){
            if(!current.hasSkill('圣_guju_mark')) return false;
            return !event.targets.contains(current);
        });
    },
                forced:true,
                direct:true,
                content:function (){
        "step 0"
        player.chooseTarget(get.prompt2('圣_canshi1'),[1,Infinity],function(card,player,target){
            if(!target.hasSkill('圣_guju_mark')) return false;
            var trigger=_status.event.getTrigger();
            return !trigger.targets.contains(target);
        }).set('ai',function(target){
            var player=_status.event.player;
            return get.effect(target,_status.event.getTrigger().card,player,player);
        });
        "step 1"
        if(result.bool){
            if(!event.isMine()&&!_status.connectMode) game.delayx();
            event.targets=result.targets.slice(0);
            for(var i=0;i<event.targets.length;i++){
                event.targets[i].removeSkill('圣_guju_mark');
            }
        }
        else{
            event.finish();
        }
        "step 2"
        player.logSkill('圣_canshi1',event.targets);
        trigger.targets.addArray(event.targets);
    },
            },
            "圣_canshi2":{
                audio:"ext:混沌界:2",
                trigger:{
                    global:"useCard",
                },
                priority:-1,
                locked:true,
                prompt2:function (event,card){
        return '是否发动【蚕食】？','锁定技，每当一名其他角色使用牌（'+get.translation(event.card)+'）时，若该角色已成为“傀儡”，你可以移除该角色的“傀”印记，令此牌无效并获得之';
    },
                check:function (event,player){
      return get.attitude(player,event.player)<0;
      },
                filter:function (event,player){
        return event.player.hasSkill('圣_guju_mark');
    },
                content:function (){
        "step 0"
        trigger.player.removeSkill('圣_guju_mark');
        "step 1"
        player.gain(trigger.cards);
        player.$gain2(trigger.cards);
         "step 2"
        trigger.cancel();
    },
            },
            "圣_quanji":{
            mod:{
        maxHandcard:function (player,num){
            return num+=(2*player.storage.圣_quanji.length);
        },
    },
                audio:"ext:混沌界:2",
                trigger:{
                    player:"damageEnd",
                },
                locked:true,
                notemp:true,
                intro:{
                    content:"cards",
                },
                init:function (player){
        player.storage.圣_quanji=[];
    },
                filter:function (event,player){
        return event.num>0&&event.source;
    },
                content:function (){
        "step 0"
        event.num=trigger.num+1;
        if(trigger.source.countCards('e')>0){
        player.draw(event.num);
        player.gainPlayerCard(trigger.source,'e',[1,event.num]);
       }else{
       player.draw(event.num*2);
       }
        "step 1"      
           if(player.countCards('he')){
            player.chooseCard('是否将'+get.cnNumber(event.num)+'张牌置于武将牌上称为“权”？','he',event.num);
        }
        else{
           event.finish(); 
        }
        "step 2"
        if(result.cards&&result.cards.length){
            player.lose(result.cards,ui.special,'toStorage');
            player.$give(result.cards,player);
            player.storage.圣_quanji=player.storage.圣_quanji.concat(result.cards);
            player.syncStorage('圣_quanji');
            player.markSkill('圣_quanji');
            game.log(player,'将',result.cards,'置于武将牌上称为','#y“权”');
        }
        "step 3"
        if(player.countCards('h',{type:'equip'})>0){
            player.chooseToUse('h',{type:'equip'},'是否使用一张装备牌？');
        }
    },
                
                ai:{
                    maixie:true,
                    "maixie_hp":true,
                    threaten:0.8,
                    effect:{
                        target:function (card,player,target){
                if(get.tag(card,'damage')){
                    if(player.hasSkillTag('jueqing',false,target)) return [1,-2];
                    if(!target.hasFriend()) return;
                    if(target.hp>1) return [1,get.tag(card,'damage')*0.5];
                }
            },
                    },
                },
            },
            "圣_yexin":{
                trigger:{
                    player:"recoverBegin",
                },
                forced:true,
                priority:-1,
                filter:function (event,player){
        return player.hasSkill('圣_quanji')&&player.hp>0&&event.num>0;
    },
                content:function (){
        "step 0"
        player.draw(trigger.num);
        "step 1"
                    var card=get.cards()[0];
                    player.storage.圣_quanji.push(card);
                    player.$draw(card);
                    player.markSkill('圣_quanji');
                    player.syncStorage('圣_quanji');
                    game.addVideo('storage',player,['圣_yexin',get.cardsInfo(player.storage.圣_quanji),'cards']);
        "step 2"
        trigger.cancel();
    },
            },
            "圣_jinlin":{
            marktext:"鳞",
                intro:{
                    content:"当前共持有#枚“鳞”",
                },
                init:function (player){
        player.storage.圣_jinlin=0;
    },
                trigger:{
                    player:"damageEnd",
                },
                priority:100,
                forced:true,
                direct:true,
                content:function (){
        player.storage.圣_jinlin+=trigger.num;
        player.markSkill('圣_jinlin');
        player.syncStorage('圣_jinlin');
       },
                group:"圣_jinlin_source",
                subSkill:{
                    source:{
                    audio:"ext:混沌界:2",
                        trigger:{
                            source:"damageBegin",
                        },
                        forced:true,
                        priority:-1,
                        filter:function (event,player){
        return player.storage.圣_jinlin>0;
    },
                        content:function (){
                "step 0"
        trigger.num+=player.storage.圣_jinlin;
                "step 1"
        player.storage.圣_jinlin=0;
        player.markSkill('圣_jinlin');
        player.syncStorage('圣_jinlin');
    },
                        sub:true,
                    },
                },
            },
            "圣_baijiang":{
                audio:"ext:混沌界:2",
                skillAnimation:"epic",
                animationColor:"thunder",
                trigger:{
                    player:["phaseBegin"],
                },
                forced:true,
                priority:-1,
                derivation:["圣_paiyi","圣_jinlin"],
                filter:function (event,player){
        return player.storage.圣_quanji&&player.storage.圣_quanji.length>=4;
    },
                content:function (){
        "step 0"
        player.removeSkill('圣_quanji');
        player.removeSkill('圣_yexin');
        player.addSkill('圣_paiyi');
        player.addSkill('圣_jinlin');
        "step 1"
        player.recover();
        player.gain(player.storage.圣_quanji,'fromStorage',player,'giveAuto');
        game.addVideo('storage',player,['圣_baijiang',get.cardsInfo(player.storage.圣_quanji),'cards']);
        "step 2"
        player.storage.圣_quanji=[];
        game.log(player,'获得了武将牌旁的所有','#y“权”');
        "step 3"
        player.awakenSkill('圣_baijiang');
    },
            },
            "圣_paiyi":{
                audio:"ext:混沌界:2",
                enable:"phaseUse",
                locked:true,
                usable:1,
                prepare:"give2",
                filterTarget:function (card,player,target){
        if(player==target) return false;
        return true;
    },
                filter:function (event,player){
        return player.countCards('he')>0;
    },
                filterCard:true,
                position:"he",
                selectCard:[1,Infinity],
                check:function (card){
        if(card.name=='du') return 20;
        return 4-get.value(card);
    },
                discard:false,
                content:function (){
        "step 0"
        target.gain(cards,player).delay=false;
        "step 1"
        if(target.countCards('h')>player.countCards('h')){
            if(target.hp>player.hp){
            target.damage(player,2);
        }else{
            target.damage(player);
        }
        }
        "step 2"
        player.draw();
    },
                ai:{
                order:1,
                expose:1,
                result:{
                target:function (player,target){
                return -target.countCards('h')>=player.countCards('h');
            }
             },
         },
       },
            "圣_qingluo":{
                mod:{
                    globalFrom:function (from,to,distance){
            return distance-1;
        },
                    globalTo:function (from,to,distance){
            return distance-1;
        },
                },
                trigger:{
                    global:"gameDrawAfter",
                },
                forced:true,
                priority:100,
                content:function (){
        player.disableEquip(2);
        player.disableEquip(3);
        player.disableEquip(4);
    },
            },
            "圣_fenji":{
                audio:"ext:混沌界:2",
                trigger:{
                    global:["loseEnd","damageEnd"],
                },
                locked:true,
                priority:-1,
                filter:function (event,player){
        return event.num>0&&
            player.hp>player.maxHp*0.5&&
            event.player!=player&&
            event.source!=player&&
            _status.currentPhase!=event.player&&
            event.player.isAlive()
    },
                check:function (event,player){
        return get.attitude(player,event.player)>2;
    },
                content:function (){
        "step 0"
        player.loseHp();
        "step 1"
        player.line(trigger.player,'green');
        trigger.player.draw(2);
        "step 2"
        player.draw();
    },
                group:"圣_fenji_recover",
                subSkill:{
                    recover:{
                        trigger:{
                            player:"phaseEnd",
                        },
                        forced:true,
                        filter:function (event,player){
            return player.hp<player.maxHp*0.5;
        },
                        content:function (){
            player.recover();
        },
                        sub:true,
                    },
                },
            },
            "圣_hunqu":{
                audio:"ext:混沌界:2",
                trigger:{
                    player:"dying",
                },
                forced:true,
                priority:100,
                content:function (){
        "step 0"
        player.chooseControl('heart','diamond','spade','club').set('prompt','请选择一种花色').set('ai',function(event){
            switch(Math.floor(Math.random()*6)){
                case 0:return 'heart';
                case 1:case 4:case 5:return 'diamond';
                case 2:return 'club';
                case 3:return 'spade';
            }
        });
        "step 1"
        game.log(player,'选择了'+get.translation(result.control)+'花色');
        trigger.player.popup(result.control);
        var cardPileFirstCard=get.cards(1);
        player.showCards(cardPileFirstCard);
        if(get.suit(cardPileFirstCard)==result.control){
        event.finish();
        }
        else{
        player.hp=Math.min(1,player.maxHp); 
        player.gain(cardPileFirstCard);
        };
    },
            },
            
            "圣_quanheng":{
                audio:"ext:混沌界:2",
                enable:"phaseUse",
                usable:1,
                locked:true,
                notemp:true,
                marktext:"衡",
                intro:{
                    content:"cards",
                },
                onremove:function (player){
                    player.storage.圣_quanheng=[];
                    },
                init:function (player){
        player.storage.圣_quanheng=[];
    },
                filterCard:true,
                selectCard:[1,Infinity],
                position:"he",
                prompt:"请将至少一张牌置于武将牌旁",
                filter:function (event,player){
        return player.countCards('he');
    },
                content:function (){
        "step 0"
            player.lose(cards,ui.special);
            player.storage.圣_quanheng=player.storage.圣_quanheng.concat(cards);
            player.syncStorage('圣_quanheng');
            player.markSkill('圣_quanheng');
            event.num=cards.length; 
            game.log(player,'将',cards,'置于武将牌上称为','#y“衡”');
         "step 1"    
         player.chooseTarget(get.prompt('圣_quanheng'),'令任意一名角色摸/弃'+get.cnNumber(event.num)+'张牌').set('ai',function(target){
            var player=_status.event.player;
            if(get.attitude(player,target)>0){
                return get.recoverEffect(target,player,player)+1;
            }
            return 0;
        });
         "step 2"
         if(result.bool){
         event.target=result.targets[0];
         if(event.target.countCards('he')){
             player.chooseControl('摸'+get.cnNumber(event.num)+'张牌','弃'+get.cnNumber(event.num)+'张牌').set('prompt','令'+get.translation(event.target)+'摸/弃牌');
         }else{
             event.target.draw(event.num);
             event.finish();
         }}
        "step 3"
        if(result.index==0){
            player.line(event.target);
            event.target.draw(event.num);
        }
        if(result.index==1){
            player.line(event.target);
            event.target.chooseToDiscard('he',event.num,true).set('ai',function(card){
            return 6-get.useful(card);
        });
        }
        "step 4"
        if(event.target!=player&&event.target.hp+event.target.countCards('h')>player.hp+player.countCards('h')){
            event.target.turnOver();
            event.target.loseHp();
            if(player.storage.圣_quanheng.length>event.target.countCards('h')){
                player.draw(player.storage.圣_quanheng.length-event.target.countCards('h'));
            }
        }
    },
             ai:{
             result:{
                        player:1,
                    },
                 },
            },
            "圣_yuanju":{
                trigger:{
                    player:"recoverBegin",
                },
                forced:true,
                direct:true,
                priority:-1,
                check:function (event,player){
      return player.hp<=player.maxHp*0.5;
      },
                filter:function (event,player){
        return player.isDamaged()&&
            player.maxHp-player.hp>event.num&&
        player.storage.圣_quanheng.length;
    },
                content:function (){
        "step 0"
        player.chooseCardButton('是否移除至多'+get.translation(player.maxHp-player.hp-trigger.num)+'张“衡”并额外恢复等量体力值？',player.storage.圣_quanheng,[1,player.maxHp-player.hp-trigger.num]);
        "step 1"
        if(result.bool){
            player.storage.圣_quanheng.remove(result.links);
            player.markSkill('圣_quanheng');
            player.syncStorage('圣_quanheng');
            trigger.num+=result.links.length;
        }
    },
            },
            "圣_juelue":{
                skillAnimation:true,
                animationColor:"wood",
                audio:"ext:混沌界:2",
                unique:true,
                trigger:{
                    player:"phaseBegin",
                },
                init:function (player){
        player.storage.圣_juelue=0;
        player.storage.圣_juelue1=0;
    },
                derivation:["圣_hongmou","圣_zhilue","圣_jiahe","圣_hunchen"],
                filter:function (event,player){
        return player.hasSkill('圣_quanheng')&&
            player.storage.圣_quanheng.length>=game.countPlayer()&&
            player.storage.圣_juelue1>0;
    },
                forced:true,
                priority:100,
                content:function (){
        "step 0"  
        if(player.storage.圣_juelue1==2){
            event.targets=game.filterPlayer();
            event.targets.sort(lib.sort.seat);
        }
        "step 1"
        if(player.storage.圣_juelue1==2){
            if(event.targets.length){
            var target=event.targets.shift();
            if(player.getEnemies().contains(target)&&!target.isLinked()){
                target.draw();
                player.storage.圣_juelue++;
                player.syncStorage('圣_juelue');
                target.link();
                player.line(target,'green');
            }
            event.redo();
        }
        }
        "step 2"
        if(player.storage.圣_juelue1==1){
            event.targets=game.filterPlayer();
        event.targets.remove(player.getEnemies());
        event.targets.sort(lib.sort.seat);
        }
        "step 3"
        if(player.storage.圣_juelue1==1){
        if(event.targets.length){
            var target=event.targets.shift();
            if(!target.isLinked()){
                target.draw();
                player.storage.圣_juelue++;
                player.syncStorage('圣_juelue');
                target.link();
                player.line(target,'green');
            }
            event.redo();
        }}
        "step 4"
        if(player.storage.圣_quanheng.length>0){
        player.chooseCardButton('选择并获得至多'+get.translation(player.storage.圣_juelue)+'张“衡”',[1,player.storage.圣_juelue],player.storage.圣_quanheng,true);
        }
        "step 5"
        if(result.bool){
            player.gain(result.links,'fromStorage');
            player.storage.圣_quanheng.remove(result.links);
            player.markSkill('圣_quanheng');
            player.syncStorage('圣_quanheng');
          }
        "step 6"
        if(player.storage.圣_juelue1==2){
            player.addSkill('圣_hongmou');
            player.addSkill('圣_zhilue');
        }
        "step 7"
        if(player.storage.圣_juelue1==1){
            player.addSkill('圣_jiahe');
            player.addSkill('圣_hunchen');
        }
        "step 8"
        player.removeSkill('圣_quanheng');
        player.removeSkill('圣_yuanju');
        player.awakenSkill('圣_juelue');
    },
                group:["圣_juelue_core","圣_juelue_copy"],
                subSkill:{
                    core:{
                        trigger:{
                            player:"damageEnd",
                        },
                        forced:true,
                        direct:true,
                        priority:-1,
                        filter:function (event,player){
        return event.num>0;
    },
                        content:function (){
             player.storage.圣_juelue1==1;
    },
                        sub:true,
                    },
                    copy:{
                        trigger:{
                            source:"damageEnd",
                        },
                        forced:true,
                        direct:true,
                        priority:1,
                        filter:function (event,player){
        return event.num>0
    },
                        content:function (){
            player.storage.圣_juelue1==2;
    },
                        sub:true,
                    },
                },
            },
            "圣_hongmou":{
                audio:"ext:混沌界:2",
                enable:"phaseUse",
                usable:1,
                locked:true,
                notemp:true,
                marktext:"谋",
                intro:{
                    content:"cards",
                },
                onremove:function (player){
                    player.storage.圣_hongmou=[];
                    },
                init:function (player){
        player.storage.圣_hongmou=[];
    },
                content:function (){
        "step 0"
        player.addTempSkill('圣_hongmou_mark');
        "step 1"
        if(player.storage.圣_hongmou.length>0){
            player.gain(player.storage.圣_hongmou,'fromStorage',player,'giveAuto');
            game.addVideo('storage',player,['圣_hongmou',get.cardsInfo(player.storage.圣_hongmou),'cards']);
            player.draw(player.hp);
        }else{
            player.draw(player.hp);
        }
        "step 2"
        if(player.storage.圣_hongmou.length>0){
            player.storage.圣_hongmou=[];
            player.markSkill('圣_hongmou');
            player.syncStorage('圣_hongmou');
        }
        "step 3"
        if(player.countCards('he')){
            player.chooseCard('请将至少'+get.cnNumber(player.hp)+'张牌置于武将牌上称为“谋”',true,'he',[player.hp,player.countCards('he')]);
        }
        else{
           event.finish(); 
        }
        "step 4"
        if(result.cards&&result.cards.length){
            player.$give(result.cards.length,player);
            player.lose(result.cards,ui.special);
            player.storage.圣_hongmou=player.storage.圣_hongmou.concat(result.cards);
            player.syncStorage('圣_hongmou');
            player.markSkill('圣_hongmou');
            game.log(player,'将',result.cards,'置于武将牌上称为','#y“谋”');
        }
    },
                 ai:{
                   result:{
                        player:1,
                    },
               },
                subSkill:{
                    mark:{
                        sub:true,
                    },
                },
            },
            "圣_zhilue":{
            audio:"ext:混沌界:2",
                enable:"phaseUse",
                locked:true,
                direct:true,
                delay:false,
                filter:function (event,player){
        return player.storage.圣_hongmou.length>=2&&
            player.hasSkill('圣_hongmou_mark')&&
            game.hasPlayer(function(current){
            return current!=player&&!current.hasSkill('圣_zhilue_mark');
        });
    },
                content:function (){
        "step 0"
        player.chooseCardButton('请选择任意两张“谋”',2,player.storage.圣_hongmou);
        "step 1"
        if(result.bool){
            event.cards=result.links;
            player.chooseTarget('请选择一名其他角色，令其获得'+get.translation(event.cards),true,function(card,player,target){
            return player!=target&&!target.hasSkill('圣_zhilue_mark');
        });
        }else{event.finish();}
        "step 2"
        if(result.bool){
            event.target=result.targets[0];
            player.line(event.target);     
            player.logSkill('圣_zhilue',event.target);     
        }
        "step 3"
        if(result.bool){
            event.target.gain(event.cards,'fromStorage','giveAuto',player);
            player.storage.圣_hongmou.remove(event.cards);
            player.markSkill('圣_hongmou');
            player.syncStorage('圣_hongmou');
        }
        "step 4"
        if(result.bool){
            event.target.showHandcards();
        }
        "step 5"
        if(event.bool){
        if(event.target.isLinked()){
            event.target.addTempSkill('圣_zhilue_mark');
            event.target.damage('fire');
        }else{
            event.target.link(true);
        }
     }
    },        
                ai:{
                result:{
                        player:1,
                    },
                },
                subSkill:{
                    mark:{
                        sub:true,
                    },
                },
            },
            "圣_jiahe":{
                audio:"ext:混沌界:2",
                trigger:{
                    player:"damageEnd",
                },
                forced:true,
                priority:-1,
                filter:function (event,player){
        return event.source&&event.num>0&&
            event.source!=player&&
            player.countCards('h')&&
            !event.source.hasSkill('圣_jiahe_mark');
    },
                content:function (){
        player.line(trigger.source);
        trigger.source.addSkill('圣_jiahe_mark');
        player.addSkill('圣_jiahe_from');
        trigger.source.storage.圣_jiahe_mark=player;
        player.storage.圣_jiahe_from=trigger.source;
        trigger.source.gainPlayerCard(player,'h',true);
    },
                group:"圣_jiahe_sha",
                subSkill:{
                    mark:{
                        mark:true,
                        marktext:"嘉",
                        onremove:true,
                        unique:true,
                        charlotte:true,
                        intro:{
                            content:"该角色与$的距离视为1但无法对其使用【杀】",
                        },
                        mod:{
                            globalFrom:function (from,to){
                    if(to==from.storage.圣_jiahe_mark){
                        return -Infinity;
                    }
                },
                        },
                        sub:true,
                    },
                    from:{
                        mod:{
                            globalFrom:function (from,to){
                    if(to==from.storage.圣_jiahe_from){
                        return -Infinity;
                    }
                },
                        },
                        sub:true,
                    },
                    sha:{
                        mod:{
                            targetEnabled:function (card,player,target){
            if(card.name=='sha'&&player!=target&&
               player.hasSkill('圣_jiahe_mark')&&
               target.isEmpty(2)) return false;
        },
                        },
                        trigger:{
                            global:"damageEnd",
                        },
                        forced:true,
                        filter:function (event,player){
                return event.num>0&&event.player!=player&&
                    player.countCards('he')&&
                    event.player.hasSkill('圣_jiahe_mark');
            },
                        content:function (){
                "step 0"
                player.chooseCard('交给'+get.translation(trigger.player)+'一张牌','he',true);
                "step 1"
                if(result.bool&&result.cards&&result.cards.length){
                trigger.player.gain(result.cards,player,'giveAuto');
        }
            },
                        sub:true,
                    },
                },
            },
            "圣_hunchen":{
            audio:"ext:混沌界:2",
                enable:"phaseUse",
                usable:1,
                locked:true,
                filter:function (event,player){
        return player.isDamaged();
    },
                content:function (){
        "step 0"
        if(!player.countCards('h')){
            player.draw(player.maxHp-player.hp);
        }else{
            player.draw(player.maxHp-player.hp);
            player.chooseToDiscard('he',player.maxHp-player.hp,true).set('ai',function(card){
            return 6-get.useful(card);
        });
        }
        "step 1"
        event.targets=game.filterPlayer();
        event.targets.sort(lib.sort.seat);
        "step 2"
        if(event.targets.length){
            var target=event.targets.shift();
            if(get.distance(player,target)<=1&&target!=player){
                if(target.hasSkill('圣_jiahe_mark')){
                    target.removeSkill('圣_jiahe_mark');
                    player.removeSkill('圣_jiahe_from');
                };
                player.line(target,'fire');
                target.damage(player);
            }
            event.redo();
        }
    },
                group:"圣_hunchen_damage",
                subSkill:{
                    damage:{
                    audio:"ext:混沌界:2",
                        trigger:{
                            player:"damageEnd",
                        },
                        forced:true,
                        priority:1,
                        filter:function (event,player){
        return event.num>0&&event.source&&player.isDamaged();
    },
                        content:function (){
        "step 0"
        if(!player.countCards('h')){
            player.draw(player.maxHp-player.hp);
        }else{
            player.draw(player.maxHp-player.hp);
            player.chooseToDiscard('he',player.maxHp-player.hp,true).set('ai',function(card){
            return 6-get.useful(card);
        });
        }
        "step 1"
        event.targets=game.filterPlayer();
        event.targets.sort(lib.sort.seat);
        "step 2"
        if(event.targets.length){
            var target=event.targets.shift();
            if(player!=target&&target!=trigger.source&&get.distance(player,target)<=1){
                if(target.hasSkill('圣_jiahe_mark')){
                    target.removeSkill('圣_jiahe_mark');
                    player.removeSkill('圣_jiahe_from');
                };
                player.line(target,'fire');
                target.damage(trigger.source);
            }
            event.redo();
        }
    },
                        sub:true,
                    },
                },
            },
            
            "圣_jianxiong":{
                audio:"ext:混沌界:2",
                trigger:{
                    player:"damageEnd",
                },
                forced:true,
                direct:true,
                priority:-1,
                filter:function (event,player){
        return get.itemtype(event.cards)=='cards'&&get.position(event.cards[0])=='d';
    },
                content:function (){
        "step 0"
        player.gain(trigger.cards);
        player.$gain2(trigger.cards);
        "step 1"
        trigger.source.showHandcards();
        "step 2"
        player.chooseTarget(get.prompt('圣_jianxiong'),function(card,player,target){
            return _status.event.source!=target&&_status.event.player!=target;
        }).set('source',trigger.source).set('ai',function(target){
            return -get.attitude(_status.event.player,target);
        });
        "step 3"
        if(result.bool){
            player.logSkill('圣_jianxiong',result.targets);
            event.target=result.targets[0]
            event.target.draw(); 
            event.target.chooseToUse({name:'sha'},'对'+get.translation(trigger.source)+'使用一张【杀】或取消并失去一点体力',trigger.source,-1);
         }else{event.finish();}
        "step 4"
        if(result.bool==false){
        event.target.loseHp();
        }
    },
                ai:{
                    maixie:true,
                    "maixie_hp":true,
                    effect:{
                        target:function (card,player,target){
                if(player.hasSkillTag('jueqing',false,target)) return [1,-1];
                if(get.tag(card,'damage')) return [1,0.55];
            },
                    },
                },
            },
            "圣_baquan":{
                trigger:{
                    player:['chooseToRespondBegin','chooseToUseBegin']
                },
                forced:true,
                direct:true,
                filter:function (event,player){
					if(!_status.currentPhase) return false;
					if(event.responded) return false;
					if(!event.filterCard({name:'shan'},player,event)) return false;
					if(event.name!='chooseToUse'&&!lib.filter.cardRespondable({name:'shan'},player,event)) return false;
					return true;
				},
                content:function (){
        "step 0"
        player.chooseTarget(get.prompt('圣_baquan'),function(card,player,target){
            if(target==player||target==trigger.parent.player) return false;
            var nh=target.countCards('h');
            if(nh==0) return false;
            if(get.is.altered('圣_baquan')){
                return nh<=player.countCards('h');
            }
            return true;
        }).ai=function(target){
            return 1-get.attitude(player,target);
        };
        "step 1"
        if(result.bool){
            var target=result.targets[0];
            player.logSkill('圣_baquan',target);
            event.target=target;
            var cards=target.getCards('h');
            player.chooseCardButton('选择'+get.translation(target)+'的一张【闪】打出',cards).filterButton=function(button){
                return trigger.filterCard(button.link);
            }
        }
        else{
            event.finish();
        }
        "step 2"
        if(result.bool){
            game.log(player,'使用了',event.target,'的手牌');
            event.target.$throw(result.links);
            event.target.lose(result.links);
            trigger.untrigger();
            trigger.animate=false;
            trigger.responded=true;
            result.buttons[0].link.remove();
            trigger.result={bool:true,card:result.buttons[0].link}
        }
        else{
            event.finish();
        }
    },
                ai:{
                    effect:{
                        target:function (card){
                if(get.tag(card,'respondShan')) return 0.4;
                if(get.tag(card,'respondSha')) return 0.4;
            },
                    },
                },
            },
            "圣_guixin":{
                audio:"ext:混沌界:2",
                trigger:{
                    player:["damageEnd","loseHpEnd","recoverEnd"],
                },
                locked:true,
                priority:-1,
                filter:function (event,player){
        return event.num>0;
    },
                content:function (){
        "step 0"
        player.draw();
        "step 1"
        var targets=game.filterPlayer();
        targets.remove(player);
        targets.sort(lib.sort.seat);
        event.targets=targets;
        event.count=trigger.num;
        "step 2"
        event.num=0;
        player.line(targets,'thunder');
        "step 3"
        if(event.num<event.targets.length){
            if(event.targets[event.num].countGainableCards(player,'hej')){
                player.gainPlayerCard(event.targets[event.num],true,'hej');
            }       
            event.num++;
            event.redo();
        }
        "step 4"
        player.turnOver();
        "step 5"
        player.chooseControl('防御距离','进攻距离');
        "step 6"
        if(result.index==0){
         player.storage.圣_feiying_To++;
        player.markSkill('圣_feiying_To');
        player.syncStorage('圣_feiying_To');
        }
        else{
        player.storage.圣_feiying_From++;
        player.markSkill('圣_feiying_From');
        player.syncStorage('圣_feiying_From');
        }
        "step 7"
        event.count--;
        if(event.count>0){
            player.chooseBool(get.prompt2('圣_guixin'));
        }else{
            event.finish();
        }
        "step 8"
        if(event.count>0){
            event.goto(3);
        }
    },
                ai:{
                    maixie:true,
                    "maixie_hp":true,
                    threaten:function (player,target){
            if(target.hp==1) return 2.5;
            return 1;
        },
                    effect:{
                        target:function (card,player,target){
                if(get.tag(card,'damage')){
                    if(player.hasSkillTag('jueqing',false,target)) return [1,-2];
                    if(target.hp==1) return 0.8;
                    if(target.isTurnedOver()) return [0,3];
                    var num=game.countPlayer(function(current){
                        if(current.countCards('he')&&current!=player&&get.attitude(player,current)<=0){
                            return true;
                        }
                        if(current.countCards('j')&&current!=player&&get.attitude(player,current)>0){
                            return true;
                        }
                    });
                    if(num>2) return [0,1];
                    if(num==2) return [0.5,1];
                }
            },
                    },
                },
            },
            "圣_weiwu":{
                audio:"ext:混沌界:2",
                trigger:{
                    global:"phaseBefore",
                },
                forced:true,
                priority:100,
                skillAnimation:"epic",
                animationColor:"thunder",
                derivation:["圣_lieya","圣_feiying","圣_guixin"],
                filter:function (event,player){
        return event.player.isDamaged()&&
            event.player.countCards('he')>player.countCards('he')&&
            event.player.hp<player.hp;
    },
                content:function (){
        "step 0"
        player.chooseToDiscard('j',Infinity,true);
        player.link(false);
        player.turnOver(false);
        player.unMad();
        player.enableEquip(1);
        player.enableEquip(2);
        player.enableEquip(3);
        player.enableEquip(4);
        player.enableEquip(5);
        "step 1"
        player.line(trigger.player,'thunder');
        trigger.player.recover();
        player.gainPlayerCard(trigger.player,'hej',Infinity,true);
        "step 2"
        player.removeSkill('圣_jianxiong');
        player.removeSkill('圣_baquan');
        player.addSkill('圣_lieya');
        player.addSkill('圣_feiying');
        player.addSkill('圣_guixin');
        player.awakenSkill('圣_weiwu');
    },
            },
            "圣_feiying":{
                mod:{
                    globalFrom:function (from,to,distance){
            return distance-=(from.storage.圣_feiying_From);
        },
                    globalTo:function (from,to,distance){
            return distance+=(to.storage.圣_feiying_To);
        },
                },
                trigger:{
                    player:"phaseBegin",
                },
                forced:true,
                priority:100,
                content:function (){
        "step 0"
        player.chooseControl('防御距离','进攻距离');
        "step 1"
        if(result.index==0){
         player.storage.圣_feiying_To++;
        player.markSkill('圣_feiying_To');
        player.syncStorage('圣_feiying_To');
        }
        else{
        player.storage.圣_feiying_From++;
        player.markSkill('圣_feiying_From');
        player.syncStorage('圣_feiying_From');
        }
    },
                group:["圣_feiying_Zero","圣_feiying_From","圣_feiying_To"],
                subSkill:{
                    Zero:{
                        trigger:{
                            player:"phaseBefore",
                        },
                        direct:true,
                        forced:true,
                        priority:100,
                        content:function (){
                "step 0"
                player.storage.圣_feiying_From=0;
        player.markSkill('圣_feiying_From');
        player.syncStorage('圣_feiying_From');
                "step 1"
                player.storage.圣_feiying_To=0;
        player.markSkill('圣_feiying_To');
        player.syncStorage('圣_feiying_To');
        },
                        sub:true,
                    },
                    From:{
                    marktext:"影",
                    locked:true,
                        intro:{
                            content:function (storage){
                        if(storage>0) return '你的进攻距离+'+storage;
                        if(storage<0) return '你的进攻距离'+storage;
                        return '你的进攻距离无变化';
                    },
                        },
                        init:function (player){
        player.storage.圣_feiying_From=0;
    },
                        sub:true,
                    },
                    To:{
                    marktext:"影",
                    locked:true,
                        intro:{
                            content:function (storage){
                        if(storage>0) return '你的防御距离+'+storage;
                        if(storage<0) return '你的防御距离'+storage;
                        return '你的防御距离无变化';
                    },
                        },
                        init:function (player){
        player.storage.圣_feiying_To=0;
    },
                        sub:true,
                    },
                },
            },
            "圣_lieya":{
                audio:"ext:混沌界:2",
                enable:"phaseUse",
                usable:1,
                locked:true,
                discard:false,
                position:"he",
                prepare:"give2",
                filterCard:true,
                selectTarget:true,
                filterTarget:function (event,player,target){
        return target.sex=='female'&&target!=player;
    },
                filter:function (event,player){
        return player.countCards('he')>0;
    },
                check:function (card){
        if(card.name=='du') return 20;
        return 6-get.value(card);
    },
                content:function (){
        "step 0"
        target.gain(cards,player).delay=false;
         "step 1"
        player.gainPlayerCard(target,'hej',true);
        "step 2"
        player.storage.圣_lieya_mark=target;
        player.addTempSkill('圣_lieya_mark');
        "step 3"
        event.targets=game.filterPlayer();
        event.targets.remove(player);
        event.targets.remove(target);
        for(var i=0;i<event.targets.length;i++){
            if(event.targets[i].sex!='male'){
                event.targets.splice(i--,1);
            }
        }
        "step 4"
        if(event.targets.length){
            event.current=event.targets.shift();
            if(event.current.countCards('he')&&target.isAlive()){
                event.current.chooseToUse({name:'sha'},player,-1);
            }
        }
        else{
            event.finish();
        }
        "step 5"
        event.goto(4);
    },
                ai:{
                    order:4,
                    result:{
                        player:function (player,target){
                if(get.distance(player,target)<=1) return 0;
                var hs=player.getCards('h','shunshou');
                if(hs.length&&player.canUse(hs[0],target,false)){
                    return 1;
                }
                var geteff=function(current){
                    return player.canUse('sha',current,false,true)&&get.effect(current,{name:'sha'},player,player)>0;
                }
                if(player.hasSha()&&geteff(target)){
                    var num=game.countPlayer(function(current){
                        return current!=player&&get.distance(player,current)<=1&&geteff(current);
                    });
                    if(num==0){
                        if(game.hasPlayer(function(current){
                            return player.canUse('sha',current)&&geteff(current)&&current!=target;
                        })){
                            return 1;
                        }
                    }
                    else if(num==1){
                        return 1;
                    }
                }
                return 0;
            },
                    },
                },
                subSkill:{
                    mark:{
                        mark:"character",
                        onremove:true,
                        unique:true,
                        charlotte:true,
                        intro:{
                            content:"本回合内与$的距离计算视为1",
                        },
                        mod:{
                            globalFrom:function (from,to){
                    if(to==from.storage.圣_lieya_mark){
                        return -Infinity;
                }
              },
                        },
                        sub:true,
                    },
                },
            },
            "圣_chouce":{
                audio:"ext:混沌界:4",
                trigger:{
                    player:"judgeAfter",
                },
                forced:true,
                priority:-1,
                content:function (){
        'step 0'
        if(get.color(trigger.result.card)=='red'){
            player.draw();
        }else{
            player.gain(trigger.result.card,'gain2');
        }
        'step 1'
        if(get.color(trigger.result.card)=='red'){
        player.chooseTarget('【筹策】：是否令一名角色获得'+get.translation(trigger.result.card)+'？').set('ai',function(target){
							var player=_status.event.player;
							var att=get.attitude(player,target)/Math.sqrt(1+target.countCards('h'));
							if(target.hasSkill('圣_xianfu_mark')) return att*2;
							return att;
						})
        }else{
        player.chooseTarget('【筹策】：是否弃置一名其他角色区域内的一张牌？',function(card,player,target){
            return player!=target&&target.countCards('hej')>0;
        }).set('ai',function(target){
							var player=_status.event.player;
							var att=get.attitude(player,target);
							if(att<0){
								att=-Math.sqrt(-att);
							}
							else{
								att=Math.sqrt(att);
							}
							return att*lib.card.guohe.ai.result.target(player,target);
						})
        }
       'step 2'
       if(result.bool){
           player.line(result.targets[0]);
           if(get.color(trigger.result.card)=='red'){
               result.targets[0].gain(trigger.result.card,'gain2');
               if(result.targets[0].hasSkill('圣_xianfu_mark')&&result.targets[0].isDamaged()){
                   result.targets[0].recover();
                   player.judge();
               }
           }else{
               player.discardPlayerCard('请弃置'+get.translation(result.targets[0])+'一张牌',result.targets[0],'hej',true);
               if(!result.targets[0].hasSkill('圣_xianfu_mark')&&!result.targets[0].isDamaged()){
                   result.targets[0].loseHp();
                   player.judge();
               }
           }
       }else{
       event.finish();
       }
    },
            },
            "圣_tianji":{
                trigger:{
                    player:"damageEnd",
                },
                forced:true,
                filter:function (event,player){
        return event.num>0;
    },
                content:function (){
        'step 0'
        event.num=trigger.num;
        'step 1'
        player.judge();
        'step 2'
        event.num--;
        'step 3'
        if(event.num>0){
            event.goto(1);
        }
        'step 4'
        if(trigger.source&&trigger.source.hasSkill('圣_xianfu_mark')){
            player.line(trigger.source);
            trigger.source.removeSkill('圣_xianfu_mark');
            player.loseHp();
            player.judge();
        }
    },
                group:"圣_tianji_recover",
                subSkill:{
                    recover:{
                        trigger:{
                            player:"recoverEnd",
                        },
                        forced:true,
                        direct:true,
                        filter:function (event,player){
        return event.num>0;
    },
                        content:function (){
                        'step 0'
        event.num=trigger.num;
        'step 1'
        player.judge();
        'step 2'
        event.num--;
        'step 3'
        if(event.num>0){
            event.goto(1);
        }
      },
                        sub:true,
                    },
                },
            },
            "圣_xianfu":{
                audio:"ext:混沌界:2",
                skillAnimation:true,
                animationColor:"thunder",
                trigger:{
                    global:"gameDrawAfter",
                    player:"phaseBegin",
                },
                direct:true,
                forced:true,
                filter:function (){
        return game.players.length>1;
    },
                content:function (){
        'step 0'
        player.chooseTarget(get.prompt2('圣_xianfu'),function(card,player,target){
            return target!=player&&!target.hasSkill('圣_xianfu_mark');
        }).set('ai',function(target){
            var att=get.attitude(_status.event.player,target);
            if(att>0) return att+1;
            if(att==0) return Math.random();
            return att;
        });
        'step 1'
        if(result.bool){
            player.logSkill('圣_xianfu',result.targets[0]);
            player.line(result.targets[0],'thunder');
            result.targets[0].addSkill('圣_xianfu_mark');
        }
    },
                group:["圣_xianfu_die","圣_xianfu_damage","圣_xianfu_recover"],
                subSkill:{
                    mark:{
                        mark:true,
                        marktext:"辅",
                        intro:{
                            content:"该角色已成为$的“先辅”目标",
                        },
                        sub:true,
                    },
                    die:{
                    trigger:{
                            global:"dieBegin",
                        },
                        forced:true,
                        filter:function (event,player){
                return event.player!=player&&event.player.hasSkill('圣_xianfu_mark');
            },
                        content:function (){
                trigger.player.removeSkill('圣_xianfu_mark');
            },
                    },
                    recover:{
                    audio:"ext:混沌界:2",
                        trigger:{
                            global:"recoverEnd",
                        },
                        forced:true,
                        filter:function (event,player){
                return event.player!=player&&player.isDamaged()&&event.player.hasSkill('圣_xianfu_mark');
            },
                        content:function (){
                trigger.player.line(player,'thunder');
                player.recover(trigger.num);
            },
                        sub:true,
                    },
                    damage:{
                    audio:"ext:混沌界:2",
                        trigger:{
                            global:"damageEnd",
                        },
                        forced:true,
                        filter:function (event,player){
                return event.player!=player&&event.player.hasSkill('圣_xianfu_mark');
            },
                        content:function (){
                trigger.player.line(player,'fire');
                player.damage(trigger.source,trigger.num);
            },
                        sub:true,
                    },
                },
            },
            "ssb_szt_damage":{
                trigger:{
                    player:"damageEnd",
                },
                forced:true,
                priority:101,
                filter:function (event,player){
        return event.num>0&&Math.random()<=0.6;
    },
                content:function (){
        player.draw()
    },
            },
            "圣_cangdao":{
                audio:"ext:混沌界:2",
                trigger:{
                    global:"judge",
                },
                filter:function (event,player){
        return player.countCards('hes')>0;
    },
                direct:true,
                content:function (){
        "step 0"
        player.chooseCard(get.prompt('圣_cangdao'),get.translation(trigger.player)+'的'+(trigger.judgestr||'')+'判定为'+
        get.translation(trigger.player.judging[0]),'hes',function(card){
            var player=_status.event.player;
            var mod2=game.checkMod(card,player,'unchanged','cardEnabled2',player);
            if(mod2!='unchanged') return mod2;
            var mod=game.checkMod(card,player,'unchanged','cardRespondable',player);
            if(mod!='unchanged') return mod;
            return true;
        }).set('ai',function(card){
            var trigger=_status.event.getTrigger();
            var player=_status.event.player;
            var judging=_status.event.judging;
            var result=trigger.judge(card)-trigger.judge(judging);
            var attitude=get.attitude(player,trigger.player);
            if(attitude==0||result==0) return 0;
            if(attitude>0){
                return result;
            }
            else{
                return -result;
            }
        }).set('judging',trigger.player.judging[0]);
        "step 1"
        if(result.bool){
            player.respond(result.cards,'highlight','guidao','noOrdering');
        }else{
            event.finish();
        }
        "step 2"
        if(result.bool){
            player.$gain2(trigger.player.judging[0]);
            player.gain(trigger.player.judging[0]);
            trigger.player.judging[0]=result.cards[0];
            trigger.orderingCards.addArray(result.cards);
            game.log(trigger.player,'的判定牌改为',result.cards[0]);
            player.draw();
            if(get.color(result.cards[0])=='black'){
          player.chooseTarget('【苍道】：是否将一名其他角色横置？',function(card,player,target){
         return target!=player&&!target.isLinked();
        }).ai=function(target){
            return get.damageEffect(target,_status.event.player,_status.event.player,'thunder');
        };
            }else{
             event.finish();
         }
        }
        "step 3"
        if(result.bool){
            result.targets[0].link(true);
        }
    },
                ai:{
                    rejudge:true,
                    tag:{
                        rejudge:1,
                    },
                },
            },
            "圣_shenshu":{
                trigger:{
                    global:"damageBegin",
                },
                forced:true,
                filter:function (event,player){
        return event.player!=player&&
            event.player.isDamaged()&&
            event.player.isAlive()&&
            !event.player.isLinked();
    },
                content:function (){
        trigger.player.recover();
        trigger.player.link(true);
    },
            },
            "圣_leiyu":{
                audio:"ext:混沌界:2",
                trigger:{
                    player:["useCard","respond"],
                },
                filter:function (event,player){
        return event.card.name=='shan';
    },
                forced:true,
                direct:true,
                content:function (){
        "step 0";
        player.chooseTarget(get.prompt2('圣_leiyu'),function(card,player,target){
         return target!=player;
        }).ai=function(target){
            if(target.hasSkill('hongyan')) return 0;
            return get.damageEffect(target,_status.event.player,_status.event.player,'thunder');
        };
        "step 1"
        if(result.bool){
            event.num=0;
            player.logSkill('圣_leiyu',result.targets,'thunder');
            event.target=result.targets[0];
        }else{
            event.finish();
        }
        "step 2"
        event.num++;
        player.logSkill('圣_leiyu',event.target,'thunder');
        event.target.judge(function(card){
            if(get.color(card)=='black') return -4;
            return 0;
        });
        "step 3"
        if(result.bool==false){
            event.target.damage(event.num,'thunder');
        }else{event.finish();}
        "step 4"
        if(event.target.isAlive()){
            event.goto(2);
            }
    },
                ai:{
                    mingzhi:false,
                    useShan:true,
                    effect:{
                        target:function (card,player,target,current){
                if(get.tag(card,'respondShan')){
                    var hastarget=game.hasPlayer(function(current){
                        return get.attitude(target,current)<0;
                    });
                    if(target.countCards('h','shan')&&target.countCards('e',{suit:'spade'})){
                        return [0,hastarget?target.countCards('he')/2:0];
                    }
                    if(target.countCards('h','shan')){
                        return [1,hastarget?target.countCards('he')/2:0];
                    }
                    return [1,target.countCards('h')/4];
                }
            },
                    },
                },
            },
            "圣_yingyuan":{
                audio:"ext:混沌界:2",
                enable:"phaseUse",
                locked:true,
                position:"he",
                usable:1,
                filterCard:true,
                selectCard:[1,Infinity],
                filter:function (event,player){
        return player.countCards('he')>0;
    },
                content:function (){
        'step 0'
        event.num=cards.length;
        event.num1=0;
        player.draw(event.num);
        'step 1'
        player.chooseTarget('【应援】：请选择至多'+get.cnNumber(event.num)+'位其他角色',[1,event.num],true,function(card,player,target){
            return player!=target
        })
        'step 2'
        if(result.bool){
            event.targets=result.targets;
      }else{event.finish();}
        'step 3'
        player.line(event.targets[event.num1])
        player.chooseCard('【应援】：请交给'+get.translation(event.targets[event.num1])+'一张牌','he',true);
        'step 4'
        event.targets[event.num1].gain(result.cards[0],player,'giveAuto');
        if(event.num1<event.targets.length-1){
            event.num1++;
            event.goto(3);
        }else{
            event.num1=0;
        }
        'step 5'
        if(event.targets[event.num1].countCards('h')>player.countCards('h')){
            event.targets[event.num1].line(player);
            event.targets[event.num1].chooseCard('【应援】：请选择交给'+get.translation(player)+'一张牌','he',true);
            event.goto(7);
            }else{
                if(event.targets[event.num1].countCards('h')<player.countCards('h')){
                   event.targets[event.num1].draw();
                }
            }
        'step 6'
        if(event.num1<event.targets.length-1){
            event.num1++;
            event.goto(5);
        }else{
            event.finish();
        }
        'step 7'
       player.gain(result.cards[0],event.targets[event.num1],'giveAuto');
        event.goto(6);
    },
            },
            "圣_naman":{
                audio:"ext:混沌界:2",
                trigger:{
                    target:"useCardToTargeted",
                },
                forced:true,
                direct:true,
                filter:function (event,player){
        return player.countCards('he')&&event.card.name=='sha';;
    },
                content:function (){
        'step 0'
        player.chooseCard(get.prompt('圣_naman'),'交给'+get.translation(trigger.player)+'一张牌','he');
        'step 1'
        if(result.bool){
            player.logSkill('圣_naman');
            trigger.player.gain(result.cards[0],player,'giveAuto');
            player.gain(trigger.cards,'gain2');
            if(trigger.player.hasSkill('圣_naman_mark')){
            player.line(trigger.player);
            trigger.player.damage(player);
            }else{
            trigger.player.addSkill('圣_naman_mark');
            }
        }
    },
                subSkill:{
                    mark:{
                        sub:true,
                    },
                },
            },
            "圣_zishu":{
                trigger:{
                    player:"gainAfter",
                },
                forced:true,
                filter:function (event,player){
        return event.getParent(2).name!='圣_zishu';
    },
                content:function (){
        player.draw();
    },
            },
            "圣_zhendu":{
                trigger:{
                    global:"useCard",
                },
                forced:true,
                priority:-1,
                filter:function (event,player){
        return event.card.name=='jiu'&&
            event.player!=player;
    },
                content:function (){
        trigger.player.loseHp();
        player.addTempSkill('圣_zhendu_target');
    },
    subSkill:{
    target:{
    mod:{
					targetEnabled:function(card){
							if(card.name=='sha') return false;
					}
				},
    },
    },
            },
            "圣_zhenjiu":{
                audio:"ext:混沌界:2",
                trigger:{
                    global:"phaseBegin",
                },
                filter:function (event,player){
        return event.player!=player&&
        player.countCards('he')>0;
    },
                direct:true,
                forced:true,
                priority:100,
                content:function (){
        "step 0"
        var nono=(Math.abs(get.attitude(player,trigger.player))<3);
        if(get.damageEffect(trigger.player,player,player)<=0){
            nono=true
        }
        else if(!trigger.player.countCards('he')){
            nono=true;
        }
        var next=player.chooseToDiscard(get.prompt2('圣_zhenjiu',trigger.player),'he');
        next.set('ai',function(card){
            if(_status.event.nono) return -1;
            return 6-get.useful(card);
        });
        next.set('logSkill',['圣_zhenjiu',trigger.player]);
        next.set('nono',nono);
        "step 1"
        if(result.bool){
            if(trigger.player.countCards('he')){
            player.gainPlayerCard('he',trigger.player,true);
            }
            trigger.player.useCard({name:'jiu'},trigger.player);
        }
    },
                ai:{
                    threaten:2,
                    expose:0.3,
                },
            },
            "圣_qiluan":{
                audio:"ext:混沌界:2",
                trigger:{
                    global:"dieAfter",
                },
                priority:-100,
                forced:true,
                filter:function (event,player){
        return event.player!=player
        &&event.source==undefined||event.source==player;
    },
                content:function (){
        "step 0"
        player.draw(3);
        "step 1"
        player.chooseTarget(get.prompt2('圣_qiluan'),function(card,player,target){
            return player!=target
        })
        "step 2"
        if(result.bool){
            player.line(result.targets[0]);
            result.targets[0].gain(game.createCard('jiu'),'gain2');
        }
    },
            },
            "圣_hanyin":{
            audio:"ext:混沌界:2",
                init:function (player) {
        player.storage.圣_hanyin=0;
    },
                intro:{
                    content:"你当前持有#枚“酣饮”印记",
                },
                trigger:{
                    player:"phaseEnd",
                },
                forced:true,
                priority:99,
                filter:function (event,player){
        return player.countCards('h');
    },
                content:function (){
        'step 0'
        player.chooseToDiscard('h',Infinity,true);
        'step 1'
        player.storage.圣_hanyin+=result.cards.length;
        player.markSkill('圣_hanyin');
        player.syncStorage('圣_hanyin');
    },
                group:["圣_hanyin_source","圣_hanyin_damage"],
                subSkill:{
                    mark:{
                        sub:true,
                    },
                    source:{
                    audio:"ext:混沌界:2",
                        trigger:{
                            source:"damageBegin",
                        },
                        forced:true,
                        filter:function (event,player){
            return player.storage.圣_hanyin>0&&event.card&&event.card.name=='sha';
        },
                        content:function (){
            'step 0'
            player.loseMaxHp();
            if(_status.currentPhase==player){
            player.addSkill('圣_hanyin_mark');
            }
            'step 1'
            player.line(trigger.player);
            trigger.num+=player.storage.圣_hanyin;
        },
                        sub:true,
                    },
                    damage:{
                        trigger:{
                            player:"damageEnd",
                        },
                        forced:true,
                        direct:true,
                        filter:function (event,player){
            return player.storage.圣_hanyin>0;
        },
                        content:function (){
            'step 0'
            player.logSkill('圣_hanyin_source');
            player.loseMaxHp();
            'step 1'
            player.line(trigger.source);
            trigger.source.damage(player.storage.圣_hanyin,player);
        },
                        sub:true,
                    },
                },
            },
            "圣_baling":{
                audio:"ext:混沌界:2",
                enable:"phaseUse",
                locked:true,
                usable:1,
                filterTarget:function (card,player,target){
        return target!=player&&target.countCards('h');
    },
                filter:function (event,player){
        return player.countCards('h',{color:"red"});
    },
                content:function (){
        'step 0'
        target.showHandcards();
        player.gain(target.getCards('h',{color:"black"}),target,'giveAuto');
        'step 1'
        player.showHandcards();
        player.discard(player.getCards('h',{color:"red"}));
        'step 2'
        if(player.countCards('h')>target.countCards('h')){
            player.line(target);
            target.damage(player);
        }else{
            target.line(player);
            player.damage(target);
            if(target.isAlive()&&target.countCards('h')>0){
            player.gain(target.getCards('he'),target,'giveAuto');
            }
        }
    },
            },
            "圣_baolian":{
                trigger:{
                    player:"phaseBegin",
                },
                forced:true,
                filter:function (event,player){
        return player.storage.圣_hanyin>0;
    },
                content:function (){
        player.gainMaxHp(player.storage.圣_hanyin);
    },
                group:"圣_baolian_lose",
                subSkill:{
                    lose:{
                        trigger:{
                            player:"phaseEnd",
                        },
                        forced:true,
                        direct:true,
                        content:function (){
        if(!player.hasSkill('圣_hanyin_mark')){
            if(player.isDamaged()){
            player.logSkill('圣_baolian');
            player.loseMaxHp(player.getDamagedHp());
            }
        }else{
            player.removeSkill('圣_hanyin_mark');
        }
           
    },
                        sub:true,
                    },
                },
            },
            "圣_tieji":{
                audio:"ext:混沌界:2",
                trigger:{
                    player:"useCardToPlayered",
                },
                locked:true,
                priority:100,
                check:function (event,player){
        return get.attitude(player,event.target)<=0;
    },
                filter:function (event,player){
        return event.card.name=='sha';
    },
                logTarget:"target",
                content:function (){
        "step 0"
        player.addTempSkill('unequip','shaAfter');
        if(!trigger.target.hasSkill('圣_tieji_mark')){
        trigger.target.addSkill('圣_tieji_mark');
        }
        trigger.target.addSkill('圣_tieji_buff');
        player.judge(function(card){
            if(get.color(card)=='red') return 1;
            return -1;
            });
        "step 1"
        if(result.color=='red'){
            player.getStat().card.sha--;
            trigger.getParent().directHit.add(trigger.target);
        }else{
        var suit=get.suit(result.card);
        var target=trigger.target;
        var num=target.countCards('h','shan');
        target.chooseToDiscard('请弃置一张'+get.translation(suit)+'牌，否则你失去一点体力','he',function(card){
            return get.suit(card)==_status.event.suit;
        }).set('ai',function(card){
            var num=_status.event.num;
            if(num==0) return 0;
            if(card.name=='shan') return num>1?2:0;
            return 8-get.value(card);
        }).set('num',num).set('suit',suit);
        }
        "step 2"
        if(!result.bool){
            trigger.getParent().excluded.add(trigger.target);
            trigger.target.loseHp();
        }
    },
                subSkill:{
                buff:{
                sub:true,
                },
                    mark:{
                        init:function (player,skill){
        var skills=player.getSkills(true,false);
        for(var i=0;i<skills.length;i++){
           if(get.skills[i]){
                skills.splice(i--,1);                                 
           } 
        }
        player.disableSkill(skill,skills);
    },
                        onremove:function (player,skill){
        player.enableSkill(skill);
    },
                        mark:true,
                        marktext:"骑",
                        locked:true,
                        intro:{
                            content:"该角色所有技能均已失效",
                        },
                        sub:true,
                    },
                },
            },
            "圣_xunxi":{
                mod:{
                    globalFrom:function (from,to,distance){
            if(to.getEquip(3)||to.getEquip(4)) return distance-Infinity;
        },
                },
                trigger:{
                    player:"phaseUseBegin",
                },
                forced:true,
                filter:function (event,player){
        return !player.countCards('h',{name:"sha"})&&
        player.hp>1;
    },
                content:function (){
        "step 0"
        player.loseHp();
        "step 1"
        player.gain(game.createCard('sha'),'gain2');
    },
            },
            "圣_lveji":{
                audio:"ext:混沌界:2",
                trigger:{
                    player:"useCard",
                },
                forced:true,
                direct:true,
                priority:99,
                filter:function (event,player){
        return event.card&&
        event.card.name=='sha'&&
        player.isDamaged();
    },
                content:function (){
        "step 0"
        var num=player.getDamagedHp();
        player.chooseTarget(get.prompt('圣_lveji'),'获得至多'+num+'名其他角色的各一张牌',[1,num],function(card,player,target){
            return target!=player&&target.countCards('he');
        }).set('ai',function(target){
							var player=_status.event.player;
							var att=get.attitude(player,target);
							if(att<0){
								att=-Math.sqrt(-att);
							}
							else{
								att=Math.sqrt(att);
							}
							return att*lib.card.guohe.ai.result.target(player,target);
						})
        "step 1"
        if(result.bool&&result.targets&&result.targets.length){
            player.logSkill('圣_lveji');
            for(var i=0;i<result.targets.length;i++){
               player.line(result.targets[i]);
               player.gainPlayerCard(result.targets[i],'he',true); 
          }
            if(result.targets.length<player.getDamagedHp()){
               player.damage('nosource');
           }else{event.finish();}
        }
        "step 2"
        if(result.bool){
            var list=game.filterPlayer();
        for(var i=0;i<list.length;i++){
            if(list[i]!=player&&list[i].hasSkill('圣_tieji_buff')){
                player.line(list[i]);
                list[i].removeSkill('圣_tieji_mark');
                list[i].removeSkill('圣_tieji_buff');
                list[i].draw();
                list[i].damage(player);
            }
        }
      }
   },
            },
            "圣_xiaoyuan":{
                audio:"ext:混沌界:2",
                enable:"phaseUse",
                usable:1,
                locked:true,
                position:"e",
                filter:function (event,player){
        return player.countCards('e')>0;
    },
                filterCard:true,
                filterTarget:function (card,player,target){
        return target!=player;
    },
                discard:false,
                delay:0,
                lose:false,
                init:function (player){
        player.storage.圣_xiaoyuan=0;
    },
                content:function (){
        "step 0"
            player.$give(cards,target);
            target.equip(cards[0]);
        "step 1"
        if(!target.hasSkill('圣_xiaoyuan_mark')){
        target.addSkill('圣_xiaoyuan_mark');
        player.storage.圣_xiaoyuan++;
        player.markSkill('圣_xiaoyuan');
        player.syncStorage('圣_xiaoyuan');
        }
        "step 2"
        player.draw();
        target.draw();
        "step 3"
        player.gainPlayerCard('h',target,true);
        target.gainPlayerCard('h',player,true);
        "step 4"
       if(target.hp!=player.hp){
       if(target.hp>player.hp){
       player.recover();
       }
       else{
       target.recover();
       }
       }
       else{
       player.recover();
       target.recover();
       }
        
    },
                ai:{
                    order:function (){
            var player=_status.event.player;
            var es=player.getCards('e');
            for(var i=0;i<es.length;i++){
                if(player.countCards('h',{subtype:get.subtype(es[i])})) return 10;
            }
            return 2;
        },
                    result:{
                        target:function (player,target){
                var goon=function(){
                    var es=player.getCards('e');
                    for(var i=0;i<es.length;i++){
                        if(player.countCards('h',{subtype:get.subtype(es[i])})) return true;
                    }
                    return false;
                }
                if(player.hp<target.hp){
                    if(player.isHealthy()){
                        if(!player.needsToDiscard(1)||goon()) return 0.1;
                        return 0;
                    }
                    return 1.5;
                }
                if(player.hp>target.hp){
                    if(target.isHealthy()){
                        if(!player.needsToDiscard(1)||goon()) return 0.1;
                        return 0;
                    }
                    return 1;
                }
                return 0;
            },
                    },
                },
                subSkill:{
                    mark:{
                        mark:false,
                        locked:true,
                        unique:true,
                        charlotte:true,
                        intro:{
                content:"已与该角色“结缘”",
            },
                        sub:true,
                    },
                },
            },
            "圣_xiaoji":{
                trigger:{
                    player:"loseAfter",
                },
                forced:true,
                priority:-1,
                filter:function (event,player){
        for(var i=0;i<event.cards.length;i++){
            if(event.cards[i].original=='e') return true;
        }
        return false;
    },
                content:function (){
        var num=0;
        for(var i=0;i<trigger.cards.length;i++){
            if(trigger.cards[i].original=='e') num+=(1+player.storage.圣_xiaoyuan);
        }
        player.draw(num);
    },
                ai:{
                    noe:true,
                    reverseEquip:true,
                    effect:{
                        target:function (card,player,target,current){
                if(get.type(card)=='equip') return [1,3];
            },
                    },
                },
            },
            "圣_liangzhu":{
                audio:"ext:混沌界:3",
                trigger:{
                    global:"recoverAfter",
                },
                forced:true,
                direct:true,
                priority:-1,
                filter:function (event,player){
        return event.player!=player&&event.player.hp>0;
    },
                content:function (){
        "step 0"
        player.chooseTarget(get.prompt('圣_liangzhu'),'令你或'+get.translation(trigger.player)+'摸两张牌',function(card,player,target){
            return trigger.player==target||player==target;
        })
        "step 1"
        if(result.bool){
            if(result.targets[0]==trigger.player&&result.targets[0].hasSkill('圣_xiaoyuan_mark')){
                player.logSkill('圣_liangzhu',result.targets);
                result.targets[0].draw(2);
                player.draw();
            }
            else{
                player.logSkill('圣_liangzhu',result.targets);
                result.targets[0].draw(2);
            }
            
        }
    },
                ai:{
                    maixie:true,
                    "maixie_hp":true,
                    effect:{
                        target:function (card,player,target){
                if(get.tag(card,'damage')){
                    if(target.hp<=1) return;
                    if(!target.hasFriend()) return;
                    var hastarget=false;
                    var turnfriend=false;
                    var players=game.filterPlayer();
                    for(var i=0;i<players.length;i++){
                        if(get.attitude(target,players[i])<0&&!players[i].isTurnedOver()){
                            hastarget=true;
                        }
                        if(get.attitude(target,players[i])>0&&players[i].isTurnedOver()){
                            hastarget=true;
                            turnfriend=true;
                        }
                    }
                    if(get.attitude(player,target)>0&&!hastarget) return;
                    if(turnfriend||target.hp==target.maxHp) return [0.5,1];
                    if(target.hp>1) return [1,0.5];
                }
            },
                    },
                },
            },
            "圣_qianxi":{
                audio:"ext:混沌界:2",
                enable:"phaseUse",
                usable:1,
                direct:true,
                locked:true,
                content:function (){
        "step 0"
        player.draw();
        player.chooseToDiscard('he','【潜袭】：请选择并弃置一张牌',true).set('ai',function(card){
            return 6-get.useful(card);
        });
        "step 1"
        if(!result.bool){
            event.finish();
            return;
        }
        event.suit=get.suit(result.cards[0]);
        player.chooseTarget(function(card,player,target){
            return player!=target;
        },true).set('ai',function(target){
            return -get.attitude(_status.event.player,target);
        });
        "step 2"
        if(result.bool&&result.targets.length){
            player.line(result.targets[0],'green');
            player.logSkill('圣_qianxi');
            player.storage.圣_qianxi_to=result.targets[0];
            player.addTempSkill('圣_qianxi_to');
        }
        "step 3"
        if(result.bool&&result.targets.length){
            result.targets[0].storage.圣_qianxi_End=event.suit;
            result.targets[0].addTempSkill('圣_qianxi_End');
            game.addVideo('storage',result.targets[0],['圣_qianxi_End',event.suit]);
        }
    },
                subSkill:{
                    to:{
                        onremove:true,
                        unique:true,
                        charlotte:true,
                        mod:{
                            globalFrom:function (from,to){
                    if(to==from.storage.圣_qianxi_to){
                        return -Infinity;
                    }
                },
                        },
                        sub:true,
                    },
                    End:{
                        mark:true,
                        marktext:"袭",
                        mod:{
                            cardEnabled:function (card,player){
                    if(get.suit(card)!=player.storage.圣_qianxi_End) return false;
                },
                            cardUsable:function (card,player){
                    if(get.suit(card)!=player.storage.圣_qianxi_End) return false;
                },
                            cardRespondable:function (card,player){
                    if(get.suit(card)!=player.storage.圣_qianxi_End) return false;
                },
                            cardSavable:function (card,player){
                    if(get.suit(card)!=player.storage.圣_qianxi_End) return false;
                },
                        },
                        intro:{
                            content:function (suit){
                    return '该角色仅可使用或打出'+get.translation(suit)+'花色的牌';
                },
                        },
                        sub:true,
                    },
                },
            },
            "圣_mdzhanjue":{
                trigger:{
                    source:"damageBefore",
                },
                forced:true,
                filter:function (event,player){
        if(event.player.isDamaged()) return false;
        return true;
    },
                content:function (){
        if(trigger.player.maxHp!=Infinity){
        trigger.player.loseMaxHp(trigger.num);
        trigger.cancel();
        }
        else{
        trigger.player.maxHp=4;
        trigger.player.hp=trigger.player.maxHp;
        trigger.player.update();
        trigger.cancel();
        }
    },
            },
            "圣_chengmou":{
                audio:"ext:混沌界:2",
                trigger:{
                    player:"shaBegin",
                },
                locked:true,
                priority:100,
                check:function (event,player){
        return get.attitude(player,event.target)<=0;
    },
                filterTarget:function (card,player,target){
        return player!=target;
    },
                filter:function (event,player){
        return event.target.isDamaged();
    },
                logTarget:"target",
                content:function (){
        "step 0"
        trigger.target.addSkill('圣_chengmou_hp');
        "step 1"
        trigger.target.draw();
        "step 2"
        trigger.target.chooseCard(2,'选择并交给'+get.translation(player)+
            '两张牌',true).set('ai',function(card){
            return 5-get.useful(card);
        }).set('source',player);
            game.delay();
        "step 3"
        player.gain(result.cards,trigger.target);
        trigger.target.$give(result.cards,player);
        "step 4"
        trigger.target.recover(trigger.target.maxHp-trigger.target.hp);
    },
                subSkill:{
                    hp:{
                        init:function (player){
        player.storage.圣_chengmou_hp=player.hp;
    },
                        trigger:{
                            global:"phaseEnd",
                        },
                        forced:true,
                        priority:100,
                        direct:true,
                        content:function (){
                "step 0"
                if(player.hp>player.storage.圣_chengmou_hp){
                    player.loseHp(player.hp-player.storage.圣_chengmou_hp)._triggered=null;
                }
                "step 1"
                player.removeSkill('圣_chengmou_hp');
            },
                        sub:true,
                    },
                },
            },
            "圣_guiming_dying":{
                        audio:"ext:混沌界:2",
                        skillAnimation:"epic",
                        animationColor:"metal",
                        trigger:{
                            global:"dieAfter",
                        },
                        derivation:["圣_mingzheng","圣_zilv","圣_shcanshi","圣_chouhai"],
                        forced:true,
                        priority:-1,
                        filter:function (event,player){
                return event.player!=player&&event.source!=player;
            },
                        content:function (){
                "step 0"
                player.removeSkill('圣_chaobian');
                player.removeSkill('圣_weiyin');
                player.addSkill('圣_mingzheng');
                player.addSkill('圣_zilv');
                player.addSkill('圣_guiming_source');
                player.recover();
                "step 1"
                player.removeSkill('圣_guiming_dying');
    },
            },
            "圣_guiming_source":{
                        audio:"ext:混沌界:2",
                        skillAnimation:"epic",
                        animationColor:"fire",
                        trigger:{
                            source:"dieAfter",
                        },
                        forced:true,
                        priority:-1,
                        derivation:["圣_mingzheng","圣_zilv","圣_shcanshi","圣_chouhai"],
                        content:function (){
                "step 0"
                player.removeSkill('圣_mingzheng');
                player.removeSkill('圣_zilv');
                player.removeSkill('圣_zilv_draw');
                player.addSkill('圣_shcanshi');
                player.addSkill('圣_chouhai');
                player.gainMaxHp();
                player.draw(3);
                "step 1"
                player.awakenSkill('圣_guiming_source');
    },
            },
            "圣_chaobian":{
                audio:"ext:混沌界:2",
                enable:"phaseUse",
                usable:1,
                filterTarget:function (card,player,target){
        return player!=target;
    },
                filterCard:true,
                selectCard:-1,
                locked:true,
                filter:function (event,player){
        return player.countCards('h')>0;
    },
                content:function (){
        if(player.getEnemies().contains(target)){
            target.chooseToDiscard('he',cards.length,true).set('ai',function(card){
            return 6-get.useful(card);
        });
            target.damage(player);
        }
        else{
            player.give(cards.length,target);
            target.gain(cards,'gain2');
            player.recover();
        }
    },
               ai:{
               result:{
                    target:function (target,player){
                    if(player.isDamaged()) return 1;
                    if(target.countCards('he')>=player.countCards('he')) return -1;
                    if(target.hp==1) return -2;
                    }
                    },
               },
            },
            "圣_shcanshi":{
                audio:"ext:混沌界:2",
                trigger:{
                    player:"phaseBegin",
                },
                locked:true,
                check:function(event,player){
					var num=game.countPlayer(function(current){
						return current.isDamaged();
					})+player.maxHp-player.hp;
					return num>3;
				},
                prompt2:function (event,player){
        var num=game.countPlayer(function(current){
            return current.isDamaged();
        });
        return '是否发动【残蚀】？','锁定技，准备阶段，你可以摸“'+get.translation(num+player.maxHp-player.hp)+'”张牌。若如此做，本回合内每当你使用一张基本或锦囊牌时，你需选择失去一点体力或弃置一张牌；结束阶段，你可以对一名其他角色造成一点伤害';
    },
                content:function (){
        var num=game.countPlayer(function(current){
            return current.isDamaged();
        });
        player.draw(num+player.maxHp-player.hp);
        player.addTempSkill('圣_shcanshi_draw');
        player.addTempSkill('圣_shcanshi_End');
    },
                subSkill:{
                    draw:{
                        trigger:{
                            player:"useCardAfter",
                        },
                        forced:true,
                        direct:true,
                        filter:function (event,player){
                if(player.countCards('he')==0) return false;
                var type=get.type(event.card,'trick');
                return type=='basic'||type=='trick';
            },
                        autodelay:true,
                        content:function (){
                "step 0"
                if(!player.countCards('he')){
                  player.loseHp();
                  event.finish();
                }
               "step 1" 
            player.chooseToDiscard('he','弃置一张牌，或取消并失去一点体力');
               "step 2"
               if(result.bool==false){
               player.loseHp();
               }
               },
                        sub:true,
                    },
                    End:{
                        trigger:{
                            player:"phaseEnd",
                        },
                        forced:true,
                        direct:true,
                        content:function (){
                "step 0"
                player.chooseTarget('仇海：请选择一名其他角色对其造成一点伤害',function(card,player,target){
            return player!=target
        }).ai=function(target){
            if(target.hasSkillTag('noturn')) return 0;
            var player=_status.event.player;
            if(get.attitude(_status.event.player,target)==0) return 0;
            if(get.attitude(_status.event.player,target)>0){
                if(target.classList.contains('turnedover')) return -1;
                if(player.maxHp-player.hp<Infinity) return -1;
                return 100-target.countCards('h');
            }
            else{
                if(target.classList.contains('turnedover')) return -1;
                if(player.maxHp-player.hp>=Infinity) return -1;
                return 1+target.countCards('h');
            }
        }
                "step 1"
                if(result.bool){
                    player.line(result.targets[0],'fire');
                    result.targets[0].damage(player);
                }
            },
                        sub:true,
                    },
                },
            },
            "圣_chouhai":{
                audio:"ext:混沌界:2",
                trigger:{
                    source:"damageBegin",
                    player:"damageBegin",
                },
                forced:true,
                priority:-1,
                check:function (){
        return false;
    },
                filter:function (event,player){
        return player.countCards('h')==0;
    },
                content:function (){
        trigger.num+=trigger.num;
    },
                ai:{
                    effect:{
                        target:function (card,player,target,current){
                if(get.tag(card,'damage')&&target.countCards('h')==0) return [1,-2];
            },
                    },
                },
            },
            "圣_zilv":{
                mod:{
                    maxHandcard:function (player,num){
            return num+=num;
        },
                },
                trigger:{
                    source:"damageAfter",
                },
                forced:true,
                filter:function (event,player){
        return event.num>0&&event.player!=player&&
            _status.currentPhase==player;
    },
                content:function (){
    player.addTempSkill('圣_zilv_draw');
},
                subSkill:{
                    draw:{
                        mod:{
                            playerEnabled:function (card,player,target){
                    if(player!=target) return false;
                },
                        },
                        unique:true,
                        charlotte:true,
                        sub:true,
                    },
                },
            },
            "圣_mingzheng":{
                audio:"ext:混沌界:2",
                enable:"phaseUse",
                usable:1,
                filterCard:function (card){
        return get.type(card)=='basic'||get.type(card)=='trick'||get.type(card)=='equip';
    },
                position:"he",
                check:function (card){
        var player=_status.event.player;
        var type=get.type(card,'trick');
        if(type=='trick'){
            return 6-get.value(card);
        }
        else if(type=='equip'){
            if(player.hasSha()&&game.hasPlayer(function(current){
                return (player.canUse('sha',current)&&
                    get.attitude(player,current)<0&&
                    get.effect(current,{name:'sha'},player,player)>0)
            })){
                return 6-get.value(card);
            }
        }
        return 0;
    },
                content:function (){
        switch(get.type(cards[0],'trick')){
            case 'basic':player.draw(3);player.chooseToDiscard('he',true);break;
            case 'trick':player.useCard({name:'wugu'},game.players);break;
            case 'equip':player.useCard({name:'taoyuan'},game.players);break;
        }
    },
                ai:{
                    order:9,
                    result:{
                        player:1,
                    },
                },
            },
            "圣_weiyin":{
                trigger:{
                    player:"damageBefore",
                },
                forced:true,
                priority:100,
                filter:function (event,player){
        return event.source&&event.source.countCards('h')>player.countCards('h');
    },
                content:function (){
        trigger.cancel();
    },
            },
            "圣_wanrong":{
                trigger:{
                    global:"damageEnd",
                },
                forced:true,
                priority:-1,
                filter:function (event,player){
        return event.source&&event.source!=player&&
            event.card&&get.color(event.card)=='red';
    },
                content:function (){
        player.draw();
    },
            },
            "圣_yanxiao_ins":{
                mark:true,
                intro:{
                    content:"出牌阶段，你可以弃置一张♦️卡牌并选择一名其他角色；若如此做，你摸一张牌并令该角色于其下回合准备阶段进行一次判定，若判定结果不为♥️，该角色跳过摸牌阶段与出牌阶段",
                },
                audio:"ext:混沌界:2",
                filter:function (event,player){
        return player.countCards('he',{suit:'diamond'})>0;
    },
                enable:"phaseUse",
                filterCard:function (card){
        return get.suit(card)=='diamond';
    },
                position:"he",
                filterTarget:function (card,player,target){
        return player!=target&&!target.hasSkill('圣_yanxiao_debuff');
    },
                prompt:"出牌阶段，你可以弃置一张♦️卡牌并选择一名其他角色；若如此做，你摸一张牌并令该角色于其下回合准备阶段进行一次判定，若判定结果不为♥️，该角色跳过摸牌阶段与出牌阶段",
                content:function (){
        player.draw();
        target.addSkill('圣_yanxiao_debuff');
        player.addSkill('圣_yanxiao_rem');
        player.removeSkill('圣_yanxiao_ins');
    },
                check:function (card){return 6-get.value(card)},
                ai:{
                    threaten:1.5,
                    basic:{
                        order:1,
                        useful:1,
                        value:8,
                    },
                    result:{
                        target:function (player,target){
                var num=target.hp-target.countCards('h')-2;
                if(num>-1) return -0.01;
                if(target.hp<3) num--;
                if(target.isTurnedOver()) num/=2;
                var dist=get.distance(player,target,'absolute');
                if(dist<1) dist=1;
                return num/Math.sqrt(dist);
            },
                    },
                    tag:{
                        skip:"phaseUse",
                    },
                },
            },
            "圣_yanxiao_debuff":{
     mark:true,
     marktext:"笑",
     intro:{
     content:"该角色于下回合准备阶段进行一次判定，若判定结果不为♥️，该角色跳过摸牌阶段与出牌阶段",
       },
    trigger:{
        player:"phaseBegin",
    },
    forced:true,
    priority:100,
    content:function (){
        "step 0"
        player.judge(function(card){
            if(get.suit(card)=='heart') return 0;
            return -3;
        })
        "step 1"
        if(result.judge<0){
            player.skip('phaseDraw');
            player.skip('phaseUse');
        }
        "step 2"
        player.removeSkill('圣_yanxiao_debuff');
    },
            },
            "圣_yanxiao_rem":{
                mark:true,
                intro:{
                    content:"出牌阶段，你可以将一张♦️卡牌置于一名角色的武将牌旁并摸一张牌，该角色于其回合开始时获得此牌与其判定区内的所有牌",
                },
                audio:"ext:混沌界:2",
                enable:"phaseUse",
                locked:true,
                filterCard:{
                    suit:"diamond",
                },
                filterTarget:function (card,player,target){
        return !target.hasSkill('圣_yanxiao_buff');
    },
                check:function (card){
        return 7-get.value(card);
    },
                position:"he",
                filter:function (event,player){
        return player.countCards('he',{suit:'diamond'})>0;
    },
                discard:false,
                //lose:false,
                visible:true,
                toStorage:true,
                prepare:"give",
                prompt:"出牌阶段，你可以将一张♦️卡牌置于一名角色的武将牌旁并摸一张牌，该角色于其回合开始时获得此牌与其判定区内的所有牌",
                content:function (){
        "step 0"
        //player.lose(cards,ui.special,'toStorage','visible');
					if(target.hasSkill('圣_yanxiao_buff')&&target.storage.圣_yanxiao_buff){
						target.storage.圣_yanxiao_buff.push(cards[0]);
						target.syncStorage('圣_yanxiao_buff');
						target.markSkill('圣_yanxiao_buff');
					}
					else{
						target.storage.圣_yanxiao_buff=cards.slice(0);
						target.syncStorage('圣_yanxiao_buff');
						target.addSkill('圣_yanxiao_buff');
					}
        "step 1"
        player.draw();
        player.addSkill('圣_yanxiao_ins');
        player.removeSkill('圣_yanxiao_rem');
    },
                ai:{
                    order:8,
                    result:{
                        target:function (player,target){
                if(target.storage.圣_yanxiao_buff&&target.storage.圣_yanxiao_buff.length) return 0;
                if(target.countCards('j')) return 1;
                return 0;
            },
                    },
                },
            },
            "圣_yanxiao_buff":{
                mark:true,
				intro:{
					content:'cards'
				},
				trigger:{player:'phaseBegin'},
				direct:true,
				forced:true,
				priority:100,
				content:function (){
					var cards=player.storage.圣_yanxiao_buff.concat(player.getCards('j'));
					player.gain(cards,'gain2','log','fromStorage');
					delete player.storage.圣_yanxiao_buff;
					player.removeSkill('圣_yanxiao_buff');
				},
				ai:{
					effect:{
						target:function (card){
							if(get.type(card)=='delay') return [0,0.1];
						}
					}
				}
            },
            "圣_liuli":{
                audio:"ext:混沌界:2",
                trigger:{
                    target:"useCardToTarget",
                },
                direct:true,
                forced:true,
                filter:function (event,player){
        return event.card.name=='sha'&&player.countCards('he');
    },
                content:function (){
        "step 0"
        var next=player.chooseCardTarget({
            position:'he',
            filterCard:lib.filter.cardDiscardable,
            filterTarget:function (card,player,target){
               return target!=trigger.player&&target!=player;
            },
            prompt:get.prompt('圣_liuli'),
            prompt2:'锁定技，每当你成为【杀】的目标时，你可以弃置一张牌将此【杀】的目标转移至一名其他角色。若如此做，若你的体力值大于此【杀】当前的目标角色，你失去一点体力；若你的手牌数量小于此【杀】的使用者，你获得此【杀】',
        }).set('ai',function(target){
            return -get.attitude(_status.event.player,target);
        });
        "step 1"
        if(result.bool){
            var target=result.targets[0];
            var target2=trigger.player;
            player.logSkill(event.name,target);
            player.discard(result.cards);
            var evt=trigger.getParent();
            evt.targets.remove(player);
            evt.targets.push(target);
            if(player.hp>target.hp) player.loseHp();
            if(player.countCards('h')<target2.countCards('h')) player.gain(trigger.cards,'gain2');
        }
    },
            },
            "圣_yanxiao":{
                trigger:{
                    global:"gameStart",
                },
                forced:true,
                direct:true,
                priority:null,
                content:function (){
        player.addSkill('圣_yanxiao_ins');
    },
            },
            "圣_fenying":{
                audio:"ext:混沌界:2",
                trigger:{
                    global:"loseAfter",
                },
                forced:true,
                priority:-1,
                filter:function (event,player){
        if(event.player.countCards('h')) return false;
        if(event.player.hp<=0) return false;
        if(!event.player.isAlive()) return false;
        for(var i=0;i<event.cards.length;i++){
            if(event.cards[i].original=='h') return true;
        }
        return false;
    },
                content:function (){
        "step 0"
        if(trigger.player.hp>=player.hp){
            player.draw(player.hp);
        }
        else{
            player.draw(trigger.player.hp);
        }
        "step 1"
        if(trigger.player!=player&&trigger.player.isLinked()){
            player.line(trigger.player,'fire');
            trigger.player.damage('fire');
        }
    },
                ai:{
                    threaten:0.8,
                    effect:{
                        target:function (card){
                if(card.name=='guohe'||card.name=='liuxinghuoyu') return 0.5;
            },
                    },
                    noh:true,
                    skillTagFilter:function (player,tag){
            if(tag=='noh'){
                if(player.countCards('h')!=1) return false;
            }
        },
                },
            },
            "圣_qianxun":{
                trigger:{
                    player:"damageEnd",
                },
                forced:true,
                filter:function (event,player){
        return player.countCards('h')>0&&event.source&&event.source!=player;
    },
                content:function (){
        "step 0"
        trigger.source.link(true);
        trigger.source.chooseToDiscard('h',Infinity,true);
        "step 1"
        if(trigger.source.hp>=player.hp){
            trigger.source.gainPlayerCard(player,'h',[1,player.maxHp-player.hp],true);
        }
        else{
            trigger.source.gainPlayerCard(player,'h',[1,trigger.source.maxHp-trigger.source.hp],true);
        }
    },
            },
            "圣_lingji":{
                skillAnimation:"epic",
                animationColor:"fire",
                derivation:["圣_cuike","圣_junlve","圣_zhanhuo"],
                audio:"ext:混沌界:2",
                trigger:{
                    player:"phaseBegin",
                },
                unique:true,
                forced:true,
                priority:100,
                filter:function (event,player){
        return player.isMaxHandcard()&&
            player.storage.圣_lingji_mark>=game.countPlayer();
    },
                content:function (){
        "step 0"
        var list=game.filterPlayer().sortBySeat();
        player.line(list,'fire');
        game.asyncDraw(list);
        "step 1"
        player.removeSkill('圣_fenying');
        player.removeSkill('圣_qianxun');
        player.addSkill('圣_cuike');
        player.addSkill('圣_junlve');
        player.addSkill('圣_zhanhuo');
        player.awakenSkill('圣_lingji');
    },
                group:["圣_lingji_mark"],
                subSkill:{
                    mark:{
                        init:function (player){
        player.storage.圣_lingji_mark=0;
    },
                        trigger:{
                            source:"damageEnd",
                        },
                        forced:true,
                        direct:true,
                        filter:function (event,player){
        return event.nature=='fire';
    },
                        content:function (){
        player.storage.圣_lingji_mark+=trigger.num;
        player.markSkill('圣_lingji_mark');
        player.syncStorage('圣_lingji_mark');
    },
                        sub:true,
                    },
                },
            },
            "圣_cuike":{
                trigger:{
                    player:"phaseBegin",
                },
                forced:true,
                priority:-1,
                direct:true,
                content:function (){
        "step 0"
        if(player.storage.圣_junlve%2==1){
            player.chooseTarget('是否发动【摧克】对一名角色造成一点伤害？').ai=function(target){
                return -get.attitude(player,target);
            };
        }
        else 
            if(player.storage.圣_junlve%2==0){
            player.chooseTarget('是否发动【摧克】将一名角色横置？').ai=function(target){
                return -get.attitude(player,target);
            };
        }
        else{
            event.finish();
        };
        "step 1"
       if(result.bool){
            player.line(result.targets);
            if(player.storage.圣_junlve%2==1){
                player.logSkill('圣_cuike_fire');
                result.targets[0].damage();
                if(result.targets[0].hp>=player.hp){
                    player.recover();
                }
            }
            else{
                player.logSkill('圣_cuike_line');
                result.targets[0].link(true);
                if(result.targets[0].countCards('hej')>=player.countCards('hej')){
                    player.gainPlayerCard(result.targets[0],[1,2],'hej');
                }
                else{
                    player.discardPlayerCard(result.targets[0],[1,2],'hej');
                }
            };
        };
    },
                subSkill:{
                    fire:{
                        audio:"ext:混沌界:2",
                    },
                    line:{
                        audio:"ext:混沌界:2",
                    },
                },
            },
            "圣_zhanhuo":{
                audio:"ext:混沌界:2",
                unique:true,
                skillAnimation:true,
                animationColor:"fire",
                enable:"phaseUse",
                round:5,
                filter:function (event,player){
        return player.storage.圣_junlve>=7;
    },
                check:function (event,player){
        var num=game.countPlayer(function(current){return get.attitude(player,current)<0&&current.isLinked()});
        return player.storage.圣_junlve>=num&&num==game.countPlayer(function(current){return get.attitude(player,current)<0});
    },
                filterTarget:function (card,player,target){
        return target.isLinked();
    },
                selectTarget:function (){
        return [1,_status.event.player.storage.圣_junlve];
    },
                multiline:true,
                multitarget:true,
                content:function (){
        "step 0"
        player.storage.圣_junlve-=7;
        player.markSkill('圣_junlve');
        player.syncStorage('圣_junlve');
        game.log(player,'移除了7枚','#y“军略”','印记');
        "step 1"
        for(var i=0;i<targets.length;i++){
            player.gainPlayerCard(targets[i],'e',true);
        }
        "step 2"
        if(player.storage.圣_junlve>=game.countPlayer()*player.hp){
        var num=2;}else{var num=1; }
        player.chooseTarget(true,'对一名已选择的目标角色造成'+get.translation(num)+'点火属性伤害',function(card,player,target){
            return _status.event.targets.contains(target);
        }).set('targets',targets).ai=function(){return 1};
        "step 3"
        if(result.bool){
            if(player.storage.圣_junlve>=game.countPlayer()*player.hp){
            player.line(result.targets[0],'fire');
            result.targets[0].damage(2,'fire','nocard');
            }
            else{
            player.line(result.targets[0],'fire');
            result.targets[0].damage('fire','nocard');
            }
        }
    },
                ai:{
                    order:1,
                    result:{
                        target:function (player,target){
                if(target.hasSkillTag('nofire')) return 0;
                if(lib.config.mode=='versus') return -1;
                if(player.hasUnknown()) return 0;
                return get.damageEffect(target,player)-target.countCards('e');
            },
                    },
                },
                group:["圣_zhanhuo_roundcount"],
            },
            "圣_junlve":{
                audio:"ext:混沌界:2",
                init:function (player){
        player.storage.圣_junlve=2;
    },
                marktext:"军",
                intro:{
                    content:"当前持有#枚“军略”印记",
                },
                mark:true,
                trigger:{
                    player:"damageAfter",
                    source:"damageSource",
                },
                forced:true,
                filter:function (event,player){
                return event.num>0;
                },
                content:function (){
        player.storage.圣_junlve+=trigger.num;
        player.markSkill('圣_junlve');
        player.syncStorage('圣_junlve');
        game.log(player,'获得了',trigger.num,'枚','#y“军略”','印记');
    },
            },
            "圣_wengua2":{
                audio:"ext:混沌界:2",
                enable:"phaseUse",
                filter:function (event,player){
        if(player.hasSkill('圣_wengua2_has')) return false;
        return player.countCards('he')&&game.hasPlayer(function(current){
            return current.hasSkill('圣_wengua');
        });
    },
                direct:true,
                delay:0,
                filterCard:true,
                discard:false,
                lose:false,
                position:"he",
                prompt:function (){
        var player=_status.event.player;
        var list=game.filterPlayer(function(current){
            return current.hasSkill('圣_wengua');
        });
        var str='将一张牌交给'+get.translation(list);
        if(list.length>1) str+='中的一人';
        return str;
    },
                check:function (card){
        if(card.name=='sha') return 5;
        return 8-get.value(card);
    },
                content:function (){
        "step 0"
        var targets=game.filterPlayer(function(current){
            return current.hasSkill('圣_wengua');
        });
        if(targets.length==1){
            event.target=targets[0];
            event.goto(2);
        }
        else if(targets.length>0){
            player.chooseTarget(true,'选择【问卦】的目标',function(card,player,target){
                return _status.event.list.contains(target);
            }).set('list',targets).set('ai',function(target){
                var player=_status.event.player;
                return get.attitude(player,target);
            });
        }
        else{
            event.finish();
        }
        "step 1"
        if(result.bool&&result.targets.length){
            event.target=result.targets[0];
        }
        else{
            event.finish();
        }
        "step 2"
        if(event.target){
            player.logSkill('圣_wengua',event.target);
            player.addTempSkill('圣_wengua2_has','phaseUseEnd');
            event.card=cards[0];
            if(event.target!=player){
                player.give(cards,event.target);
            }else{
            event.goto(4);
            }
        }
        else{
            event.finish();
        }
        "step 3"
        if(event.target.countCards('h')){
            event.target.chooseCard('he',true,'【问卦】：请选择一张牌，然后决定是否为'+get.translation(player)+'卜卦').ai=function(card){
                return -get.value(card);
            };
        }
        else{
            event.finish();
        }
        "step 4" 
            if(event.target==player){
            event.target.chooseControlList('问卦','将'+get.translation(event.card)+'置于牌堆顶','将'+get.translation(event.card)+'置于牌堆底',true,event.target==player,function(){
                if(get.attitude(event.target,player)<0) return 2;
                return 1;
            });
         }else{
         event.card=result.cards[0];
         event.target.chooseControlList('问卦','将'+get.translation(event.card)+'置于牌堆顶','将'+get.translation(event.card)+'置于牌堆底','拒绝为'+get.translation(player)+'卜卦',true,event.target==player,function(){
                if(get.attitude(event.target,player)<0) return 2;
                return 1;
            });
         }
        "step 5"
        event.index=result.index;
        if(event.index==0||event.index==1){
        event.target.lose(event.card,ui.special);
        game.broadcastAll(function(player){
            var cardx=ui.create.card();
            cardx.classList.add('infohidden');
            cardx.classList.add('infoflip');
            player.$throw(cardx,1000,'nobroadcast');
        },event.target);
        }else{
        event.finish();
        }
        "step 6"
        game.delay();
        "step 7"
        event.card.fix();
        if(event.index==1){
            game.log(event.target,'将一张牌置于牌堆底');
            ui.cardPile.appendChild(event.card);
            if(ui.cardPile.childElementCount==1||player==event.target){
                player.draw();
            }
            else{
                event.target.draw();
            }
        }
        if(event.index==0){
            game.log(player,'将一张牌置于牌堆顶');
            ui.cardPile.insertBefore(event.card,ui.cardPile.firstChild);
            if(ui.cardPile.childElementCount==1||player==event.target){
                player.draw('bottom');
            }
            else{
                event.target.draw('bottom');
            }
        }
        "step 8"
        if(ui.cardPile.childElementCount==1||player==event.target){
                event.target.chooseControl('heart','diamond','spade','club').set('prompt','【问卦】：请选择一种花色').set('ai',function(event){
            switch(Math.floor(Math.random()*6)){
                case 0:return 'heart';
                case 1:case 4:case 5:return 'diamond';
                case 2:return 'club';
                case 3:return 'spade';
            }
        });
            }
            else{
                player.chooseControl('heart','diamond','spade','club').set('prompt','【问卦】：请选择一种花色').set('ai',function(event){
            switch(Math.floor(Math.random()*6)){
                case 0:return 'heart';
                case 1:case 4:case 5:return 'diamond';
                case 2:return 'club';
                case 3:return 'spade';
            }
        });
            }
        "step 9"
        if(ui.cardPile.childElementCount==1||player==event.target){
                game.log(event.target,'选择了'+get.translation(result.control)+'花色');
        event.target.popup(result.control);
        var cardPileFirstCard=get.cards(1);
        event.target.showCards(cardPileFirstCard);
        if(get.suit(cardPileFirstCard)==result.control){
            player.logSkill('圣_wengua2_yes');
            event.target.draw();
            event.target.gain(game.createCard('sha'),'gain2');
            event.target.addTempSkill('圣_wengua2_yes');
            game.log(event.target,'于本回合内使用【杀】无次数限制且与其他所有角色的距离视为一');
        }
        else{
            player.logSkill('圣_wengua2_no');
            event.target.draw(2);
        event.target.addTempSkill('圣_wengua2_no');
            game.log(event.target,'于本回合内的手牌上限-1');
        };
            }
            else{
               game.log(player,'选择了'+get.translation(result.control)+'花色');
        player.popup(result.control);
        var cardPileFirstCard=get.cards(1);
        player.showCards(cardPileFirstCard);
        if(get.suit(cardPileFirstCard)==result.control){
            player.logSkill('圣_wengua2_yes');
            player.draw();
            player.gain(game.createCard('sha'),'gain2');
            player.addTempSkill('圣_wengua2_yes');
            game.log(player,'于本回合内使用【杀】无次数限制且与其他所有角色的距离视为一');
        }
        else{
            player.logSkill('圣_wengua2_no');
            player.addTempSkill('圣_wengua2_no');
            player.draw(2);
            game.log(player,'于本回合内的手牌上限-1');
        }; 
            }
    },
                subSkill:{
                    has:{
                        sub:true,
                    },
                    yes:{
                    audio:"ext:混沌界:2",
                        forced:true,
                        unique:true,
                        charlotte:true,
                        mod:{
                        cardUsable:function(card,player,num){
					        	if(card.name=='sha') return Infinity;
					},
                            globalFrom:function (from,to,distance){
            return distance-Infinity;
        },
                        },
                        sub:true,
                    },
                    no:{
                    audio:"ext:混沌界:2",
                        mod:{
                            maxHandcard:function (player,num){
            return num-1;
        },
                        },
                        sub:true,
                    },
                },
                ai:{
                    order:10,
                    threaten:1.5,
                    result:{
                        player:function (player,target){
                var target=game.findPlayer(function(current){
                    return current.hasSkill('圣_wengua');
                });
                if(target){
                    return get.attitude(player,target);
                }
            },
                    },
                },
            },
            "圣_wengua":{
                global:"圣_wengua2",
                audio:"ext:混沌界:2",
            },
            "圣_zhenmou":{
                trigger:{
                    global:"dieAfter",
                },
                forced:true,
                direct:true,
                filter:function (event,player){
        return event.player.sex=='male'&&event.player!=player&&
            !player.hasSkill('圣_zhenmou_for');
    },
                content:function (){
        "step 0"
       player.chooseTarget(get.prompt('圣_zhenmou'),'请选择至多两名男性角色',[1,2],function(card,player,target){
            return player!=target&&target.sex=='male';
        }).ai=function(target){
                return get.attitude(player,target);
            };
       "step 1"
       if(result.bool){
           player.logSkill('圣_zhenmou',result.targets);
           player.addSkill('圣_zhenmou_for'); 
           if(result.targets.length==1){
           player.line(result.targets[0]);
           result.targets[0].addSkill('圣_zhenmou_mark');
           result.targets[0].markSkillCharacter('圣_zhenmou',player,'贞谋','每当神徐氏对一名其他角色使用【杀】时，该角色可率先对目标使用一张【杀】');
           }else{
           player.line(result.targets[0]);
           player.line(result.targets[1]);
           result.targets[0].addSkill('圣_zhenmou_mark');
           result.targets[1].addSkill('圣_zhenmou_mark');
           result.targets[0].markSkillCharacter('圣_zhenmou',player,'贞谋','每当神徐氏对一名其他角色使用【杀】时，该角色可率先对目标使用一张【杀】');
           result.targets[1].markSkillCharacter('圣_zhenmou',player,'贞谋','每当神徐氏对一名其他角色使用【杀】时，该角色可率先对目标使用一张【杀】');
           }
       }
    },
                subSkill:{
                    for:{
                        sub:true,
                    },
                    mark:{
                        trigger:{
                            global:"useCardToPlayered",
                        },
                        forced:true,
                        direct:true,
                        filter:function (event,player){
        return event.player!=player&&event.card.name=='sha'&&
            event.player.hasSkill('圣_zhenmou_for')&&
            event.target!=player&&event.target.isAlive();
    },
                        content:function (){
                        player.useCard({name:"sha"},trigger.target);
    },
                        sub:true,
                    },
                },
            },
            "圣_fuzhu":{
                audio:"ext:混沌界:2",
                trigger:{
                    global:"phaseEnd",
                },
                filter:function (event,player){
        return event.player!=player&&event.player.sex=='male'&&
            ui.cardPile.childElementCount<=[(player.maxHp-player.hp)+(event.player.maxHp-event.player.hp)]*10;
    },
                check:function (event,player){
        return get.attitude(player,event.player)<0&&get.effect(event.player,{name:'sha'},player,player)>0;
    },
                logTarget:"player",
                skillAnimation:true,
                animationColor:"wood",
                content:function (){
        "step 0"
        var list=[];
        for(var i=0;i<ui.cardPile.childElementCount;i++){
            if(ui.cardPile.childNodes[i].name=='sha'){
                list.push(ui.cardPile.childNodes[i]);
                ui.cardPile.childNodes[i].remove();
                i--;
            }
        }
        event.list=list;
        event.num=0;
        event.total=game.players.length+game.dead.length;
        "step 1"
        if(event.list.length&&event.num<event.total&&trigger.player.isAlive()){
            event.num++;
            player.useCard(event.list.shift(),trigger.player);
            event.redo();
        }
        "step 2"
        var cards=get.cards(ui.cardPile.childElementCount+1);
        for(var i=0;i<cards.length;i++){
            ui.cardPile.insertBefore(cards[i],ui.cardPile.childNodes[get.rand(ui.cardPile.childElementCount)]);
        }
        for(var i=0;i<event.list.length;i++){
            ui.cardPile.insertBefore(event.list[i],ui.cardPile.childNodes[get.rand(ui.cardPile.childElementCount)]);
        }
        "step 3"
        if(!trigger.player.isAlive()){
        player.awakenSkill('圣_fuzhu');
        player.draw(player.maxHp-player.hp);
        player.recover(player.maxHp-player.hp);
        }else{
        player.chooseToDiscard('hej',Infinity,true);
        player.loseHp();
        }
    },
                ai:{
                    threaten:1.5,
                },
            },
            "圣_tianming":{
                audio:"ext:混沌界:2",
                marktext:"兵",
                init:function (player){
        player.storage.圣_tianming=0;
    },
                intro:{
                    content:"当前共持有#枚“隐兵”印记",
                },
                trigger:{
                    target:"useCardToTargeted",
                },
                filter:function (event,player){
        return event.card.name=='sha';
    },
                locked:true,
                content:function (){
        "step 0"
        if(trigger.player.countCards('h')>2){
                event.num=trigger.player.countCards('h');
            }else{
                event.num=2;
            }
        var num=game.filterPlayer(function(current){
            return current.hasSkill('圣_putian_mark');
        });
        if(num<=0){
            if(event.num>2){
                player.draw(event.num);
            }else{
                player.draw(2);
            }
            if(player.isDamaged()){
                player.recover();
                player.chooseToDiscard('he',event.num,true).set('ai',function(card){
            return 6-get.useful(card);
        });
            }else{
                player.chooseToDiscard('he',2,true).set('ai',function(card){
            return 6-get.useful(card);
        });
                player.storage.圣_tianming+=2;
                player.markSkill('圣_tianming');
                player.syncStorage('圣_tianming');
            }
            event.finish();
        }
        "step 1"
       player.chooseControlList([
                '移除所有“隐兵”印记摸'+player.storage.圣_tianming+'张牌并受到来自于标记角色的一点伤害',
                '你与被标记角色一同摸'+event.num+'张牌',
            ],true).set('ai',function(event,player){
                if(player.storage.圣_tianming>event.num&&player.hp+player.num('h','tao')>2) return 0;
                if(event.num>=player.storage.圣_tianming) return 1;
                return 0;
            });
        "step 2"
        if(result.index==0){
            var list=game.filterPlayer();
        for(var i=0;i<list.length;i++){
            if(list[i]!=player&&list[i].hasSkill('圣_putian_mark')){
            player.draw(player.storage.圣_tianming);
            player.storage.圣_tianming=0;
            player.markSkill('圣_tianming');
            player.syncStorage('圣_tianming');
            list[i].line(player);
            player.damage(list[i],true);
            }}
            event.finish();
        }
        else{
            if(event.num>2){
                player.draw(event.num);
            }else{
                player.draw(2);
            }
            if(player.isDamaged()){
                player.recover();
                player.chooseToDiscard('he',event.num-1,true).set('ai',function(card){
            return 6-get.useful(card);
        });
            }else{
                player.chooseToDiscard('he',2,true).set('ai',function(card){
            return 6-get.useful(card);
        });
                player.storage.圣_tianming+=2;
                player.markSkill('圣_tianming');
                player.syncStorage('圣_tianming');
            }
        }
        "step 3"
        var list=game.filterPlayer();
        for(var i=0;i<list.length;i++){
            if(list[i]!=player&&list[i]!=trigger.player&&list[i].hasSkill('圣_putian_mark')){
                player.line(list[i]);
                if(event.num>2){
                list[i].draw(event.num);
            }else{
                list[i].draw(2);
            }
            if(list[i].isDamaged()){
                list[i].recover();
                list[i].chooseToDiscard('he',event.num-1,true).set('ai',function(card){
            return 6-get.useful(card);
        });
            }else{
                list[i].chooseToDiscard('he',2,true).set('ai',function(card){
            return 6-get.useful(card);
        });
            }
            list[i].loseHp();
            }}
            
    },
                ai:{
                    effect:{
                        target:function (card,player,target,current){
                if(card.name=='sha') return [1,0.5];
            },
                    },
                },
                group:"圣_tianming_mark",
                subSkill:{
                    mark:{
                        trigger:{
                            target:"useCardToTargeted",
                        },
                        filter:function (event,player){
        return event.card.name=='sha';
    },
                        forced:true,
                        direct:true,
                        priority:100,
                        content:function (){
        player.storage.圣_tianming++;
        player.markSkill('圣_tianming');
        player.syncStorage('圣_tianming');
    },
                        sub:true,
                    },
                },
            },
            "圣_putian":{
                trigger:{
                    player:"damageEnd",
                },
                forced:true,
                priority:100,
                filter:function (event,player){
        return event.source.hasSkill('圣_putian_mark')&&
            player.hasSkill('圣_putian_die')&&
            player.hasSkill('圣_tianming')&&
            player.storage.圣_tianming>0;
    },
                content:function (){
        if(trigger.card&&trigger.card.name=='sha'){
            trigger.source.loseMaxHp();
        player.storage.圣_tianming=0;
        player.markSkill('圣_tianming');
        player.syncStorage('圣_tianming');
        player.chooseToDiscard('hej',Infinity,true);
        }else{
            trigger.source.loseHp();
        }
    },
                group:"圣_putian_damage",
                subSkill:{
                    mark:{
                        sub:true,
                    },
                    die:{
                        trigger:{
                            global:"dieAfter",
                        },
                        forced:true,
                        direct:true,
                        priority:-1,
                        filter:function (event,player){
                return player.hasSkill('圣_putian_die')&&
                    event.player.hasSkill('圣_putian_mark')&&
                    event.player.sex=='male';
            },
                        content:function (){
                player.removeSkill('圣_putian_die');
            },
                        sub:true,
                    },
                    damage:{
                        trigger:{
                            player:"damageAfter",
                        },
                        forced:true,
                        priority:-1,
                        filter:function (event,player){
                return event.source&&event.source!=player&&
                    !player.hasSkill('圣_putian_die')&&
                    !event.source.hasSkill('圣_putian_mark')&&
                    event.source.sex=='male';
            },
                        content:function (){
                player.line(trigger.source,'fire');
                trigger.source.markSkillCharacter('圣_putian',player,'普天','该角色已被标记');
                trigger.source.addSkill('圣_putian_mark');
                player.addSkill('圣_putian_die');
            },
                        sub:true,
                    },
                },
            },
            "圣_mizhao":{
                audio:"ext:混沌界:2",
                enable:"phaseUse",
                usable:1,
                locked:true,
                filter:function (event,player){
        return player.countCards('h')>0&&player.hasSkill('圣_tianming')&&
            player.storage.圣_tianming>0&&game.countPlayer()>2;
    },
                filterCard:true,
                selectCard:-1,
                filterTarget:function (card,player,target){
        return player!=target&&!target.hasSkill('圣_putian_mark');
    },
                discard:false,
                prepare:"give2",
                ai:{
                    order:1,
                    result:{
                        player:0,
                        target:function (player,target){
                if(target.hasSkillTag('nogain')) return 0;
                if(player.countCards('h')>1){
                    return 1;
                }
                var players=game.filterPlayer();
                for(var i=0;i<players.length;i++){
                    if(players[i].countCards('h')&&players[i]!=target&&players[i]!=player&&get.attitude(player,players[i])<0){
                        break;
                    }
                }
                if(i==players.length){
                    return 1;
                }
                return -2/(target.countCards('h')+1);
            },
                    },
                },
                content:function (){
        "step 0"
        event.target1=targets[0];
        targets[0].gain(cards,player);
        var players=game.filterPlayer();
        for(var i=0;i<players.length;i++){
            if(players[i].countCards('h')&&players[i]!=event.target1&&players[i]!=player){
                break;
            }
        }
        if(i==players.length){
            event.finish();
        }
        "step 1"
        player.chooseTarget(true,'选择拼点目标',function(card,player,target){
            return _status.event.target1.canCompare(target)&&target!=player;
        }).set('ai',function(target){
            var player=_status.event.player;
            var eff=get.effect(target,{name:'sha'},_status.event.target1,player);
            var att=get.attitude(player,target);
            if(att>0){
                return eff-10;
            }
            return eff;
        }).set('target1',event.target1);
        "step 2"
        if(result.targets.length){
            event.target2=result.targets[0];
            event.target1.line(event.target2);
            event.target1.chooseToCompare(event.target2);
        }
        else{
            event.finish();
        }
        "step 3"
        if(!result.tie){
            if(result.bool&&event.target1.canUse({name:'sha'},event.target2,false)){
                if(event.target1.countCards('h')>player.countCards('h')){
                    player.draw(event.target1.countCards('h')-player.countCards('h'));
                }
            }
            else if(event.target2.canUse({name:'sha'},event.target1,false)){
                if(event.target2.hasSkill('圣_putian_mark')){
                    player.storage.圣_tianming=0;
                    player.markSkill('圣_tianming');
                    player.syncStorage('圣_tianming');
                }
                event.target2.useCard({name:'sha'},event.target1);
                event.target2.useCard({name:'sha'},player);
                event.finish();
            }
        }
        "step 4"
        if(player.storage.圣_tianming>0&&event.target1.isAlive()&&event.target2.isAlive()){
                    player.storage.圣_tianming--;
                    player.markSkill('圣_tianming');
                    player.syncStorage('圣_tianming');
                    event.target1.useCard({name:'sha'},event.target2);
                    event.redo();
                }
    },
            },
            "圣_qieting":{
                audio:"ext:混沌界:2",
                trigger:{
                    global:"phaseEnd",
                },
                forced:true,
                priority:1,
                direct:true,
                filter:function (event,player){
        if(event.player==player||!event.player.isAlive()) return false;
        var history=event.player.getHistory('useCard');
        for(var i=0;i<history.length;i++){
            if(!history[i].targets) continue;
            for(var j=0;j<history[i].targets.length;j++){
                if(history[i].targets[j]!=event.player) return false;
            }
        }
        return true;
    },
                subSkill:{
                    mark:{
                        sub:true,
                    },
                },
                content:function (){
        "step 0"
        if(trigger.player.countCards('h')>player.countCards('h')||
           trigger.player.countCards('e')>player.countCards('e')||
           trigger.player.countCards('j')>player.countCards('j')){
            player.chooseControl('摸两张牌','获得'+get.translation(trigger.player)+'一张牌',true).set('prompt','窃听：请选择一项');
        }else{event.goto(2);}
        "step 1"
        if(result.index==0){
            player.logSkill('圣_qieting');
            player.draw(2);
            player.chooseToDiscard('he',true).set('ai',function(card){
            return 6-get.useful(card);
        });
            event.goto(4);
        }
        if(result.index==1){
            player.logSkill('圣_qieting');
            if(trigger.player.countCards('hej')>player.countCards('hej')&&!player.hasSkill('圣_qieting_mark')){
                player.gainPlayerCard('hej',trigger.player,1,true);
                player.addTempSkill('圣_qieting_mark');
                event.goto(4);}
            if(trigger.player.countCards('he')>player.countCards('he')&&!player.hasSkill('圣_qieting_mark')){
                player.gainPlayerCard('he',trigger.player,1,true);
                player.addTempSkill('圣_qieting_mark');
                event.goto(4);}
            if(trigger.player.countCards('hj')>player.countCards('hj')&&!player.hasSkill('圣_qieting_mark')){
                player.gainPlayerCard('hj',trigger.player,1,true);
                player.addTempSkill('圣_qieting_mark');
                event.goto(4);}
            if(trigger.player.countCards('ej')>player.countCards('ej')&&!player.hasSkill('圣_qieting_mark')){
                player.gainPlayerCard('ej',trigger.player,1,true);
                player.addTempSkill('圣_qieting_mark');
                event.goto(4);}
            if(trigger.player.countCards('h')>player.countCards('h')&&!player.hasSkill('圣_qieting_mark')){
                player.gainPlayerCard('h',trigger.player,1,true);
                player.addTempSkill('圣_qieting_mark');
                event.goto(4);}
            if(trigger.player.countCards('e')>player.countCards('e')&&!player.hasSkill('圣_qieting_mark')){
                player.gainPlayerCard('e',trigger.player,1,true);
                player.addTempSkill('圣_qieting_mark');
                event.goto(4);}
            if(trigger.player.countCards('j')>player.countCards('j')&&!player.hasSkill('圣_qieting_mark')){
                player.gainPlayerCard('j',trigger.player,1,true);
                player.addTempSkill('圣_qieting_mark');
                event.goto(4);}
        }
        "step 2"
        if(trigger.player.countCards('e')){
            if(trigger.player!=player){
            player.choosePlayerCard(trigger.player,'e','窃听：是否将一张装备牌移至你的装备区？').set(function(button){
                return _status.event.player.isEmpty(get.subtype(button.link));
            });
            }
        }else{player.logSkill('圣_qieting');
              player.draw();}
         "step 3"
        if(result&&result.links&&result.links.length){
            player.logSkill('圣_qieting');
            game.delay(2);
            trigger.player.$give(result.links[0],player);
            player.equip(result.links[0]);
            player.addExpose(0.2);
        } 
        "step 4"
        if(player.hasSkill('圣_qieting_mark')) player.removeSkill('圣_qieting_mark');
        event.finish();
    },
            },
            "圣_zhouyan":{
                trigger:{
                    global:["phaseBegin","useCard","gainEnd"],
                },
                filter:function (event,player){
        return _status.currentPhase==event.player&&
            get.distance(player,event.player)<=1&&
            event.player.countCards('e')>player.countCards('e');
    },
                forced:true,
                direct:true,
                content:function (){
        trigger.player.randomDiscard('e',true);
        trigger.player.addTempSkill('圣_zhouyan_card');
    },
                subSkill:{
                    card:{
                        mod:{
                            playerEnabled:function (card,player,target){
                    if(player!=target) return false;
                },
                        },
                        sub:true,
                    },
                },
            },
            "圣_xianzhou":{
                skillAnimation:true,
                animationColor:"gray",
                audio:"ext:混沌界:2",
                unique:true,
                limited:true,
                enable:"phaseUse",
                locked:true,
                filter:function (event,player){
        return player.countCards('e')>0;
    },
                filterTarget:function (card,player,target){
        return player!=target;
    },
                content:function (){
        "step 0"
        player.awakenSkill('圣_xianzhou');
        var cards=player.getCards('e');
        target.gain(cards,player,'give');
        event.num=cards.length;
        event.num3=cards.length;
        game.delay();
        "step 1"
        if(event.num3>0){
        if(target.countCards('h',{type:'equip'})>0){
            target.chooseToUse('h',{type:'equip'},'你还可以使用至多'+event.num3+'张装备牌');
        }}else{event.goto(3);}
        "step 2"
        if(result.bool){
            event.num3--;
            event.goto(1);
        }
        "step 3"
        target.chooseTarget([1,event.num],'请选择一项：<li>取消：令'+get.translation(player)+'恢复'+
            event.num+'点体力<li>对攻击范围内的至多'+event.num+'名角色各造成一点伤害<li>对攻击范围内的一名角色造成'+event.num+'点伤害',function(card,player,target2){
            return get.distance(_status.event.player,target2,'attack')<=1;
        }).set('ai',function(target2){
            var target=_status.event.player;
            var player=_status.event.getParent().player;
            if(get.attitude(target,player)>0){
                if(player.hp+event.num<=player.maxHp||player.hp==1) return -1;
            }
            return get.damageEffect(target2,target,target);
        });
        "step 4"
        if(result.bool){
            target.line(result.targets,'green');
            event.targets=result.targets;
            event.num2=0;
        }
        else{
            target.line(player);
            if(event.num>=player.maxHp-player.hp){
                player.draw((event.num-(player.maxHp-player.hp))*2);
                player.recover(event.num-(event.num-(player.maxHp-player.hp)));
            }else{
                player.recover(event.num);
            }
            event.finish();
        }
        "step 5"
        if(event.targets.length=1){
            event.targets[event.num2].damage(target,event.num);
        }else{
            if(event.num2<event.targets.length){
            event.targets[event.num2].damage(target);
            event.num2++;
            event.redo();
        }
        }
    },
                ai:{
                    order:1,
                    result:{
                        target:1,
                        player:function (player){
                var bool=true,players=game.filterPlayer();
                for(var i=0;i<players.length;i++){
                    if(players[i]!=player&&get.attitude(player,players[i])>2&&get.attitude(players[i],player)>2){
                        bool=false;break;
                    }
                }
                if(bool) return -10;
                if(player.hp==1) return 1;
                if(game.phaseNumber<game.players.length) return -10;
                if(player.countCards('e')+player.hp<=player.maxHp) return 1;
                return -10;
            },
                    },
                },
            },
            "圣_anxu":{
            audio:"ext:混沌界:2",
                enable:"phaseUse",
                usable:1,
                locked:true,
                filterCard:true,
                selectCard:true,
                position:"he",
                multitarget:true,
                targetprompt:["牌数多","牌数少"],
                filterTarget:function (card,player,target){
        var num=target.countCards('he');
        if(ui.selected.targets.length){
            return num<ui.selected.targets[0].countCards('he');
        }
        var players=game.filterPlayer();
        for(var i=0;i<players.length;i++){
            if(num>players[i].countCards('he')) return true;
        }
        return false;
    },
                selectTarget:2,
                content:function (){
        "step 0"
        if(targets[0].countCards('he')<targets[1].countCards('he')){
            targets[0].gainPlayerCard(targets[1],true,'he','visibleMove');
        }
        else{
            targets[1].gainPlayerCard(targets[0],true,'he','visibleMove');
        }
        "step 1"
        if(targets[0].countCards('h')>targets[1].countCards('h')){
            targets[0].chooseCard('选择一张牌交给'+get.translation(targets[1]),'he',true);
        }else{
            if(targets[0].countCards('h')<targets[1].countCards('h')){
            targets[1].chooseCard('选择一张牌交给'+get.translation(targets[0]),'he',true);
          }else{event.goto(3);}
       }
        "step 2"
        if(targets[0].countCards('h')>targets[1].countCards('h')){
            targets[1].gain(result.cards[0],targets[0],'giveAuto');
        }else{
        if(targets[1].countCards('h')>targets[0].countCards('h')){
            targets[0].gain(result.cards[0],targets[1],'giveAuto');
        }
        }
        "step 3"
        if(targets[0].countCards('h')==targets[1].countCards('h')){
        event.cards=get.cards();
        player.showCards(event.cards);
        }else{event.finish();}
        "step 4"
        if(get.suit(event.cards)=='spade'){
        player.loseHp();
        player.gain(event.cards);
        }
        else{
        player.recover();
        player.draw();
        }        
    },
                ai:{
                    order:10.5,
                    threaten:2.3,
                    result:{
                        target:function (player,target){
                var num=target.countCards('h');
                var att=get.attitude(player,target);
                if(ui.selected.targets.length==0){
                    if(att>0) return -1;
                    var players=game.filterPlayer();
                    for(var i=0;i<players.length;i++){
                        var num2=players[i].countCards('h');
                        var att2=get.attitude(player,players[i]);
                        if(num2<num){
                            if(att2>0) return -3;
                            return -1;
                        }
                    }
                    return 0;
                }
                else{
                    return 1;
                }
            },
                        player:1,
                    },
                },
            },
            "圣_shuya":{
                trigger:{
                    global:"loseEnd",
                },
                forced:true,
                direct:true,
                priority:100,
                filter:function (event,player){
        return event.cards&&event.cards.length>1&&
            event.player!=player&&
            !event.player.hasSkill('圣_shuya_mark');
    },
                content:function (){
        trigger.player.addTempSkill('圣_shuya_mark');
    },
                group:"圣_shuya_draw",
                subSkill:{
                    mark:{
                        sub:true,
                    },
                    draw:{
                        trigger:{
                            global:"drawEnd",
                        },
                        delay:false,
                        forced:true,
                        priority:100,
                        filter:function (event,player){
        return event.player!=player&&
            event.player.hasSkill('圣_shuya_mark');
    },
                        content:function (){
                player.draw(trigger.num);
    },
                        sub:true,
                    },
                },
            },
            "圣_zhuiyi":{
                skillAnimation:true,
                animationColor:"wood",
                audio:"ext:混沌界:2",
                trigger:{
                    player:"dying",
                },
                direct:true,
                priority:100,
                forced:true,
                content:function (){
        "step 0"
        player.chooseTarget(get.prompt2('圣_zhuiyi'),function(card,player,target){
            return player!=target
        }).ai=function(target){
                return get.attitude(player,target);
            };
        "step 1"
        if(result.bool){
            player.logSkill('圣_zhuiyi',result.targets[0]);
            player.line(result.targets[0],'green');
            result.targets[0].draw(3);
            if(!result.targets[0].isDamaged()&&result.targets[0].countCards('h')>result.targets[0].hp){
            player.loseMaxHp();
            player.recover(1-player.hp);
            }else{
            result.targets[0].addSkill('圣_zhuiyi_hp');
            result.targets[0].gainMaxHp();
            if(result.targets[0].isDamaged()){
            result.targets[0].recover(player.maxHp);
            }
            }
           }
         "step 2"
         if(result.bool){
          player.awakenSkill('圣_zhuiyi');
          }
    },
                ai:{
                    expose:0.5,
                },
                subSkill:{
                    hp:{
                        init:function (player){
        player.storage.圣_zhuiyi_hp_maxHp=player.maxHp;
        player.storage.圣_zhuiyi_hp_hp=player.hp;
    },
                        trigger:{
                            player:"phaseBegin",
                        },
                        forced:true,
                        priority:100,
                        direct:true,
                        content:function (){
                "step 0"
                if(player.maxHp>player.storage.圣_zhuiyi_hp_maxHp){
                    player.loseMaxHp(player.maxHp-player.storage.圣_zhuiyi_hp_maxHp)._triggered=null;
                }
                if(player.hp>player.storage.圣_zhuiyi_hp_hp){
                    player.loseHp(player.hp-player.storage.圣_zhuiyi_hp_hp)._triggered=null;
                }
                "step 1"
                player.removeSkill('圣_zhuiyi_hp');
            },
                        sub:true,
                    },
                },
            },
            "圣_zenhui":{
                audio:"ext:混沌界:2",
                trigger:{
                    player:"useCardToPlayer",
                },
                filter:function (event,player){
        if(player.hasSkill('圣_zenhui_mark')) return false;
        if(event.targets.length>1) return false;
        var card=event.card;
        if(card.name=='sha') return true;
        if(get.color(card)=='black'&&get.type(card)=='trick') return true;
        return false;
    },
                forced:true,
                direct:true,
                content:function (){
        "step 0"
        player.chooseTarget(get.prompt2('圣_zenhui'),function(card,player,target){
            if(target==player) return false;
            if(target.hasSkill('圣_diyu_mark')) return false;
            var trigger=_status.event.getTrigger();
            return !trigger.targets.contains(target);
        }).set('ai',function(target){
            var player=_status.event.player;
            return get.effect(target,_status.event.getTrigger().card,player,player);
        });
        "step 1"
        if(result.bool){
            game.delay(0,200);
            event.target=result.targets[0];
        }
        else{
            event.finish();
        }
        "step 2"
        player.addSkill('圣_zenhui_mark');
        game.delay();
        player.logSkill('圣_zenhui',event.target);
        event.target.chooseCard('交给'+get.translation(player)+'一张手牌，或成为'+
        get.translation(trigger.card)+'的额外目标').set('ai',function(card){
            return 5-get.value(card);
        });
        "step 3"
        if(result.bool){
            player.gain(result.cards,event.target,'giveAuto');
            if(!event.target.hasSkill('圣_diyu_mark')){
                event.target.addSkill('圣_diyu_mark');
            }
            trigger.untrigger();
            trigger.getParent().player=event.target;
            game.log(event.target,'成为了',trigger.card,'的使用者');
        }
        else{
            if(event.target.countCards('he')){
                event.target.chooseToDiscard('he',true).set('ai',function(card){
            return 6-get.useful(card);
        });
            }else{
                event.target.loseHp();
            }
            game.log(event.target,'成为了',trigger.card,'的额外目标');
            trigger.getParent().targets.push(event.target);
        }
        "step 4"
        player.removeSkill('圣_zenhui_mark');
    },
                subSkill:{
                    mark:{
                        sub:true,
                    },
                },
            },
            "圣_jiaojin":{
                audio:"ext:混沌界:2",
                trigger:{
                    player:"damageBegin",
                },
                filter:function (event,player){
        return player.countCards('he',{type:'equip'})&&event.num>0;
    },
                forced:true,
                direct:true,
                content:function (){
        "step 0"
        var next=player.chooseToDiscard('he','骄矜：是否弃置一张装备牌防止此伤害？',function(card,player){
            return get.type(card)=='equip';
        });
        next.set('ai',function(card){
            var player=_status.event.player;
            if(player.hp==1||_status.event.getTrigger().num>1){
                return 9-get.value(card);
            }
            if(player.hp==2){
                return 8-get.value(card);
            }
            return 7-get.value(card);
        });
        next.logSkill='圣_jiaojin';
        "step 1"
        if(result.bool){
            game.delay(0.5);
            trigger.cancel();
        }
        "step 2"
        if(result.bool){
        if(trigger.source&&trigger.source.sex=='male'){
        var list=game.filterPlayer();
        for(var i=0;i<list.length;i++){
            if(list[i]!=player&&list[i]!=trigger.source&&list[i].hasSkill('圣_diyu_mark')){
                list[i].removeSkill('圣_diyu_mark');
                list[i].useCard({name:"juedou"},trigger.source,false);
            }
        }
        }
        if(trigger.source&&trigger.source.sex=='female'){
        var list=game.filterPlayer();
        for(var i=0;i<list.length;i++){
            if(list[i]!=player&&list[i]!=trigger.source&&list[i].hasSkill('圣_diyu_mark')){
                list[i].removeSkill('圣_diyu_mark');
                list[i].useCard({name:"sha"},trigger.source,false);
            }
        }
        }
      }
    },
            },
            "圣_diyu":{
                trigger:{
                    global:"damageEnd",
                },
                forced:true,
                priority:-1,
                filter:function (event,player){
        return _status.currentPhase!=event.player&&
        event.source!=player&&event.player!=player&&
        event.card&&event.card.name=='sha'&&event.num>0;
    },
                content:function (){
        "step 0"
        player.line(trigger.source);
        "step 1"
        game.delay();
        trigger.source.draw();
        player.draw();
        "step 2"
        if(!trigger.source.hasSkill('圣_diyu_mark')){
           trigger.source.chooseToDiscard('诋谀：请弃置一张牌','he',true).set('ai',function(card){
            return 6-get.useful(card);
        });
           player.chooseToDiscard('诋谀：请弃置一张牌','he',true).set('ai',function(card){
            return 6-get.useful(card);
        });
        }
    },
                subSkill:{
                    mark:{
                        mark:true,
                        marktext:"谀",
                        intro:{
                            content:"该角色已获得“谀”印记",
                        },
                        sub:true,
                    },
                },
            },
            "圣_meibunew":{
                audio:"ext:混沌界:2",
                trigger:{
                    global:"useCard",
                },
                forced:true,
                gainable:true,
                filter:function (event,player){
        return event.targets.contains(player)&&player!=event.player;
    },
                content:function (){},
                global:"圣_meibunew_buff",
                subSkill:{
                    buff:{
                        mod:{
                            targetEnabled:function (card,player,target){
                        if(player.hasSkill('圣_meibunew')) return;
                        if(target.hasSkill('圣_meibunew')) return;
                        if(game.hasPlayer(function(current){
                            return current.hasSkill('圣_meibunew');
                        })){
                            return false;
                        }
                },
                        },
                        sub:true,
                    },
                },
            },
            "圣_meibu":{
                audio:"ext:混沌界:2",
                trigger:{
                    global:"phaseBegin",
                },
                filter:function (event,player){
        return event.player!=player&&event.player.isAlive()&&
        player.countCards('he')>0;
    },
                forced:true,
                direct:true,
                priority:-1,
                checkx:function (event,player){
        var e2=player.getEquip(2);
        if(e2){
            if(e2.name=='tengjia') return true;
            if(e2.name=='bagua') return true;
        }
        return event.player.countCards('h')>event.player.hp&&
        get.attitude(player,event.player)<0;
    },
                content:function (){
        "step 0"
        var check=lib.skill.圣_meibu.checkx(trigger,player);
        player.chooseCard(get.prompt('圣_meibu',trigger.player),'你可以交给其一张牌，然后令该角色于本回合内获得多种限制效果','he').set('ai',function(card){
            if(_status.event.check) return 6-get.value(card);
            return 0;
        }).set('check',check);
        "step 1"
        if(result.bool){
            player.logSkill('圣_meibu',trigger.player);
            player.line(trigger.player,'green');
            trigger.player.gain(result.cards[0],player,'giveAuto');
            player.addTempSkill('圣_meibunew');
            trigger.player.addTempSkill('圣_meibu_debuff');
        }
    },
                ai:{
                    expose:0.2,
                },
                subSkill:{
                    debuff:{
                        mark:true,
                        onremove:true,
                        unique:true,
                        charlotte:true,
                        intro:{
                            content:"该角色于本回合内的锦囊与装备牌均视为【杀】。当该角色于本回合内造成伤害时，其失去一点体力并于本回合内无法使用任何手牌",
                        },
                        mod:{
                            cardname:function (card,player){
                    if(['trick','delay','equip'].contains(lib.card[card.name].type)) return 'sha';
                },
                        },
                        trigger:{
                            source:"damageEnd",
                        },
                        forced:true,
                        direct:true,
                        content:function (){
                player.loseHp();
                player.addTempSkill('圣_meibu_card','phaseUseEnd');
            },
                        ai:{
                            presha:true,
                            pretao:true,
                            nokeep:true,
                        },
                        sub:true,
                    },
                    card:{
                        mod:{
                            cardEnabled:function (card,player){
               return false;
           },
                            cardUsable:function (card,player){
                return false;
            },
                            cardSavable:function (card,player){
                return false;
            },
                        },
                        sub:true,
                    },
                },
            },
            "圣_zhixi":{
                init:function (player){
        player.storage.圣_zhixi=0;
    },
                trigger:{
                    player:"useCardEnd",
                },
                forced:true,
                direct:true,
                content:function (){
        'step 0'
        player.storage.圣_zhixi++;
        player.markSkill('圣_zhixi');
        player.syncStorage('圣_zhixi');
        'step 1'
        if(player.storage.圣_zhixi>=player.hp){
            player.logSkill('圣_zhixi');
            player.draw(player.hp);
            player.storage.圣_zhixi=0;
            player.markSkill('圣_zhixi');
            player.syncStorage('圣_zhixi');
            var evt=trigger.getParent('phaseUse');
            if(evt&&evt.name=='phaseUse'){
                evt.skipped=true;
            }
            player.skip('phaseDiscard');
            player.skip('phaseEnd');
        }
    },
                group:"圣_zhixi_End",
                subSkill:{
                    End:{
                        trigger:{
                            player:"phaseEnd",
                        },
                        forced:true,
                        direct:true,
                        filter:function (event,player){
                return player.storage.圣_zhixi>0;
            },
                        content:function (){
                player.storage.圣_zhixi=0;
            player.markSkill('圣_zhixi');
            player.syncStorage('圣_zhixi');
            },
                        sub:true,
                    },
                },
            },
            "圣_mumu":{
                audio:"ext:混沌界:2",
                trigger:{
                    player:"phaseBegin",
                },
                locked:true,
                filter:function (event,player){
       var num=game.countPlayer(function(current){
            return current!=player&&current.countCards('e')>0;
        });
        return num>0;
    },
                content:function (){
        'step 0'
        if(player.countCards('e')){
            player.discard(player.getCards('e'),true)
        }else{
            player.loseHp();
        }
        'step 1'
        player.chooseControlList(get.prompt2('圣_mumu'),[
                '弃置一名其他角色装备区内的所有牌',
                '获得一名其他角色装备区内的所有牌并于本回合内无法使用【杀】'
            ],true).set('ai',function(event,player){
                return 1;
            });
        'step 2'
        if(result.index==0){
            player.chooseTarget('【穆穆】：弃置一名其他角色装备区内的所有牌',true,function(card,player,target){
            return target.countCards('e')>0;
        },function(target){
            return -get.attitude(_status.event.player,target);
        });
        }else{
            player.chooseTarget('【穆穆】：获得一名其他角色装备区内的所有牌',true,function(card,player,target){
            return target.countCards('e')>0;
        },function(target){
            return -get.attitude(_status.event.player,target);
        });
        event.goto(4);
        }
        'step 3'
        result.targets[0].discard(result.targets[0].getCards('e'),true);
        event.finish();
        'step 4'
        player.gain(result.targets[0].getCards('e'),result.targets[0],'giveAuto');
        player.addTempSkill('圣_mumu_buff')
    },
                subSkill:{
                    buff:{
                        mod:{
                            cardEnabled:function (card,player){
            if(card.name=='sha'&&_status.currentPhase==player&&
                _status.event.getParent('phaseUse')){
                return false;
            }
        },
                        },
                        sub:true,
                    },
                },
            },
            "圣_yanshi":{
                audio:"ext:混沌界:2",
                enable:"phaseUse",
                locked:true,
                selectTarget:-1,
                filterCard:true,
                selectCard:2,
                position:"he",
                filter:function (event,player){
        return !player.hasSkill('圣_yanshi_mark')&&
            player.countCards('he')>=2;
    },
                filterTarget:function (card,player,target){
        return target!=player&&!target.hasSkill('圣_faluan_mark');
    },
                content:function (){
        "step 0"
        if(!player.hasSkill('圣_xueyi_buff')){
        if(get.suit(event.cards[0])!=get.suit(event.cards[1])){
            player.addTempSkill('圣_yanshi_mark');
        }
        }
        "step 1"
        if(!player.hasSkill('圣_xueyi_buff')){
        player.link(true);
        }
        "step 2"
        target.chooseToRespond({name:'shan'}).set('ai',function(card){
            var evt=_status.event.getParent();
            if(get.damageEffect(evt.target,evt.player,evt.target)>=0) return 0;
            if(evt.player.hasSkillTag('notricksource')) return 0;
            if(evt.target.hasSkillTag('notrick')) return 0;
            if(evt.target.hasSkillTag('noShan')){
                return -1;
            }
            return 11-get.value(card);
        }).autochoose=lib.filter.autoRespondShan;
        "step 3"
        if(result.bool==false){
            target.damage(player,'fire',true);
         }else{
             player.draw();
         } 
    },
                ai:{
                    basic:{
                        order:9,
                        useful:1,
                        value:5,
                    },
                    result:{
                        target:function (player,target){
                if(player.hasUnknown(2)&&get.mode()!='guozhan') return 0;
                var nh=target.countCards('h');
                if(get.mode()=='identity'){
                    if(target.isZhu&&nh<=2&&target.hp<=1) return -100;
                }
                if(nh==0) return -2;
                if(nh==1) return -1.7
                return -1.5;
            },
                    },
                    tag:{
                        respond:1,
                        respondShan:1,
                        damage:1,
                        multitarget:1,
                        multineg:1,
                    },
                },
                subSkill:{
                    mark:{
                        sub:true,
                    },
                },
            },
            "圣_xueyi":{
                trigger:{
                    player:"phaseBegin",
                },
                forced:true,
                priority:-1,
                content:function (){
        if(player.hp>player.countCards('h')){
            player.addTempSkill('圣_xueyi_buff');
            game.log(player,'于本回合内使用技能','#g〖炎矢〗','时不会被横置且无使用次数限制');
        }else{
           player.addTempSkill('圣_xueyi_card',{player:"phaseDiscardAfter"});
            game.log(player,'于本回合内的手牌上限额外增加');
        }
    },
                subSkill:{
                    card:{
                        mark:true,
                        intro:{
                            content:"你的手牌上限额外增加#",
                        },
                        mod:{
                            maxHandcard:function (player,num){
            return num+=player.storage.圣_xueyi_card;
        },
                        },
                        onremove:function (player){
        player.storage.圣_xueyi_card=1;
    },
                        init:function (player){
        player.storage.圣_xueyi_card=1;
    },
                        trigger:{
                            player:"loseEnd",
                        },
                        direct:true,
                        forced:true,
                        priority:-1,
                        filter:function (event,player){
                return event.getParent(2).skill=='圣_yanshi'&&event.num>0;
            },
                        content:function (){
            player.storage.圣_xueyi_card+=trigger.num;
            player.markSkill('圣_xueyi_card');
            player.syncStorage('圣_xueyi_card');
            },
                        sub:true,
                    },
                    buff:{
                        sub:true,
                    },
                },
            },
            "圣_faluan":{
                audio:"ext:混沌界:2",
                enable:"phaseUse",
                usable:1,
                locked:true,
                filterCard:true,
                selectCard:2,
                position:"he",
                discard:false,
                lose:true,
                filterTarget:function (card,player,target){
        return target.countCards('h')>0&&target!=player;
    },
                filter:function (event,player){
        return player.countCards('h')>2;
    },
                content:function (){
        "step 0"
        player.line(target);
        player.$give(cards.length,target);
        target.gain(cards,player);
        "step 1"
        game.delay();
        player.chooseToCompare(target);
        "step 2"
        if(result.bool){
            target.line(player),
            player.gainPlayerCard(target,'he',Infinity,true);
            player.addTempSkill('圣_faluan_buff');
            target.addTempSkill('圣_faluan_mark');
            if(game.countPlayer()<=2&&!player.hasSkill('圣_yanshi_mark')){
            player.addTempSkill('圣_yanshi_mark');
            }
        }else{
            target.line(player),
            player.damage(target,true);
            player.addTempSkill('圣_yanshi_mark');
        }
    },
         ai:{
         result:{
         target:function (player,target){
                return target.countCards('h')>player.countCards('h');
            },
         },
         },
                subSkill:{
                    buff:{
                        trigger:{
                            source:"damageEnd",
                        },
                        direct:true,
                        forced:true,
                        priority:-1,
                        filter:function (event,player){
                return event.num>0&&
                event.player!=player&&
                !event.player.hasSkill('圣_faluan_mark');
            },
                        content:function (){
               "step 0"
               event.targets=game.filterPlayer();
                event.targets.remove(player);
                event.targets.sort(lib.sort.seat);
                "step 1"
                if(event.targets.length){
            var target=event.targets.shift();
            if(target.hasSkill('圣_faluan_mark')){
                target.draw(trigger.num);
            }
               event.redo();
        }
            },
                        sub:true,
                    },
                    mark:{
                        sub:true,
                    },
                },
            },
            "圣_zhenlie":{
                audio:"ext:混沌界:2",
                filter:function (event,player){
        return event.player!=player&&event.card;
    },
                logTarget:"player",
                check:function (event,player){
        if(event.getParent().excluded.contains(player)) return false;
        if(get.attitude(player,event.player)>0){
            return false;
        }
        if(get.tag(event.card,'respondSha')){
            if(player.countCards('h',{name:'sha'})==0){
                return true;
            }
        }
        else if(get.tag(event.card,'respondShan')){
            if(player.countCards('h',{name:'shan'})==0){
                return true;
            }
        }
        else if(get.tag(event.card,'damage')){
            if(player.countCards('h')<2) return true;
        }
        else if(event.card.name=='shunshou'&&player.hp>2){
            return true;
        }
        return false;
    },
                trigger:{
                    target:"useCardToTargeted",
                },
                content:function (){
        "step 0"
        player.loseHp();
        "step 1"
        trigger.getParent().excluded.add(player);
        "step 2"
        trigger.player.draw();
        "step 3"
        if(trigger.player.countCards('he')){
            if(trigger.player.hp>player.hp){
            var num=trigger.player.hp-player.hp;
             }else{
            var num=1;
             }
            player.chooseCardButton(trigger.player,[1,num],'贞烈：你可以弃置'+get.translation(trigger.player)+'至多'+get.translation(num)+'张手牌',trigger.player.getCards('h'));
        }
        "step 4"
        if(result.bool){
            trigger.player.discard(result.links)
        }
        "step 5"
        if(result.bool){
            if(result.links.length<=player.maxHp-player.hp){
                if(trigger.player.countCards('h')){
                    trigger.player.showHandcards();
                }else{
                    if(trigger.player.countCards('e')){
                        trigger.player.chooseToDiscard('e',true);
                    }
                }
                trigger.player.loseHp();
            }
        }
    },
                ai:{
                    expose:0.3,
                },
            },
            "圣_lieran":{
                trigger:{
                    player:"judge",
                },
                forced:true,
                content:function (){
        "step 0"
        var card=get.cards()[0];
        event.card=card;
        game.cardsGotoOrdering(card).relatedEvent=trigger;
        "step 1"
        player.$throw(card);
        "step 2"
        if(get.color(player.judging[0])!=get.color(card)){
        card.clone.classList.add('thrownhighlight');
        if(trigger.player.judging[0].clone){
            trigger.player.judging[0].clone.classList.remove('thrownhighlight');
            game.addVideo('deletenode',player,get.cardsInfo([trigger.player.judging[0].clone]));
        }
        game.cardsDiscard(trigger.player.judging[0]);
        trigger.player.judging[0]=card;
        game.log(trigger.player,'的判定牌改为',card);
        game.delay(2);
      }else{
          game.delay(2);
          player.gain(player.judging[0],'gain2');
          player.gain(card,'gain2');
      }
    },
            },
            "圣_miji":{
                audio:"ext:混沌界:2",
                trigger:{
                    player:["phaseBegin","phaseEnd"],
                },
                filter:function (event,player){
        return player.isDamaged()&&!player.hasSkill('圣_miji_mark');
    },
                locked:true,
                content:function (){
        "step 0"
        player.judge(function(card){
            return get.color(card)=='black'?1:-1;
        });
        "step 1"
        if(result.bool){
        player.addTempSkill('圣_miji_mark');
        event.num=player.getDamagedHp();
        player.draw(event.num);
        var check=player.countCards('h')-event.num;
        player.chooseCardTarget({
            selectCard:[1,event.num],
            filterTarget:function(card,player,target){
                return player!=target&&target.isDamaged();
            },
            ai1:function(card){
                var player=_status.event.player;
                if(player.maxHp-player.hp==1&&card.name=='du') return 30;
                var check=_status.event.check;
                if(check<1) return 0;
                if(player.hp>1&&check<2) return 0;
                return get.unuseful(card)+9;
            },
            ai2:function(target){
                var att=get.attitude(_status.event.player,target);
                if(ui.selected.cards.length==1&&ui.selected.cards[0].name=='du') return 1-att;
                return att-2;
            },
            prompt:'秘计：是否将至多'+get.cnNumber(event.num)+'张手牌置于一名已受伤的其他角色的武将牌旁？',
        }).set('check',check);
        }
        "step 2"
        if(result.bool){
            player.logSkill('圣_miji_mark');
            result.targets[0].addSkill('圣_miji_buff');
            player.line(result.targets[0],'green');
            player.$give(result.cards.length,result.targets[0]);
            player.lose(result.cards,ui.special);
            result.targets[0].storage.圣_miji_buff=result.targets[0].storage.圣_miji_buff.concat(result.cards);
            result.targets[0].syncStorage('圣_miji_buff');
            result.targets[0].markSkill('圣_miji_buff');
            game.log(player,'将',result.cards,'置于',result.targets[0],'的武将牌上称为','#y“计”');
        }
    },
                ai:{
                    threaten:function (player,target){
            if(target.hp==1) return 3;
            if(target.hp==2) return 1.5;
            return 0.5;
        },
                    effect:{
                        target:function (card,player,target){
                if(get.tag(card,'recover')&&player.hp>=player.maxHp-1) return [0,0];
            },
                    },
                },
                subSkill:{
                    mark:{
                    audio:"ext:混沌界:2",
                        sub:true,
                    },
                    buff:{
                        trigger:{
                            target:"useCardToTargeted",
                        },
                        forced:true,
                        filter:function (event,player){
        return player.storage.圣_miji_buff.length>0&&
            event.card&&event.card.name=='sha';
    },
                        notemp:true,
                        marktext:"计",
                        intro:{
                            content:"cards",
                        },
                        onremove:function (player){
        player.storage.圣_miji_buff=[];
    },
                        init:function (player){
        player.storage.圣_miji_buff=[];
    },
                        content:function (){
        "step 0"
        player.gain(player.storage.圣_miji_buff,'fromStorage',player,'giveAuto');
        game.addVideo('storage',player,['圣_miji_buff',get.cardsInfo(player.storage.圣_miji_buff),'cards']);    
        "step 1"
        player.storage.圣_miji_buff=[];
        player.markSkill('圣_miji_buff');
        player.syncStorage('圣_miji_buff');
        "step 2"
        trigger.getParent().excluded.add(player);
        "step 3"
        player.removeSkill('圣_miji_buff');
    },
                        sub:true,
                    },
                },
            },
            "圣_lieyin":{
            audio:"ext:混沌界:2",
                marktext:"烈",
                intro:{
                    content:"你当前持有#枚“烈”印记",
                },
                init:function (player){
        player.storage.圣_lieyin=0;
    },
                trigger:{
                    global:"gameStart",
                    player:"recoverEnd",
                },
                forced:true,
                priority:100,
                filter:function (event,player){
        return !player.isDamaged();
    },
                content:function (){
        "step 0"
        event.num=player.hp;
        player.storage.圣_lieyin+=event.num;
        player.markSkill('圣_lieyin');
        player.syncStorage('圣_lieyin');
        "step 1"
        player.loseHp(event.num-1);
    },
                group:["圣_lieyin_sha","圣_lieyin_dying"],
                subSkill:{
                    sha:{
                    audio:"ext:混沌界:2",
                        trigger:{
                            player:"useCard",
                        },
                        forced:true,
                        priority:-1,
                        filter:function (event,player){
                return event.card&&event.card.name=='sha'&&
                    player.storage.圣_lieyin>0;
            },
                        content:function (){
                "step 0"
                player.storage.圣_lieyin--;
                player.markSkill('圣_lieyin');
                player.syncStorage('圣_lieyin');
                "step 1"
                if(!trigger.baseDamage) trigger.baseDamage=1;
                trigger.baseDamage+=trigger.baseDamage;
            
            },
                        sub:true,
                    },
                    dying:{
                    audio:"ext:混沌界:2",
                        trigger:{
                            player:"dying",
                        },
                        forced:true,
                        priority:-1,
                        filter:function (event,player){
                return player.storage.圣_lieyin>0;
            },
                        content:function (){
                "step 0"
                player.storage.圣_lieyin--;
                player.markSkill('圣_lieyin');
                player.syncStorage('圣_lieyin');
                "step 1"
                player.recover(1-player.hp);
            },
                        sub:true,
                    },
                },
            },
            "圣_liaoya":{
                trigger:{
                    player:"damageEnd",
                },
                forced:true,
                filter:function (event,player){
        return event.source&&event.source!=player;
    },
                content:function (){
        "step 0"
        player.line(trigger.source);
        "step 1"
        if(!trigger.source.hasSkill('圣_liaoya_mark')){
            trigger.source.addSkill('圣_liaoya_mark');
        }else{
            trigger.source.removeSkill('圣_liaoya_mark');
            player.gainPlayerCard(trigger.source,'he',Infinity,true);
        }
    },
                group:["圣_liaoya_sha","圣_liaoya_die"],
                subSkill:{
                    mark:{
                        marktext:"獠",
                        locked:true,
                        mark:true,
                        intro:{
                            content:"神张飞对该角色使用的【杀】不计入出牌次数限制且不可闪避",
                        },
                        sub:true,
                    },
                    sha:{
                        trigger:{
                            player:"useCardToPlayered",
                        },
                        forced:true,
                        direct:true,
                        filter:function (event,player){
        return event.card&&event.card.name=='sha'&&
            event.target.hasSkill('圣_liaoya_mark');
    },
                        content:function (){
           player.getStat().card.sha--;
            trigger.getParent().directHit.add(trigger.target);
    },
                        sub:true,
                    },
                    die:{
                        trigger:{
                            player:["dieAfter"],
                        },
                        forced:true,
                        direct:true,
                        content:function (){
                var list=game.filterPlayer();
        for(var i=0;i<list.length;i++){
            if(list[i]!=player&&list[i].hasSkill('圣_liaoya_mark')){
                list[i].removeSkill('圣_liaoya_mark');
            }
        }
            },
                        sub:true,
                    },
                },
            },
            "圣_huangnu":{
                skillAnimation:"epic",
                animationColor:"thunder",
                audio:"ext:混沌界:2",
                derivation:["圣_changxiao","圣_xueli"],
                trigger:{
                    player:"phaseBegin",
                },
                filter:function (event,player){
        return !player.storage.圣_lieyin&&player.isDamaged();
    },
                forced:true,
                unique:true,
                content:function (){
        "step 0"
        player.storage.圣_lieyin+=4;
        player.markSkill('圣_lieyin');
        player.syncStorage('圣_lieyin');
        "step 1"
        player.addSkill('圣_huangnu_buff');
        player.awakenSkill('圣_huangnu');
    },
                subSkill:{
                    buff:{
                        mod:{
                            globalFrom:function (from,to,distance){
            return distance-Infinity;
        },
                            cardname:function (card,player){
            return 'sha';
        },
                        },
                        trigger:{
                            player:"phaseEnd",
                        },
                        forced:true,
                        direct:true,
                        priority:1,
                        content:function (){
                "step 0"
                player.recover();
                "step 1"
                player.removeSkill('圣_lieyin');
                player.removeSkill('圣_liaoya');
                player.addSkill('圣_changxiao');
                player.addSkill('圣_xueli');
                "step 2"
                var list=game.filterPlayer();
        for(var i=0;i<list.length;i++){
            if(list[i]!=player&&list[i].hasSkill('圣_liaoya_mark')){
                player.line(list[i]);
                list[i].removeSkill('圣_liaoya_mark');
                player.gainPlayerCard(list[i],'he',Infinity,true);
            }
        }
                "step 3"
                player.removeSkill('圣_huangnu_buff');
            },
                        sub:true,
                    },
                },
            },
            "圣_changxiao":{
                audio:"ext:混沌界:2",
                trigger:{
                    target:"useCardToTargeted",
                },
                forced:true,
                priority:1,
                filter:function (event,player){
        return event.card.name=='sha'&&event.player.isAlive();
    },
                content:function (){
        "step 0"
        player.line(trigger.player);
        trigger.player.draw();
        "step 1"
        player.gain(game.createCard('sha'),'gain2');
        "step 2"
        trigger.player.addSkill('圣_changxiao_mark');
    },
                group:["圣_changxiao_buff","圣_changxiao_End"],
                subSkill:{
                    mark:{
                        marktext:"猖",
                        locked:true,
                        mark:true,
                        intro:{
                            content:"神张飞对该角色使用的【杀】不计入出牌次数限制且不可闪避",
                        },
                        sub:true,
                    },
                    buff:{
                        trigger:{
                            player:"useCardToPlayered",
                        },
                        forced:true,
                        direct:true,
                        filter:function (event,player){
        return event.card&&event.card.name=='sha'&&
            event.target.hasSkill('圣_changxiao_mark');
    },
                        content:function (){
           player.getStat().card.sha--;
            trigger.getParent().directHit.add(trigger.target);
    },
                        sub:true,
                    },
                    End:{
                        trigger:{
                            player:["phaseEnd","dieAfter"],
                        },
                        forced:true,
                        direct:true,
                        priority:1,
                        content:function (){
                var list=game.filterPlayer();
        for(var i=0;i<list.length;i++){
            if(list[i]!=player&&list[i].hasSkill('圣_changxiao_mark')){
                list[i].removeSkill('圣_changxiao_mark');
            }
        }
            },
                        sub:true,
                    },
                },
            },
            "圣_xueli":{
            audio:"ext:混沌界:2",
                enable:"phaseUse",
                usable:1,
                locked:true,
                filter:function (event,player){
        return player.countCards('h',{color:'red'});
    },
                content:function (){
        "step 0"
        player.showHandcards();
        player.addTempSkill('圣_xueli_buff');
        player.addTempSkill('圣_xueli_source');
        player.addTempSkill('圣_xueli_damage');
        "step 1"
        player.discard(player.getCards('h',{color:'red'}),Infinity,true);
        "step 2"
        var list=game.filterPlayer();
        for(var i=0;i<list.length;i++){
            if(list[i]!=player&&list[i].countCards('h')>player.countCards('h')){
                list[i].useCard({name:"sha"},player,false);
          }
        }
        "step 3"
        if(!player.hasSkill('unequip')){
        player.addTempSkill('unequip');
        }
    },
                subSkill:{
                    buff:{
                        trigger:{
                            player:"phaseEnd",
                        },
                        forced:true,
                        direct:true,
                        content:function (){
                "step 0"
                if(player.storage.圣_xueli_damage>0){
                    player.loseHp(player.storage.圣_xueli_damage);
                }
                "step 1"
                player.storage.圣_xueli_damage=0;
                player.markSkill('圣_xueli_damage');
                player.syncStorage('圣_xueli_damage');
                "step 2"
                player.removeSkill('圣_xueli_buff');
            },
                        sub:true,
                    },
                    source:{
                        trigger:{
                            source:"damageBegin",
                        },
                        forced:true,
                        direct:true,
                        filter:function (event,player){
                return player.storage.圣_xueli_damage>0;
            },
                        content:function (){
                "step 0"
                player.storage.圣_xueli_damage-=trigger.num;
                player.markSkill('圣_xueli_damage');
                player.syncStorage('圣_xueli_damage');
                "step 1"
                if(player.storage.圣_xueli_damage<0){
                player.storage.圣_xueli_damage=0;
                player.markSkill('圣_xueli_damage');
                player.syncStorage('圣_xueli_damage');
                }
            },
                        sub:true,
                    },
                    damage:{
                        mark:true,
                        marktext:"谑",
                        intro:{
                            content:function (storage){
            if(storage>0) return '你于本回合内至少还需造成'+storage+'点伤害才可无需失去体力';
            return '你于本回合内不会失去体力值';
        },
                        },
                        init:function (player){
                player.storage.圣_xueli_damage=0;
            },
                        trigger:{
                            player:"damageBegin",
                        },
                        forced:true,
                        direct:true,
                        filter:function (event,player){
                return event.card.name=='sha';
            },
                        content:function (){
                "step 0"
                player.storage.圣_xueli_damage+=trigger.num;
                player.markSkill('圣_xueli_damage');
                player.syncStorage('圣_xueli_damage');
                "step 1"
                trigger.cancel();
            },
                        sub:true,
                    },
                },
            },
            "圣_jieyuan":{
                audio:"ext:混沌界:2",
                trigger:{
                    source:"damageBegin",
                },
                forced:true,
                direct:true,
                filter:function (event,player){
        return player.countCards('h')&&event.player!=player;
    },
                content:function (){
        "step 0"
        if(player.hasSkill('圣_jieyuan_sourcemark')){
        if(trigger.player.hp<player.hp){
        event.finish();
        }}
        "step 1"
        player.logSkill('圣_jieyuan',trigger.player);
        player.showHandcards();
        "step 2"
        if(player.countCards('h',{color:'black'})>0){
        var num=player.countCards('h',{color:'black'});
        if(player.hasSkill('圣_jieyuan_damagemark')){
        player.discard(player.getCards('h',{color:'black'}),true);
        }
        event.num=num;
        }else{
        trigger.num++;
        event.finish();
        }
        "step 3"
        trigger.num+=event.num;
    },
                group:["圣_jieyuan_damage","圣_jieyuan_start"],
                subSkill:{
                    sourcemark:{
                        sub:true,
                    },
                    damagemark:{
                        sub:true,
                    },
                    start:{
                    trigger:{
                            global:"gameStart",
                        },
                        forced:true,
                        direct:true,
                        priority:100,
                        content:function (){
                        player.addSkill('圣_jieyuan_sourcemark');
                        player.addSkill('圣_jieyuan_damagemark');
                        },
                    },
                    damage:{
                    audio:"ext:混沌界:2",
                        trigger:{
                            player:"damageBegin",
                        },
                        forced:true,
                        direct:true,
                        filter:function (event,player){
        return player.countCards('h')&&event.source&&event.source!=player;
    },
                        content:function (){
        "step 0"
        if(player.hasSkill('圣_jieyuan_sourcemark')){
        if(trigger.source.hp<player.hp){
        event.finish();
        }}
        "step 1"
        player.showHandcards();
        "step 2"
        if(player.countCards('h',{color:'red'})>0){
        if(player.hasSkill('圣_jieyuan_damagemark')){
        player.discard(player.getCards('h',{color:'red'}),true);
        }
        player.logSkill('圣_jieyuan_damage',trigger.source);
        trigger.cancel();
        trigger.source.loseHp();
        }
    },
                        sub:true,
                    },
                },
            },
            "圣_yijue":{
                trigger:{
                    player:"damageBegin",
                },
                forced:true,
                priority:-100,
                filter:function (event,player){
        return event.num>0;
    },
                content:function (){
        "step 0"
        if(trigger.source&&trigger.source!=player&&!trigger.source.hasSkill('圣_yijue_debuff')){
            trigger.source.addSkill('圣_yijue_debuff');
            trigger.source.addSkill('圣_yijue_Debuff');
        }
        "step 1"
        if(player.hp==1){
        player.loseMaxHp(); 
        player.recover();
        }
    },
                subSkill:{
                  Debuff:{
                  trigger:{
                  global:"phaseAfter",
                  },
                  forced:true,
                  direct:true,
                  priority:-1,
                  content:function (){
                  player.removeSkill('圣_yijue_Debuff');
                  },
                  sub:true,
                  },
                    debuff:{
                        mark:true,
                        marktext:"绝",
                        intro:{
                            content:"该角色无法恢复体力值",
                        },
                        trigger:{
                            player:"recoverBegin",
                        },
                        forced:true,
                        direct:true,
                        content:function (){
           trigger.cancel();
           game.log(player,'无法恢复体力值');
        },
                        group:"圣_yijue_End",
                        sub:true,
                    },
                    End:{
                        trigger:{
                            player:"phaseEnd",
                        },
                        forced:true,
                        direct:true,
                        priority:100,
                        filter:function (event,player){
                        return !player.hasSkill('圣_yijue_Debuff');
                        },
                        content:function (){
            "step 0"
           player.removeSkill('圣_yijue_debuff');
           "step 1"
           player.removeSkill('圣_yijue_End');
        },
                        sub:true,
                    },
                },
            },
            "圣_fenxin":{
            audio:"ext:混沌界:3",
                trigger:{
                    global:"dieAfter",
                },
                forced:true,
                direct:true,
                priority:-1,
                filter:function (event,player){
        return event.player.hp<=0;
    },
                content:function (){
                "step 0"
        if(trigger.source&&trigger.source.hasSkill('圣_fenxin_mark')&&player.hasSkill('圣_jieyuan_sourcemark')){
            player.removeSkill('圣_jieyuan_sourcemark');
            player.logSkill('圣_fenxin');
            game.log(player,'发动技能','#g【竭缘】','时无需受到“当前体力值”的限制');
        }
        if(trigger.player.hasSkill('圣_fenxin_mark')&&player.hasSkill('圣_jieyuan_damagemark')){
            player.removeSkill('圣_jieyuan_damagemark');
            player.logSkill('圣_fenxin');
            game.log(player,'发动技能','#g【竭缘】','时无需弃置对应颜色的手牌');
        }
        "step 1"
        if(!player.hasSkill('圣_jieyuan_sourcemark')&&!player.hasSkill('圣_jieyuan_damagemark')){
        player.awakenSkill('圣_fenxin');
        }
    },
                group:"圣_fenxin_buff",
                subSkill:{
                    mark:{
                        sub:true,
                    },
                    buff:{
                        trigger:{
                            player:"damageAfter",
                        },
                        forced:true,
                        direct:true,
                        priority:100,
                        filter:function (event,player){
                return event.source&&event.num>0&&
                    event.source!=player&&event.source.isAlive();
            },
                        content:function (){
                trigger.source.addSkill('圣_fenxin_mark');
            },
                        sub:true,
                    },
                },
            },
            "圣_xunye":{
                trigger:{
                    global:"drawBegin",
                },
                forced:true,
                direct:true,
                filter:function (event,player){
        return event.player!=player&&
            event.player.countCards('h')<=player.countCards('h');
    },
                content:function (){
        trigger.player.addSkill('圣_xunye_mark');
    },
                group:"圣_xunye_draw",
                subSkill:{
                    mark:{
                        sub:true,
                    },
                    draw:{
                        trigger:{
                            global:"drawAfter",
                        },
                        forced:true,
                        direct:true,
                        content:function (){
                if(trigger.player.hasSkill('圣_xunye_mark')){
                    if(trigger.player.countCards('h')>player.countCards('h')&&player.isDamaged()){
                        player.logSkill('圣_xunye');
                        player.recover();
                    }
                    trigger.player.removeSkill('圣_xunye_mark')
                }
            },
                        sub:true,
                    },
                },
            },
            "圣_jieming":{
                audio:"ext:混沌界:2",
                trigger:{
                    player:"damageEnd",
                },
                direct:true,
                forced:true,
                content:function (){
        "step 0"
        event.count=trigger.num;
        "step 1"
        event.count--;
        player.chooseTarget(get.prompt2('圣_jieming'),function(card,player,target){
            return !target.hasSkill('圣_jieming_mark');
        }).set('ai',function(target){
            var att=get.attitude(_status.event.player,target);
            if(att>2){
                return target.maxHp-target.countCards('h');
            }
            return att/3;
        });
        "step 2"
        if(result.bool){
            player.logSkill('圣_jieming',result.targets);   
            for(var i=0;i<result.targets.length;i++){
                if(result.targets[i].countCards('h')>result.targets[i].maxHp-result.targets[i].hp){
                if(result.targets[i].isDamaged()){
            var num=result.targets[i].maxHp-result.targets[i].hp;
            }else{
            var num=1;
            }
           }else{
           if(result.targets[i].countCards('h')>0){
            var num=result.targets[i].countCards('h');
           }else{
           var num=1;
           }
           }
            if(result.targets[i].countCards('h')<result.targets[i].maxHp){
                result.targets[i].drawTo(result.targets[i].maxHp+num);
                }else{
                result.targets[i].draw(result.targets[i].countCards('h'));
                result.targets[i].addTempSkill('圣_jieming_mark',{player:"phaseBegin"});  
                }
            }
        }
        "step 3"
        if(event.count) event.goto(1);
    },
                ai:{
                    maixie:true,
                    "maixie_hp":true,
                    effect:{
                        target:function (card,player,target,current){
                if(get.tag(card,'damage')&&target.hp>1){
                    if(player.hasSkillTag('jueqing',false,target)) return [1,-2];
                    var max=0;
                    var players=game.filterPlayer();
                    for(var i=0;i<players.length;i++){
                        if(get.attitude(target,players[i])>0){
                            max=Math.max(Math.min(5,players[i].hp)-players[i].countCards('h'),max);
                        }
                    }
                    switch(max){
                        case 0:return 2;
                        case 1:return 1.5;
                        case 2:return [1,2];
                        default:return [0,max];
                    }
                }
                if((card.name=='tao'||card.name=='caoyao')&&
                    target.hp>1&&target.countCards('h')<=target.hp) return [0,0];
            },
                    },
                },
                subSkill:{
                    mark:{
                    trigger:{
                    player:"loseAfter",
                    },
                    forced:true,
                    direct:true,
                    filter:function (event,player){
                    return player.countCards('h')<player.maxHp;
                    },
                    content:function (){
                    player.removeSkill('圣_jieming_mark');
                    },
                        sub:true,
                    },
                },
            },
            "圣_quhu":{
                audio:"ext:混沌界:2",
                enable:"phaseUse",
                locked:true,
                filter:function (event,player){
        if(player.countCards('h')==0) return false;
        if(player.hasSkill('圣_quhu_mark')) return false;
        return game.hasPlayer(function(current){
            return current.countCards('h');
        });
    },
                filterTarget:function (card,player,target){
        return player.canCompare(target);
    },
                content:function (){
        "step 0"
       if(target.hp<=player.hp){
           player.loseHp();
           player.addTempSkill('圣_quhu_mark');
       }
        "step 1"
        player.chooseToCompare(target);
        "step 2"
        if(result.bool){
            if(game.hasPlayer(function(player){
                return player!=target&&target.inRange(player)&&game.countPlayer()>2;
            })){
                player.chooseTarget("【驱虎】：请选择一名其他角色，令"+get.translation(target)+"对其造成伤害",function(card,player,target){
                    var source=_status.event.source;
                    return target!=source&&target!=player;
                }).set('ai',function(target){
                    return get.damageEffect(target,_status.event.source,player);
                }).set('source',target);
            }
            else{
                player.line(target);
                if(player.hasSkill('圣_quhu_mark')){
                target.damage(2,player);
            }else{
                target.damage(player);
                event.finish();
                }
            }
        }
        else{
            if(player.hasSkill('圣_quhu_mark')&&player.hp==1){
                player.recover();
            }
            target.line(player);
            player.damage(target);
            event.finish();
        }
        "step 3"
        if(result.bool&&result.targets&&result.targets.length){
            target.line(result.targets[0]);
            if(player.hasSkill('圣_quhu_mark')){
            result.targets[0].damage(2,target);
            }else{
            result.targets[0].damage(target);
            }
        }
    },
                ai:{
                    order:0.5,
                    result:{
                        target:function (player,target){
                var att=get.attitude(player,target);
                var oc=(target.countCards('h')==1);
                if(att>0&&oc) return 0;
                var players=game.filterPlayer();
                for(var i=0;i<players.length;i++){
                    if(players[i]!=target&&players[i]!=player&&
                        target.inRange(players[i])){
                        if(get.damageEffect(players[i],target,player)>0){
                            return att>0?att/2:att-(oc?5:0);
                        }
                    }
                }
                return 0;
            },
                        player:function (player,target){
                if(target.hasSkillTag('jueqing',false,target)) return -10;
                var mn=1;
                var hs=player.getCards('h');
                for(var i=0;i<hs.length;i++){
                    mn=Math.max(mn,hs[i].number);
                }
                if(mn<=11&&player.hp<2) return -20;
                var max=player.maxHp-hs.length;
                var players=game.filterPlayer();
                for(var i=0;i<players.length;i++){
                    if(get.attitude(player,players[i])>2){
                        max=Math.max(Math.min(5,players[i].hp)-players[i].countCards('h'),max);
                    }
                }
                switch(max){
                    case 0:return mn==13?0:-20;
                    case 1:return mn>=12?0:-15;
                    case 2:return 0;
                    case 3:return 1;
                    default:return max;
                }
            },
                    },
                    expose:0.2,
                },
                subSkill:{
                    mark:{
                        sub:true,
                    },
                },
            },
            "圣_shenzhi":{
                audio:"ext:混沌界:2",
                trigger:{
                    player:"phaseDrawBegin",
                },
                locked:true,
                check:function (event,player){
        if(player.hp>2) return false;
        var cards=player.getCards('h');
        if(cards.length<player.hp) return false;
        for(var i=0;i<cards.length;i++){
            if(get.value(cards[i])>7||get.tag(cards[i],'recover')>=1) return false;
        }
        return true;
    },
                filter:function (event,player){
        return player.isDamaged();
    },
                content:function (){
        "step 0"
        player.addTempSkill('圣_shenzhi_mark',{player:"phaseBegin"});
        trigger.changeToZero();
        var cards=player.getCards('h');
        event.bool=cards.length>=player.hp;
        player.discard(cards);
        "step 1"
        event.num=1;
        "step 2"
        player.recover();
        player.draw(event.num);
        "step 3"
        if(player.isDamaged()){
            event.num++;
            event.goto(2);
        }else{
            event.num=0;
        }
    },
    subSkill:{
    mark:{
    trigger:{
      player:"turnOverAfter",
         },
                forced:true,
                direct:true,
                filter:function (event,player){
        return !player.isTurnedOver();
        },
                content:function (){
        player.removeSkill('圣_shenzhi_mark');
    },
    },
    },
            },
            "圣_shushen":{
                audio:"ext:混沌界:2",
                trigger:{
                    player:"recoverAfter",
                },
                forced:true,
                direct:true,
                priority:-1,
               filter:function (event,player){
                var num=game.countPlayer(function(current){
						               return current!=player&&
						               current.isDamaged()||current.hasSkill('圣_ruosi_mark');
	              				});
					             return num>0;
                },
                content:function (){
        "step 0"
        player.chooseTarget(get.prompt('圣_shushen'),'<li>令一名已受伤的其他角色恢复'+trigger.num+'点体力值并摸牌<li>令一名曾对你造成过伤害的角色失去'+trigger.num+'点体力并弃牌',function(card,player,target){
            return target!=player&&
            target.isDamaged()||target.hasSkill('圣_ruosi_mark');
        }).set('ai',function(target){
            return get.attitude(_status.event.player,target);
        });
        "step 1"
        if(result.bool){
            event.target=result.targets[0];
            player.logSkill('圣_shushen',event.target);
        }else{event.finish();}
        "step 2"
        if(result.bool){
       if(event.target.hasSkill('圣_ruosi_mark')){
            event.target.loseHp(trigger.num);
            }else{
            event.target.recover(trigger.num);
            }
        }
        "step 3"
        if(result.bool){
        if(event.target.hp<=player.hp&&player.hp>1){
        if(event.target.hasSkill('圣_ruosi_mark')){
          event.target.removeSkill('圣_ruosi_mark');
           player.loseHp();
           if(event.target.countCards('he')){
        event.target.chooseToDiscard('he',event.target.hp+2,true);
        }
        }else{
            player.loseHp();
            event.target.draw(event.target.getDamagedHp()+2);
            }
        }
      }
    },
                ai:{
                    threaten:0.8,
                    expose:0.1,
                },
            },
            "圣_ruosi":{
     trigger:{
        player:"damageEnd",
    },
    forced:true,
    filter:function (event,player){
        return event.source&&
            event.source!=player&&
            event.num>0;
    },
    content:function (){
        "step 0"
        trigger.source.addTempSkill('圣_ruosi_mark',{player:"phaseBegin"});
        "step 1"
        if(player.hasSkill('圣_shenzhi_mark')){
            player.turnOver();
            player.draw();
        }
    },
    subSkill:{
    mark:{
    mark:true,
    marktext:"偌",
    intro:{
    content:"技能〖淑慎〗对该角色所产生的效果改为失去体力值并弃置手牌与装备牌",
    },
    },
    },
            },
            "圣_juxiang":{
                audio:"ext:混沌界:2",
                marktext:"蛮",
                init:function (player){
        player.storage.圣_juxiang=0;
    },
                intro:{
                    content:function (storage){
            if(storage>0) return '你已累计受到了'+storage+'点伤害';
            if(storage<0) return '你已累计受到了'+storage+'点伤害';
               return '本轮内未受伤';
          },
                },
                trigger:{
                    player:"damageEnd",
                },
                forced:true,
                direct:true,
                content:function (){
    player.storage.圣_juxiang+=trigger.num;
    player.markSkill('圣_juxiang');
    player.syncStorage('圣_juxiang');
    },
                group:["圣_juxiang_gain","圣_juxiang_target","圣_juxiang_nanman","圣_juxiang_sha"],
                subSkill:{
                    gain:{
                        trigger:{
                            global:"useCardAfter",
                        },
                        forced:true,
                        direct:true,
                        priority:-1,
                        filter:function (event,player){
            return (event.card.name=='nanman'&&event.player!=player&&
                    get.itemtype(event.cards)=='cards'&&
                    get.position(event.cards[0])=='d');
            },
                        content:function (){
                'step 0'
                player.draw();
                player.logSkill('圣_juxiang');
                'step 1'
                ui.cardPile.insertBefore(trigger.cards.pop(),ui.cardPile.firstChild);
                game.log(trigger.cards,'被置于了牌堆顶');
            },
                        sub:true,
                    },
                    target:{
                        trigger:{
                            target:"useCardToTargeted",
                        },
                        forced:true,
                        priority:100,
                        filter:function (event,player){
                return event.card.name=='nanman';
            },
                        content:function (){
                'step 0'
                player.logSkill('圣_juxiang');
                trigger.getParent().excluded.add(player);
                'step 1'
                player.recover();
            },
                        sub:true,
                    },
                    sha:{
                        trigger:{
                            global:"respondEnd",
                        },
                        forced:true,
                        direct:true,
                        priority:-1,
                        filter:function (event,player){
                return event.card.name=='sha'&&event.player!=player;
            },
                        content:function (){
                player.logSkill('圣_juxiang');
                player.useCard({name:'sha'},trigger.player,false);
            },
                        sub:true,
                        popup:false,
                    },
                    nanman:{
                        trigger:{
                            global:"roundStart",
                        },
                        forced:true,
                        direct:true,
                        priority:100,
                        content:function (){
        'step 0'
        if(player.storage.圣_juxiang>0){
        player.logSkill('圣_juxiang');
        event.target=game.filterPlayer().randomGet(player);
        player.line(event.target);
        }else{event.finish();}
        'step 1'
        player.storage.圣_juxiang--;
        player.markSkill('圣_juxiang');
        player.syncStorage('圣_juxiang');
        event.target.gain(game.createCard('nanman'),'gain2');
        'step 2'
        if(player.storage.圣_juxiang>0){
        event.goto(0);
         }else{
             player.unmarkSkill('圣_juxiang');
             event.finish();
         }
    },
                        sub:true,
                    },
                },
            },
            "圣_lieren":{
                audio:"ext:混沌界:2",
                trigger:{
                    player:"shaBegin",
                },
                locked:true,
                filter:function (event,player){
        return player.canCompare(event.target);
    },
                check:function (event,player){
        return get.attitude(player,event.target)<0;
    },
                priority:5,
                content:function (){
        "step 0"
        player.line(trigger.target);
        player.chooseToCompare(trigger.target);
        "step 1"
        if(result.bool){
            if(trigger.target.countCards('h')>0){
            player.gainPlayerCard(trigger.target,'h',true);
            }else{
            player.draw();
            }
        }else{
            player.damage(trigger.target);
            if(get.position(result.target)=='d') player.gain(result.target,'gain2');
            if(get.position(result.player)=='d') player.gain(result.player,'gain2');
        }
    },
            },
            "圣_yanyi":{
                trigger:{
                    player:"useCardToBefore",
                },
                forced:true,
                priority:100,
                filter:function (event,player){
        return event.target&&event.target!=player&&
            event.target.getEquip(2);
    },
                content:function (){
        'step 0'
        player.line(trigger.target,'fire');
        'step 1'
        trigger.target.damage('fire',player);
        'step 2'
        player.gain(trigger.target,trigger.target.getEquip(2),true,'giveAuto');
    },
            },
            "圣_chuli":{
                audio:"ext:混沌界:2",
                enable:"phaseUse",
                usable:1,
                locked:true,
                filter:function (event,player){
        return player.countCards('h')>0;
    },
                filterTarget:function (card,player,target){
        return target.isDamaged()&&target!=player;
    },
                content:function (){
        'step 0'
        player.showHandcards();
        if(target.countCards('h')){
            target.showHandcards();
        }
        'step 1'
        target.recover(target.maxHp-target.hp);
        'step 2'
        event.num1=player.countCards('h',{color:'red'})+target.countCards('h',{color:'red'});
        event.num2=player.countCards('h',{color:'black'})+target.countCards('h',{color:'black'});
        'step 3'
        if(event.num1<event.num2){
            player.chooseToDiscard('h',Infinity,true);
            target.loseMaxHp();
        }
    },
            },
            "圣_qingnang":{
                audio:"ext:混沌界:2",
                trigger:{
                    global:"dying",
                },
                locked:true,
                filter:function (event,player){
                if(event.player==player) return true;
                if(event.player!=player&&player.countCards('h')>0||event.player.countCards('h')>0) return true;
                return false;
    },
                check:function (event,player){
        return get.attitude(player,event.player)>0;
    },
                content:function (){
        'step 0'
        if(trigger.player!=player){
            player.line(trigger.player);
        if(trigger.player.countCards('h')){
        trigger.player.line(player);
        player.gainPlayerCard('h',trigger.player,Infinity,true);
        }else{
            if(player.countCards('h')){
        player.chooseToDiscard('h',Infinity,true);
            }
        }
     }
        'step 1'
        event.cards=get.cards();
        player.showCards(event.cards);
        'step 2'
        if(get.color(event.cards[0])=='red'){
        if(get.suit(event.cards[0])=='heart'){
            trigger.player.recover(trigger.player.maxHp-trigger.player.hp);
        }else{
            trigger.player.recover(1-trigger.player.hp);
        }
      }
    },
            },
            "圣_renxin":{
                trigger:{
                    global:"recoverEnd",
                },
                forced:true,
                filter:function (event,player){
        return event.player!=player&&
            event.player.hp!=player.hp&&
            event.player.hp>0;
    },
                content:function (){
        if(trigger.player.hp>player.hp){
            player.recover(trigger.player.hp-player.hp)._triggered=null;
        }else{
            player.loseHp(player.hp-trigger.player.hp)._triggered=null;
        }
    },
            },
            "圣_tushe":{
                audio:"ext:混沌界:2",
                trigger:{
                    player:"phaseUseBegin",
                },
                locked:true,
                priority:100,
                check:function (event,player){
      return player.countCards('h')>0;
      },
                filter:function (event,player){
        return player.countCards('h')>0;
    },
                content:function (){
        'step 0'
        player.showHandcards();
        'step 1'
        var num=player.countCards('h');
        event.num=num;
        'step 2'
        var card;
        if(player.countCards('h',{type:"basic"})>player.countCards('h',{type:"trick"})&&player.countCards('h',{type:"basic"})>player.countCards('h',{type:"equip"})&&player.countCards('h',{type:"basic"})>player.countCards('h',{type:"delay"})){
          card=player.getCards('h',{type:'basic'});
          player.addTempSkill('圣_tushe_mark');
          player.addTempSkill('圣_tushe_basic',{player:'phaseBegin'});
           }
        if(player.countCards('h',{type:"trick"})>player.countCards('h',{type:"basic"})&&player.countCards('h',{type:"trick"})>player.countCards('h',{type:"equip"})&&player.countCards('h',{type:"trick"})>player.countCards('h',{type:"delay"})){
          card=player.getCards('h',{type:'trick'});
          player.addTempSkill('圣_tushe_mark');
          player.addTempSkill('圣_tushe_trick',{player:'phaseBegin'});
           }
        if(player.countCards('h',{type:"equip"})>player.countCards('h',{type:"basic"})&&player.countCards('h',{type:"equip"})>player.countCards('h',{type:"trick"})&&player.countCards('h',{type:"equip"})>player.countCards('h',{type:"delay"})){
          card=player.getCards('h',{type:'equip'});
          player.addTempSkill('圣_tushe_mark');
          player.addTempSkill('圣_tushe_equip',{player:'phaseBegin'});
           }
           if(player.countCards('h',{type:"delay"})>player.countCards('h',{type:"basic"})&&player.countCards('h',{type:"delay"})>player.countCards('h',{type:"trick"})&&player.countCards('h',{type:"delay"})>player.countCards('h',{type:"equip"})){
          card=player.getCards('h',{type:'delay'});
          player.addTempSkill('圣_tushe_mark');
          player.addTempSkill('圣_tushe_delay',{player:'phaseBegin'});
           }
        if(player.countCards('h',{type:"basic"})==player.countCards('h',{type:"trick"})||player.countCards('h',{type:"basic"})==player.countCards('h',{type:"equip"})||player.countCards('h',{type:"basic"})==player.countCards('h',{type:"delay"})||player.countCards('h',{type:"trick"})==player.countCards('h',{type:"equip"})||player.countCards('h',{type:"trick"})==player.countCards('h',{type:"delay"})||player.countCards('h',{type:"equip"})==player.countCards('h',{type:"delay"})){
        if(!player.hasSkill('圣_tushe_mark')){
          card=player.getCards('h');
          player.addTempSkill('圣_tushe_draw',{player:'phaseBegin'});
           }
        }
        player.discard(card);
        'step 3'
        if(!player.countCards('h')){
            player.draw(event.num);
        }
    },
                subSkill:{
                    mark:{
                        sub:true,
                    },
                    draw:{
                        trigger:{
                            player:"useCardToPlayered",
                        },
                        forced:true,
                        direct:true,
                        filter:function (event,player){
                    if(event.getParent().triggeredTargets3.length>1) return false;
                    return event.targets.length>0;
                },
                        content:function (){
                        player.logSkill('圣_tushe');
        player.draw(trigger.targets.length);
    },
                        sub:true,
                    },
                    basic:{
                        trigger:{
                            player:"useCardToPlayered",
                        },
                        forced:true,
                        direct:true,
                        filter:function (event,player){
        if(event.getParent().triggeredTargets3.length>1) return false;
                    return event.targets.length>0&&!player.countCards('h',{type:"basic"});
    },
                        content:function (){
                        player.logSkill('圣_tushe');
        player.draw(trigger.targets.length);
    },
                        sub:true,
                    },
                    trick:{
                        trigger:{
                            player:"useCardToPlayered",
                        },
                        forced:true,
                        direct:true,
                        filter:function (event,player){
        if(event.getParent().triggeredTargets3.length>1) return false;
                    return event.targets.length>0&&!player.countCards('h',{type:"trick"});
    },
                        content:function (){
                        player.logSkill('圣_tushe');
        player.draw(trigger.targets.length);
    },
                        sub:true,
                    },
                    delay:{
                        trigger:{
                            player:"useCardToPlayered",
                        },
                        forced:true,
                        direct:true,
                        filter:function (event,player){
        if(event.getParent().triggeredTargets3.length>1) return false;
                    return event.targets.length>0&&!player.countCards('h',{type:"delay"});
    },
                        content:function (){
                        player.logSkill('圣_tushe');
        player.draw(trigger.targets.length);
    },
                        sub:true,
                    },
                    equip:{
                        trigger:{
                            player:"useCardToPlayered",
                        },
                        forced:true,
                        direct:true,
                        filter:function (event,player){
        if(event.getParent().triggeredTargets3.length>1) return false;
                    return event.targets.length>0&&!player.countCards('h',{type:"equip"});
    },
                        content:function (){
                        player.logSkill('圣_tushe');
        player.draw(trigger.targets.length);
    },
                        sub:true,
                    },
                },
            },
            "圣_chuangli":{
                trigger:{
                    player:"drawAfter",
                },
                forced:true,
                filter:function (event,player){
        return player.countCards('h',{suit:"heart",type:"basic"})>0;
    },
                content:function (){
        'step 0'
        player.showHandcards();
        'step 1'
        var num=player.countCards('h',{suit:"heart",type:"basic"});
        var card=player.getCards('h',{suit:"heart",type:"basic"});
        event.num=num;
        player.discard(card);
        'step 2'
        if(player.hasSkill('圣_limu')&&player.storage.圣_limu>0){
            player.storage.圣_limu--;
            player.markSkill('圣_limu');
            player.syncStorage('圣_limu');
            player.draw('bottom',event.num);
        }
        'step 3'
        if(player.storage.圣_limu<=0){
            player.unmarkSkill('圣_limu');
        }
    },
            },
            "圣_limu":{
                mod:{
                    cardUsable:function (card,player,num){
            if(player.storage.圣_limu) return Infinity;
        },
                    targetInRange:function (card,player){
            if(player.storage.圣_limu) return true;
        },
                },
                audio:"ext:混沌界:2",
                marktext:"牧",
                intro:{
                    content:"你当前共持有#枚“牧”印记",
                },
                init:function (player){
        player.storage.圣_limu=0;
    },
                enable:"phaseUse",
                locked:true,
                usable:1,
                filter:function (event,player){
       return player.countCards('h');
    },
                filterCard:true,
                position:"he",
                selectCard:[1,Infinity],
                content:function (){
        'step 0'
        player.recover();
        'step 1'
        event.num=player.hp+cards.length;
        if(!player.countCards('h')){
        player.draw(event.num);
        }
        'step 2'
        player.storage.圣_limu+=event.num;
        player.markSkill('圣_limu');
        player.syncStorage('圣_limu');
        'step 3'
        player.addSkill('圣_limu_End') ; 
    },
                group:"圣_limu_skip",
                subSkill:{
                    End:{
                        trigger:{
                            player:"phaseEnd",
                        },
                        forced:true,
                        direct:true,
                        content:function (){
                'step 0'
                if(player.storage.圣_limu>0){
                player.storage.圣_limu_skip+=player.storage.圣_limu;
                player.markSkill('圣_limu_skip');
                player.syncStorage('圣_limu_skip');
                }else{
                    event.goto(2);
                }
                'step 1'
                player.storage.圣_limu-=player.storage.圣_limu;
                player.markSkill('圣_limu');
                player.syncStorage('圣_limu');
                'step 2'
                if(player.storage.圣_limu<=0){
                  player.unmarkSkill('圣_limu');
                    }
               'step 3'
                player.removeSkill('圣_limu_End');
            },
                        sub:true,
                    },
                    skip:{
                        init:function (player){
        player.storage.圣_limu_skip=0;
    },
                        trigger:{
                            player:"phaseBegin",
                        },
                        forced:true,
                        filter:function (event,player){
                return player.storage.圣_limu_skip>0;
            },
                        content:function (){
            'step 0'
            if(player.storage.圣_limu_skip>=3){
            player.skip('phaseDiscard');
            game.log(player,'跳过了本回合的弃牌阶段');
            }
            if(player.storage.圣_limu_skip>=2){
            player.skip('phaseUse');
            game.log(player,'跳过了本回合的出牌阶段');
            }
            if(player.storage.圣_limu_skip>=1){
            player.skip('phaseDraw');
            game.log(player,'跳过了本回合的摸牌阶段');
            }
            'step 1'
            player.storage.圣_limu_skip-=player.storage.圣_limu_skip;
            player.markSkill('圣_limu_skip');
            player.syncStorage('圣_limu_skip');
            },
                        sub:true,
                    },
                },
            },
            "圣_liangyin":{
                audio:"ext:混沌界:2",
                forced:true,
                locked:true,
                group:["圣_liangyin_to","圣_liangyin_from"],
                subSkill:{
                    to:{
                        trigger:{
                            global:["loseEnd","addCardToStorageEnd"],
                        },
                        filter:function (event,player){
                if(event.name=='lose') return event.toStorage==true;
                return true;
            },
                        forced:true,
                        direct:true,
                        content:function (){
                "step 0"
                if(trigger.player==player){
                    player.draw(trigger.cards.length);
                    player.logSkill('圣_liangyin');
                }
                "step 1"
                if(trigger.player!=player){
                player.choosePlayerCard('【良姻】：是否获得'+get.translation(trigger.player)+'至多'+get.translation(trigger.cards.length)+'张牌？',trigger.player,'he',[1,trigger.cards.length]);
                }
               "step 2"
               if(result.bool){
                   player.logSkill('圣_liangyin');
                   trigger.player.$give(result.links.length,player);
                   player.gain(result.links);
               }
            },
                        sub:true,
                    },
                    from:{
                    audio:"ext:混沌界:2",
                        trigger:{
                            global:"gainEnd",
                        },
                        filter:function (event,player){
                return event.fromStorage==true&&
                    event.player!=player&&
                    player.countCards('he')>=event.cards.length;
            },
                        forced:true,
                        direct:true,
                        content:function (){
                "step 0"
                player.chooseToDiscard('【良姻】：是否弃置'+get.translation(trigger.cards.length)+'张牌对'+get.translation(trigger.player)+'造成'+get.translation(trigger.cards.length)+'点伤害？','he',trigger.cards.length)
                "step 1"
                if(result.bool){
                    player.logSkill('圣_liangyin_from');
                    player.line(trigger.player);
                    trigger.player.damage(trigger.cards.length,player);
                }else{
                    event.finish();
                };
            },
                        sub:true,
                    },
                },
            },
            "圣_kongsheng":{
                audio:"ext:混沌界:2",
                trigger:{
                    player:"phaseBegin",
                },
                forced:true,
                direct:true,
                priority:-1,
                filter:function (event,player){
        return player.countCards('h')>0;
    },
                content:function (){
        "step 0"
        player.chooseTarget(get.prompt('圣_kongsheng'),'将所有手牌置于一名角色的武将牌旁称为“箜”',function(card,player,target){
            return target;
        })
        "step 1"
        if(result.bool){
            var cards=player.getCards('h');
            player.logSkill('圣_kongsheng',result.targets[0]);
            if(!result.targets[0].hasSkill('圣_kongsheng_mark')){
            result.targets[0].addSkill('圣_kongsheng_mark');}
            player.lose(cards,ui.special,'toStorage');
            player.$give(cards.length,result.targets[0]);
            result.targets[0].storage.圣_kongsheng_mark=result.targets[0].storage.圣_kongsheng_mark.concat(cards);
            result.targets[0].syncStorage('圣_kongsheng_mark');
            result.targets[0].markSkill('圣_kongsheng_mark');
            if(result.targets[0]!=player){
            game.log(player,'将所有手牌置于',result.targets[0],'的武将牌上称为','#y“箜”');
            }else{
            game.log(player,'将所有手牌置于武将牌上称为','#y“箜”');
            }
        }
    },
                group:"圣_kongsheng_End",
                subSkill:{
                    End:{
                        trigger:{
                            global:"phaseEnd",
                        },
                        forced:true,
                        direct:true,
                        content:function (){
                'step 0'
                event.targets=game.filterPlayer();
                event.targets.sort(lib.sort.seat);
                'step 1'
                if(event.targets.length){
            var target=event.targets.shift();
            if(target.hasSkill('圣_kongsheng_mark')){
                    player.logSkill('圣_kongsheng');
                    if(target!=player){player.line(target);}
                    target.gain(target.storage.圣_kongsheng_mark,'fromStorage',target,'giveAuto');
                    game.addVideo('storage',player,['圣_kongsheng_End',get.cardsInfo(target.storage.圣_kongsheng_mark),'cards']);
                    target.storage.圣_kongsheng_mark=[];
                game.log(target,'获得了武将牌旁的所有','#y“箜”');
                target.removeSkill('圣_kongsheng_mark');
                    }
            event.redo();
        }
            },
                        sub:true,
                    },
                    mark:{
                        mark:true,
                        marktext:"箜",
                        intro:{
                            content:"cards",
                        },
                        init:function (player){
        player.storage.圣_kongsheng_mark=[];
    },
                        sub:true,
                    },
                },
            },
            "圣_housan":{
                trigger:{
                    global:"damageEnd",
                },
                forced:true,
                filter:function (event,player){
        return event.source&&
            event.source!=player&&
            event.source.countCards('h')>0&&
            player.hasSkill('圣_kongsheng')&&
            event.num>0&&_status.currentPhase==event.source;
    },
                content:function (){
        var cards=trigger.source.getCards('h');
            trigger.source.addSkill('圣_kongsheng_mark');
            trigger.source.lose(cards,ui.special,'toStorage');
            trigger.source.$give(cards.length,trigger.source);
            trigger.source.storage.圣_kongsheng_mark=trigger.source.storage.圣_kongsheng_mark.concat(cards);
            trigger.source.syncStorage('圣_kongsheng_mark');
            trigger.source.markSkill('圣_kongsheng_mark');
            game.log(trigger.source,'将所有手牌置于武将牌上称为','#y“箜”');
    },
            },
            "圣_rende":{
            locked:true,
            forced:true,
                group:["圣_rende_give","圣_rende_gain"],
                subSkill:{
                    mark:{
                        sub:true,
                    },
                    marktrue:{
                        sub:true,
                    },
                    markfalse:{
                        sub:true,
                    },
                    give:{
                        audio:"ext:混沌界:2",
                        enable:"phaseUse",
                        filterCard:true,
                        locked:true,
                        prompt:"将手牌交给一名其他角色",
                        selectCard:function (){
                        var player=_status.event.player
                        if(player.isDamaged()){
        var num=player.getDamagedHp();
        }else{
        var num=player.hp;
        }
        return [1,Math.max(1,num)];
    },
                        discard:false,
                        lose:false,
                        delay:0,
                        filter:function (event,player){
        return player.countCards('h')>player.hp;
    },
                        filterTarget:function (card,player,target){
        return player!=target;
    },
                        content:function (){
        target.gain(cards,player,'giveAuto');
        target.addSkill('圣_rende_marktrue');
        target.addTempSkill('圣_rende_mark');
        player.recover();
    },
    ai:{
    result:{
    target:function (player,target){
    if(player.countCards('h')>player.hp) return 1;
    }
  }
    },
                        sub:true,
                    },
                    gain:{
                        audio:"ext:混沌界:2",
                        enable:"phaseUse",
                        delay:0,
                        locked:true,
                        prompt:"获得一名已成为此技能目标的角色的牌",
                        filter:function (event,player){
                var num=game.countPlayer(function(current){
            return current!=player&&current.hasSkill('圣_rende_mark');
        });
        return num>0&&player.countCards('h')<player.hp;
    },
                        filterTarget:function (card,player,target){
        return player!=target&&!target.hasSkill('圣_rende_markfalse')&&
            target.hasSkill('圣_rende_mark')&&target.countCards('he')>0;
    },
                        content:function (){
                        if(player.isDamaged()){
        var num=player.getDamagedHp();
        }else{
        var num=player.hp;
        }
        player.gainPlayerCard(target,'he',[1,num],true);
        if(target.countCards('h')<player.countCards('h')){
        target.recover();
        target.addTempSkill('圣_rende_markfalse');
        }else{
            player.loseHp();
          }
    },
                        sub:true,
                    },
                },
            },
            "圣_zongzha":{
                trigger:{
                    global:"gainAfter",
                },
                forced:true,
                filter:function (event,player){
        return _status.currentPhase!=event.player&&
            event.player!=player&&
            !event.player.hasSkill('圣_zongzha_mark');
    },
                content:function (){
        trigger.player.addSkill('圣_zongzha_mark');
    },
                subSkill:{
                    mark:{
                        mark:true,
                        marktext:"宗",
                        intro:{
                            content:"当此印记被移除时，该角色将一张随机武器牌置入装备栏并弃置所有手牌，然后获得一张【杀】",
                        },
                        onremove:function (player){
                'step 0'
               var equip=get.cardPile2(function(card){
            return get.subtype(card)=='equip1';
        });
                player.chooseUseTarget(equip,'noanimate','nopopup',true);
                'step 1'
                player.chooseToDiscard('h',Infinity,true);
                'step 2'
                player.gain(game.createCard('sha'),'gain2');
            },
                        trigger:{
                            player:"phaseEnd",
                        },
                        priority:-100,
                        forced:true,
                        direct:true,
                        content:function (){
                player.removeSkill('圣_zongzha_mark');
            },
                        ai:{
                        nokeep:true,
                        },
                        sub:true,
                    },
                },
            },
            "圣_shimie":{
                skillAnimation:true,
                animationColor:"fire",
                audio:"ext:混沌界:2",
                derivation:["圣_longnu","圣_jieying"],
                unique:true,
                trigger:{
                    global:"dieAfter",
                },
                forced:true,
                priority:-1,
                filter:function (event,player){
        return event.player.hasSkill('圣_rende_marktrue')&&
            event.source&&event.source!=player&&event.source.isAlive();    
    },
                content:function (){
        'step 0'
        if(trigger.source.hasSkill('圣_zongzha_mark')){
            trigger.source.removeSkill('圣_zongzha_mark');
        }
        'step 1'
        player.line(trigger.source,'fire');
        'step 2'
        trigger.source.damage(player);
        'step 3'
        if(player.isDamaged()){
        player.gainMaxHp(player.getDamagedHp());
        }
        'step 4'
        if(player.hp<3){
            player.recover(3-player.hp);
        }
        'step 5'
        player.removeSkill('圣_rende');
        player.removeSkill('圣_zongzha');
        player.addSkill('圣_longnu');
        player.addSkill('圣_jieying');
        player.awakenSkill('圣_shimie');
    },
            },
            "圣_longnu":{
                init:function (player){
        player.storage.圣_longnu=false;
    },
                onremove:function (player){
        player.storage.圣_longnu=false;
    },
                audio:"ext:混沌界:2",
                trigger:{
                    player:"phaseUseBegin",
                },
                forced:true,
                priority:1,
                content:function (){
        'step 0'
        if(player.storage.圣_longnu==false){
            player.gainMaxHp();
            player.loseHp();
        }else{
            player.loseMaxHp();
            player.recover();
        }
        'step 1'
        if(player.storage.圣_longnu==false){
            player.draw(player.getDamagedHp());
            player.addTempSkill('圣_longnu_fire',{player:'phaseAfter'});
            player.storage.圣_longnu=true;
        }else{
            player.draw(player.hp);
            player.addTempSkill('圣_longnu_thunder',{player:'phaseAfter'});
            player.storage.圣_longnu=false; 
        }
    },
                subSkill:{
                    fire:{
                        mark:true,
                        marktext:"龙",
                        intro:{
                            content:"你于本回合的的红色手牌均视为【火杀】且使用【杀】时无距离限制",
                        },
                        mod:{
                            cardname:function (card,player){
                    if(get.color(card)=='red') return 'sha';
                },
                            cardnature:function (card,player){
                    if(get.color(card)=='red') return 'fire';
                },
                            attackFrom:function (from,to,distance){
                 return distance-Infinity;
        },
                        },
                        ai:{
                            effect:{
                                target:function (card,player,target,current){
                        if(get.tag(card,'respondSha')&&current<0) return 0.6
                    },
                            },
                            respondSha:true,
                        },
                        sub:true,
                    },
                    thunder:{
                        mark:true,
                        marktext:"龙",
                        intro:{
                            content:"你于本回合的的黑色手牌均视为【雷杀】且使用【杀】时无次数限制",
                        },
                        mod:{
                            cardname:function (card,player){
                    if(get.color(card)=='black') return 'sha';
                },
                            cardnature:function (card,player){
                    if(get.color(card)=='black') return 'thunder';
                },
                            cardUsable:function (card,player){
                    if(card.name=='sha') return Infinity;
                },
                        },
                        ai:{
                            effect:{
                                target:function (card,player,target,current){
                        if(get.tag(card,'respondSha')&&current<0) return 0.6
                    },
                            },
                            respondSha:true,
                        },
                        sub:true,
                    },
                },
                ai:{
                    fireAttack:true,
                    halfneg:true,
                    threaten:1.05,
                },
            },
            "圣_jieying":{
                locked:true,
                forced:true,
                init:function (player){
                  player.link(true);
    },
                global:"圣_jieying_max",
                ai:{
                    effect:{
                        target:function (card){
                if(card.name=='tiesuo') return 'zeroplayertarget';
            },
                    },
                },
                group:["圣_jieying_link","圣_jieying_debuff"],
                subSkill:{
                    max:{
                        mod:{
                            maxHandcard:function (player,num){
                   if(game.countPlayer(function(current){return current.hasSkill('圣_jieying')})>0&&player.isLinked()) return num*2;
               },
                        },
                        sub:true,
                    },
                    link:{
                        trigger:{
                            player:["linkBefore","enterGame"],
                            global:"gameDrawAfter",
                        },
                        forced:true,
                        filter:function (event,player){
                return player.isLinked()==(event.name=='link');
            },
                        content:function (){
                if(trigger.name!='link'){
                    player.link(true);
                }else{trigger.cancel();}
            },
                        sub:true,
                    },
                    debuff:{
                        audio:"ext:混沌界:2",
                        trigger:{
                            player:"damageBegin",
                        },
                        forced:true,
                        direct:true,
                        filter:function (event,player){
                return event.nature=='fire'||event.nature=='thunder';
            },
                        content:function (){
                "step 0"
                event.target=game.filterPlayer().randomGet(player);
                player.line(event.target);
                "step 1"
                event.target.link(true);
                "step 2"
              event.targets=game.filterPlayer();
             event.targets.sort(lib.sort.seat);
                "step 3"
                if(event.targets.length){
            var target=event.targets.shift();
            if(target.isLinked()){
                game.delay(0.5);
                if(trigger.nature=='fire'){
                    target.gainMaxHp();
                    target.loseHp();
                }
                if(trigger.nature=='thunder'){
                    target.loseMaxHp();
                    target.recover();
                }
                }
            event.redo();
        }
            },
                        sub:true,
                    },
                },
            },
      "圣_fazhuan":{
                mark:true,
                marktext:"篆",
                intro:{
                    content:function (event,player){
            return '你所持有的印记数量如下：</br>♠️【紫微】：'+player.storage.圣_fazhuan_spade+'枚</br>♣️【后土】：'+player.storage.圣_fazhuan_club+'枚</br>♥️【玉清】：'+player.storage.圣_fazhuan_heart+'枚</br>♦️【勾陈】：'+player.storage.圣_fazhuan_diamond+'枚';
        },
                },
                init:function (player){
        player.storage.圣_fazhuan_heart=0;
        player.storage.圣_fazhuan_diamond=0;
        player.storage.圣_fazhuan_spade=0;
        player.storage.圣_fazhuan_club=0;
    },
                audio:"ext:混沌界:2",
                trigger:{
                    global:"gameStart",
                },
                forced:true,
                content:function (){
        player.storage.圣_fazhuan_heart++;
        player.markSkill('圣_fazhuan_heart');
        player.syncStorage('圣_fazhuan_heart');
        player.storage.圣_fazhuan_diamond++;
        player.markSkill('圣_fazhuan_diamond');
        player.syncStorage('圣_fazhuan_diamond');
        player.storage.圣_fazhuan_spade++;
        player.markSkill('圣_fazhuan_spade');
        player.syncStorage('圣_fazhuan_spade');
        player.storage.圣_fazhuan_club++;
        player.markSkill('圣_fazhuan_club');
        player.syncStorage('圣_fazhuan_club');
    },
                group:["圣_fazhuan_discard","圣_fazhuan_lose"],
                subSkill:{
                    discard:{
                    trigger:{
                            player:"discardEnd",
                        },
                        forced:true,
                        direct:true,
                        filter:function (event,player){
                         return _status.currentPhase==player;
            },
                        content:function (){
                'step 0'
                player.logSkill('圣_fazhuan');
                'step 1'
               for(var i=0;i<trigger.cards.length;i++){
               if(get.suit(trigger.cards[i])=='heart'){
                player.storage.圣_fazhuan_heart++;
                player.markSkill('圣_fazhuan_heart');
                player.syncStorage('圣_fazhuan_heart');
            }
            if(get.suit(trigger.cards[i])=='diamond'){
                player.storage.圣_fazhuan_diamond++;
                player.markSkill('圣_fazhuan_diamond');
                player.syncStorage('圣_fazhuan_diamond');
            }
             if(get.suit(trigger.cards[i])=='spade'){
                player.storage.圣_fazhuan_spade++;
                player.markSkill('圣_fazhuan_spade');
                player.syncStorage('圣_fazhuan_spade');
            }
             if(get.suit(trigger.cards[i])=='club'){
                player.storage.圣_fazhuan_club++;
                player.markSkill('圣_fazhuan_club');
                player.syncStorage('圣_fazhuan_club');
            }
                  }
                'step 2'
             if(i<trigger.cards.length){
                 event.goto(1);
             }
            },
                    sub:true,
                    },
                    lose:{
                        trigger:{
                            player:"loseEnd",
                        },
                        forced:true,
                        direct:true,
                        filter:function (event,player){
                         return _status.currentPhase!=player;
            },
                        content:function (){
                'step 0'
                player.logSkill('圣_fazhuan');
                'step 1'
               for(var i=0;i<trigger.cards.length;i++){
               if(get.suit(trigger.cards[i])=='heart'){
                player.storage.圣_fazhuan_heart++;
                player.markSkill('圣_fazhuan_heart');
                player.syncStorage('圣_fazhuan_heart');
            }
            if(get.suit(trigger.cards[i])=='diamond'){
                player.storage.圣_fazhuan_diamond++;
                player.markSkill('圣_fazhuan_diamond');
                player.syncStorage('圣_fazhuan_diamond');
            }
             if(get.suit(trigger.cards[i])=='spade'){
                player.storage.圣_fazhuan_spade++;
                player.markSkill('圣_fazhuan_spade');
                player.syncStorage('圣_fazhuan_spade');
            }
             if(get.suit(trigger.cards[i])=='club'){
                player.storage.圣_fazhuan_club++;
                player.markSkill('圣_fazhuan_club');
                player.syncStorage('圣_fazhuan_club');
            }
                  }
                'step 2'
             if(i<trigger.cards.length){
                 event.goto(1);
             }
            },
                        sub:true,
                    },
                },
            },
            "圣_dianhua":{
                trigger:{
                    player:["phaseBegin","phaseEnd"],
                },
                forced:true,
                content:function (){
        'step 0'
        player.skip('phaseDraw');
        'step 1'
        player.judge();
        'step 2'
        var cardl=get.cardPile2(function(card){
                return get.suit(card)==get.suit(result.card);
            });
            if(cardl){
                player.gain(cardl,'gain2');
            }
        ui.cardPile.insertBefore(result.card,ui.cardPile.firstChild);
      },
            },
            "圣_yifu":{
                audio:"ext:混沌界:2",
                enable:"phaseUse",
                locked:true,
                usable:1,
                derivation:["圣_yifu_spadebuff","圣_yifu_clubbuff","圣_yifu_heartbuff","圣_yifu_diamondbuff"],
                content:function (){
        "step 0"
        player.judge();
        "step 1"
        var num=0
        if(get.suit(result.card)=='spade'&&player.hasMark('圣_fazhuan_spade')){
            player.storage.圣_fazhuan_spade--;
            player.markSkill('圣_fazhuan_spade');
            player.syncStorage('圣_fazhuan_spade');
            num+=1;
            event.num=num;
            event.goto(3);
        }
        if(get.suit(result.card)=='club'&&player.hasMark('圣_fazhuan_club')){
            player.storage.圣_fazhuan_club--;
           player.markSkill('圣_fazhuan_club');
           player.syncStorage('圣_fazhuan_club');
            num+=2;
            event.num=num;
            event.goto(3);
        }
        if(get.suit(result.card)=='heart'&&player.hasMark('圣_fazhuan_heart')){
            player.storage.圣_fazhuan_heart--;
            player.markSkill('圣_fazhuan_heart');
            player.syncStorage('圣_fazhuan_heart');
            num+=3;
            event.num=num;
            event.goto(3);
        }
        if(get.suit(result.card)=='diamond'&&player.hasMark('圣_fazhuan_diamond')){
            player.storage.圣_fazhuan_diamond--;
            player.markSkill('圣_fazhuan_diamond');
            player.syncStorage('圣_fazhuan_diamond');
            num+=4;
            event.num=num;
            event.goto(3);
        }
        "step 2"
        game.log('#g【仪符】','：判定失败，你当前未持有与判定花色相同的“法篆”印记');
        event.finish();
        "step 3"
        player.chooseTarget('请将“'+get.translation(get.suit(result.card))+'符咒”置于一名其他角色的武将牌旁','<li>♠️紫微：令目标受到一点无伤害来源的火属性伤害<li>♣️后土：令目标失去一点体力并于失去此符咒时恢复一点体力<li>♥️玉清：令目标跳过下回合的摸牌阶段<li>♦勾陈️：令目标随机使用一张装备牌',true,function(card,player,target){
            return player!=target
        })
        "step 4"
        if(result.bool){
            player.line(result.targets[0]);
            if(event.num==1){
            result.targets[0].addSkill('圣_yifu_spadeskill');
            player.addTempSkill('圣_yifu_spadebuff',{player:"phaseBegin"});
               }
            if(event.num==2){
            result.targets[0].addSkill('圣_yifu_clubskill');
            player.addTempSkill('圣_yifu_clubbuff',{player:"phaseBegin"});
               }
            if(event.num==3){
            result.targets[0].addSkill('圣_yifu_heartskill');
            player.addTempSkill('圣_yifu_heartbuff',{player:"phaseBegin"});
               }
            if(event.num==4){
            result.targets[0].addSkill('圣_yifu_diamondskill');
            player.addTempSkill('圣_yifu_diamondbuff',{player:"phaseBegin"});
               }
        }
    },
                subSkill:{
                    spadeskill:{
                        mark:true,
                        marktext:"♠️",
                        intro:{
                            content:"紫微符咒：<li>当一名角色获得此符咒时，其受到一点无来源的火属性伤害<li>锁定技，每当一张判定牌即将生效时，你可以移除1枚【紫微】，然后将判定结果改为任意花色",
                        },
                        init:function (player){
        return player.damage('fire','nosource',true);
    },
                        trigger:{
                            global:"phaseBegin",
                        },
                        forced:true,
                        direct:true,
                        priority:1,
                        filter:function (event,player){
                return event.player.hasSkill('圣_yifu');
            },
                        content:function (){
                player.removeSkill('圣_yifu_spadeskill');
            },
                        sub:true,
                    },
                    clubskill:{
                        mark:true,
                        marktext:"♣️",
                        intro:{
                            content:"后土符咒：<li>当一名角色获得此符咒后，其失去一点体力。当该角色失去此符咒时，其恢复一点体力<li>每当一名角色进入濒死状态时，你可以移除1枚【后土】，然后令其恢复一点体力",
                        },
                        init:function (player){
        return player.loseHp();
    },
                        onremove:function (player){
        return player.recover();
    },
                        trigger:{
                            global:"phaseBegin",
                        },
                        forced:true,
                        direct:true,
                        priority:1,
                        filter:function (event,player){
                return event.player.hasSkill('圣_yifu');
            },
                        content:function (){
                player.removeSkill('圣_yifu_clubskill');
            },
                        sub:true,
                    },
                    heartskill:{
                        mark:true,
                        marktext:"♥️",
                        intro:{
                            content:"玉清符咒：<li>当一名角色获得此符咒后，其跳过下回合的摸牌阶段<li>每当你即将造成伤害时，你可以移除1枚【玉清】并进行一次判定：若判定结果为黑色，则此次造成的伤害+1。若判定结果为红色，则你恢复一点体力",
                        },
                        init:function (player){
        return player.skip('phaseDraw');
    },
                        trigger:{
                            global:"phaseBegin",
                        },
                        forced:true,
                        direct:true,
                        priority:1,
                        filter:function (event,player){
                return event.player.hasSkill('圣_yifu');
            },
                        content:function (){
                player.removeSkill('圣_yifu_heartskill');
            },
                        sub:true,
                    },
                    diamondskill:{
                        mark:true,
                        marktext:"♦️",
                        intro:{
                            content:"勾陈符咒：<li>当一名角色获得此符咒时，其随机使用一张装备牌<li>每当你受到伤害后，你可以移除1枚【勾陈】，然后从牌堆中依次随机获得基本/锦囊/装备/延时四种不同类型的牌各一张",
                        },
                        init:function (player){
          var equip=get.cardPile(function(card){
             return get.type(card)=='equip';
         });
            player.chooseUseTarget(equip,'noanimate','nopopup',true);
      },
                        trigger:{
                            global:"phaseBegin",
                        },
                        forced:true,
                        direct:true,
                        priority:1,
                        filter:function (event,player){
                return event.player.hasSkill('圣_yifu');
            },
                        content:function (){
                player.removeSkill('圣_yifu_diamondskill');
            },
                        sub:true,
                    },
                },
            },
            "圣_yifu_diamondbuff":{
                audio:"ext:混沌界:2",
                trigger:{
                    player:"damageEnd",
                },
                locked:true,
                nobracket:true,
                filter:function (event,player){
        return player.storage.圣_fazhuan_diamond>0;
    },
                content:function (){
        "step 0"
        player.storage.圣_fazhuan_diamond--;
        player.markSkill('圣_fazhuan_diamond');
        player.syncStorage('圣_fazhuan_diamond');
        "step 1"
        player.gain(get.cardPile(function(card){
            return get.type(card)=='basic';
        }),'gain2');
        player.gain(get.cardPile(function(card){
            return get.type(card)=='trick';
        }),'gain2');
        player.gain(get.cardPile(function(card){
            return get.type(card)=='equip';
        }),'gain2');
        player.gain(get.cardPile(function(card){
            return get.type(card)=='delay';
        }),'gain2');
    },
            },
            "圣_yifu_spadebuff":{
                audio:"ext:混沌界:2",
                trigger:{
                    global:"judge",
                },
                forced:true,
                direct:true,
                nobracket:true,
                filter:function (event,player){
        return player.hasMark('圣_fazhuan_spade');
    },
                content:function (){
        "step 0"
        var str=get.translation(trigger.player)+'的'+(trigger.judgestr||'')+'判定为'+
        get.translation(trigger.player.judging[0])+'，是否发动【仪符】，移除一枚【紫微】并修改判定结果？';
        player.chooseControl('spade','heart','diamond','club','cancel2').set('prompt',str).set('ai',function(){
            var judging=_status.event.judging;
            var trigger=_status.event.getTrigger();
            var res1=trigger.judge(judging);
            var list=lib.suit.slice(0);
            var attitude=get.attitude(player,trigger.player);
            if(attitude==0) return 0;
            var getj=function(suit){
                return trigger.judge({
                    name:get.name(judging),
                    nature:get.nature(judging),
                    suit:suit,
                    number:5,
                })
            };
            list.sort(function(a,b){
                return (getj(b)-getj(a))*get.sgn(attitude);
            });
            if((getj(list[0])-res1)*attitude>0) return list[0];
            return 'cancel2';
        }).set('judging',trigger.player.judging[0]);
        "step 1"
        if(result.control!='cancel2'){
            player.addExpose(0.25);
            player.storage.圣_fazhuan_spade--;
            player.markSkill('圣_fazhuan_spade');
            player.syncStorage('圣_fazhuan_spade');
            player.logSkill('圣_yifu_spadebuff',trigger.player);
            player.popup(result.control);
            game.log(player,'将判定结果改为了','#y'+get.translation(result.control+2)+5);
            trigger.fixedResult={
                suit:result.control,
                color:get.color({suit:result.control}),
                number:5,
            };
        }
    },
                ai:{
                    rejudge:true,
                    tag:{
                        rejudge:1,
                    },
                    expose:0.5,
                },
            },
            "圣_yifu_clubbuff":{
            audio:"ext:混沌界:2",
                trigger:{
                    global:"dying",
                },
                locked:true,
                nobracket:true,
                check:function (event,player){
        return get.attitude(player,event.target)>0;
    },
                filter:function (event,player){
        return player.hasMark('圣_fazhuan_club');
    },
                content:function (){
        'step 0'
        player.storage.圣_fazhuan_club--;
        player.markSkill('圣_fazhuan_club');
        player.syncStorage('圣_fazhuan_club');
        'step 1'
        trigger.player.recover();
    },
            },
            "圣_yifu_heartbuff":{
            audio:"ext:混沌界:2",
                trigger:{
                    source:"damageBegin",
                },
                filter:function (event,player){
        return player.hasMark('圣_fazhuan_heart');
    },
                locked:true,
                nobracket:true,
                check:function (event,player){
        if(get.attitude(player,event.player)>=0) return false;
        if(event.player.hasSkillTag('filterDamage',null,{
            player:player,
            card:event.card,
        })) return false;
        return true;
    },
                logTarget:"player",
                content:function (){
        'step 0'
        player.storage.圣_fazhuan_heart--;
        player.markSkill('圣_fazhuan_heart');
        player.syncStorage('圣_fazhuan_heart');
        'step 1'
        player.judge();
        'step 2'
        if(result.color=='red'){
            player.recover();
        }else{
        trigger.num++;
        }
    },
            },
            "圣_ciwei":{
                trigger:{
                    global:"useCard",
                },
                forced:true,
                filter:function (event,player){
        return event.player.hasSkill('圣_ciwei_mark')&&  
            get.type(event.card)=='trick';
    },
                content:function (){
        trigger.targets.length=0;
    },
                group:"圣_ciwei_add",
                subSkill:{
                    add:{
                        trigger:{
                            global:"useCard",
                        },
                        forced:true,
                        direct:true,
                        priority:-1,
                        filter:function (event,player){
                return event.player!=player&&
                    _status.currentPhase==event.player&&
                    !event.player.hasSkill('圣_ciwei_mark');
            },
                        content:function (){
                trigger.player.addTempSkill('圣_ciwei_mark');
            },
                        sub:true,
                    },
                    mark:{
                        sub:true,
                    },
                },
            },
            "圣_caiyuan":{
            audio:"ext:混沌界:2",
                trigger:{
                    player:"phaseEnd",
                },
                forced:true,
                direct:true,
                content:function (){
        'step 0'
        if(player.hasSkill('圣_caiyuan_mark')){
            player.logSkill('圣_caiyuan');
            player.removeSkill('圣_caiyuan_mark');
            if(player.isDamaged){
                player.recover();
            }
            event.finish();
        }else{
           player.chooseTarget(get.prompt('圣_caiyuan'),'令一名角色将手牌数补/弃置至与其体力值上限相同',function(card,player,target){
            return target.countCards('h')!=target.maxHp;
        }).set('ai',function(target){
            var att=get.attitude(_status.event.player,target);
            var num=target.countCards('h');
            if(num>target.maxHp) return -att*(num-target.maxHp);
            return att*Math.max(0,target.maxHp-target.countCards('h'));
        }); 
        }
        'step 1'
        if(result.bool){
            player.logSkill('圣_caiyuan',result.targets[0]);
            player.line(result.targets[0],'green');
            if(result.targets[0].countCards('h')<result.targets[0].maxHp){
                result.targets[0].drawTo(result.targets[0].maxHp);
            }else{
            result.targets[0].chooseToDiscard('h',true,result.targets[0].countCards('h')-result.targets[0].maxHp);
          }
        }
    },
                group:"圣_caiyuan_add",
                subSkill:{
                    add:{
                        trigger:{
                            player:["damageEnd","loseHpEnd"],
                        },
                        forced:true,
                        direct:true,
                        priority:-1,
                        filter:function (event,player){
                return !player.hasSkill('圣_caiyuan_mark');
            },
                        content:function (){
                player.addSkill('圣_caiyuan_mark');
            },
                        sub:true,
                    },
                    mark:{
                        mark:true,
                        marktext:"媛",
                        intro:{
                            content:"你已获得“才媛”印记",
                        },
                        sub:true,
                    },
                },
            },
            "圣_hongyi":{
                audio:"ext:混沌界:2",
                enable:"phaseUse",
                usable:1,
                locked:true,
                filter:function (event,player){
    return player.countCards('he')>=game.dead.length;
    },
                selectCard:function (){
        if(game.dead.length>1){
            var num=game.dead.length;
        }else{
            var num=1;
        }
    return num;
    },
                filterCard:true,
                selectTarget:function (){
        if(game.dead.length>1){
            var num=game.dead.length;
        }else{
            var num=1;
        }
        return [1,num];
    },
                filterTarget:function (card,player,target){
        return player!=target;
    },
                check:function (card){
        var num=game.dead.length;
        if(!num) return 1;
        if(num==1) return 7-get.value(card);
        return 5-get.value(card);
    },
                position:"he",
                content:function (){
        target.addSkill('圣_hongyi_mark');
    },
                ai:{
                    order:1,
                    result:{
                        target:function (player,target){
                if(target.hasJudge('lebu')) return -0.5;
                return -1-target.countCards('h');
            },
                    },
                },
                group:["圣_hongyi_buff","圣_hongyi_zero"],
                subSkill:{
                    mark:{
                        mark:true,
                        marktext:"仪",
                        intro:{
                            content:"每当该角色即将造成伤害时进行一次判定：若判定结果为黑色，则防止此伤害；若判定结果为红色，则受伤角色获得该角色一张牌",
                        },
                        sub:true,
                    },
                    zero:{
                        trigger:{
                            player:"phaseBegin",
                        },
                        forced:true,
                        direct:true,
                        content:function (){
                "step 0"
                event.targets=game.filterPlayer();
                event.targets.sort(lib.sort.seat);
                "step 1"
                if(event.targets.length){
            var target=event.targets.shift();
            if(target.hasSkill('圣_hongyi_mark')){
                target.removeSkill('圣_hongyi_mark');
            }
                    event.redo();
                }
            },
                        sub:true,
                    },
                    buff:{
                    audio:"ext:混沌界:2",
                        trigger:{
                            global:"damageBegin",
                        },
                        charlotte:true,
                        forced:true,
                        logTarget:"source",
                        filter:function (event,player){
                return event.source&&event.source.hasSkill('圣_hongyi_mark');
            },
                        content:function (){
                'step 0'
                trigger.source.judge();
                'step 1'
                if(result.color=='black'){
                    trigger.num=0;
                }else{
                    if(trigger.source.countCards('he')){
                    trigger.player.gainPlayerCard('he',trigger.source,true);
                    }
                }
                'step 3'
                if(player.hasSkill('圣_caiyuan_mark')){
                        player.removeSkill('圣_caiyuan_mark');
                        player.gainMaxHp();
                    }
            },
                        onremove:true,
                        sub:true,
                    },
                },
            },
            "圣_qiaoshi":{
                audio:"ext:混沌界:2",
                trigger:{
                    global:"phaseEnd",
                },
                forced:true,
                filter:function (event,player){
        return event.player!=player;
    },
                content:function (){
        'step 0'
        if(trigger.player.countCards('h')>player.countCards('h')){
            player.drawTo(trigger.player.countCards('h'));
            event.finish();
            event.finish();
        }
        'step 1'
        if(trigger.player.countCards('h')==player.countCards('h')){
           trigger.player.chooseToDiscard('he',true);
             player.draw();
            event.finish(); 
        }
        'step 2'
        if(trigger.player.countCards('h')<player.countCards('h')){
            player.line(trigger.player);
            trigger.player.gain(game.createCard('sha'),'gain2');
        }
    },
            },
            "圣_shoujie":{
                trigger:{
                    target:"useCardToTargeted",
                },
                forced:true,
                filter:function (event,player){
        return event.player!=player;
    },
                content:function (){
        player.gainPlayerCard('he',trigger.player,Infinity,true); 
        trigger.player.addTempSkill('圣_shoujie_mark');
    },
                group:"圣_shoujie_damage",
                subSkill:{
                    mark:{
                        sub:true,
                    },
                    damage:{
                        trigger:{
                            player:"damageEnd",
                        },
                        forced:true,
                        filter:function (event,player){
                return event.source.hasSkill('圣_shoujie_mark')&&
                    event.source.isAlive()&&
                    player.countCards('he')>0;
            },
                        content:function (){
                trigger.source.removeSkill('圣_shoujie_mark');
                trigger.source.gainPlayerCard(player,'he',Infinity,true);
            },
                        sub:true,
                    },
                },
            },
            "圣_yanyu":{
                init:function (player){
        player.storage.圣_yanyu=0;
    },
                audio:"ext:混沌界:2",
                enable:"phaseUse",
                locked:true,
                filter:function (event,player){
        return player.countCards('h',{name:"sha"})>0;
    },
                content:function (){
        'step 0'
        player.showHandcards();
        'step 1'
        var card=player.getCards('h',{name:"sha"});
        player.discard(card);
        player.draw(card.length);
        player.storage.圣_yanyu+=card.length;
        player.markSkill('圣_yanyu');
        player.syncStorage('圣_yanyu');
    },
                group:"圣_yanyu_draw",
                subSkill:{
                    draw:{
                        trigger:{
                            player:"phaseEnd",
                        },
                        forced:true,
                        direct:true,
                        filter:function (event,player){
                return player.storage.圣_yanyu>0;
            },
                        content:function (){
                'step 0'
                event.num=player.storage.圣_yanyu;
                player.chooseTarget('【燕语】：令一名角色摸'+event.num+'张牌',true);
                'step 1'
                if(result.bool){
                    player.logSkill('圣_yanyu');
                    player.line(result.targets[0]);
                    result.targets[0].draw(event.num);
                    player.storage.圣_yanyu=0;
                    player.markSkill('圣_yanyu');
                    player.syncStorage('圣_yanyu');
                }
            },
                        sub:true,
                    },
                },
            },
            
            
            
            
            
            
            
            
            
        },
			},"圣神包");			
	}
		// ---------------------------------------冥魔包------------------------------------------//
	//	if(config.混沌_MMB){
//			game.addCharacterPack({
	//			character:{					
			//	},
	//			skill:{									
//				}
   //    translate:{
//       },
//			},"冥魔包");
//		}

// ---------------------------------------守望先锋------------------------------------------//
		if(config.混沌_OW){
	game.addCharacterPack({
				character:{
									"混沌_ow_D.va":["female","zhongzhuang",2,["ow_jijia","ow_jupao","ow_zihui"],["des:“玩游戏就是要赢！”</br></br></br>D.Va（宋哈娜）曾是一名职业玩家，而现在则利用自己的技巧驾驶一台尖端机甲保卫国家。</br></br>二十年前，韩国遭到一台从东海出现的巨型机甲怪兽的攻击。这台怪物在被击退前对多个沿海城市造成了毁灭性的破坏。为了应对这一威胁，韩国政府部署了一支机械化无人机部队“MEKA”，用以应对未来的智能机械威胁、保卫城市。</br></br>随着一系列袭击事件的不断发生，韩国政府最担心的事情还是发生了。每过几年，那台巨型机械怪兽就会从海中出现袭击韩国和邻国。这台智能机械可以从每一次的遭遇战中学习，使用新武器和能力并且以不同形态出现。尽管韩国每次都能成功将其击退，但这台智能机械并未被彻底摧毁。</br></br>随着智能机械不断进化，它最终干扰了MEKA的无人机控制网络，迫使军方派驾驶员驾驶这些机甲。由于难以找到合适的候选人，政府开始向那些拥有足以操控机甲尖端武器系统的必要反应和本能的国内职业玩家寻求帮助，其中就包括顶尖玩家之一的“D.Va”宋哈娜。作为一名为了获胜不惜一切代价的精英玩家，D.Va从来都不会对对手表现出丝毫的仁慈。</br></br>D.Va将这次新任务视为一款全新的游戏，无所畏惧地和其他MEKA机甲冲向战场，随时准备保卫自己的国家。最近，她开始向她的粉丝直播战斗行动，而这也让她成为了世界巨星。"]],		
									"混沌_ow_Ash":["female","shuchu",3,["Ash","ow_dushe","ow_huhuan"],["des:“想干这行，就得听我的。”</br></br></br>艾什（shi）是死局帮的首脑，她富有野心、精于算计，在江湖上很是吃得开。</br></br>艾什家境优渥，从小便享有特权。她的父母为全球实力雄 厚的众位CEO担任商业顾问和讲师，备受他们的青 睐。然而她的父母对她却不够重视（大多时候都让家中的智械管家鲍勃照顾她），他们确信艾什的成功之路已被妥善铺好。然而她偶然碰到了当地一位名为杰西·麦克雷的恶徒，还经历了一连串突发的犯罪事件，这段经历让她看到了自己真正想要的。智取目标的满足感和安全脱逃的刺激感将她引上了歧路。</br></br>艾什和死局帮的另外三位创始人一起，用越来越大的劫掠目标为自己打出了名声。死局帮飞快的崛起令他们与美国西南部的其他犯罪组织产生了不和，彼此间的遭遇往往会变为暴力相向。在多年的流血冲突后，艾什将几支主要团体的头目召集到了一起。</br></br>艾什看到了在各支派系间提升影响力的可能性。她运用从自己父母的生意上学来的能力为这些团体带来了秩序。她提议各个帮派可以彼此协作（至少不要拔刀相向）。她的原则是：信守承诺，不把法条放在眼里，尊重他人领地，对背叛行径绝不姑息。</br></br>艾什再也不用为与其他帮派的冲突费心思了，现 在的她用一连串大胆的劫掠和行动让自己的名声震动了美国西南部，她登上了政府的最高通缉名单，稳固了自己的江湖地位。"]],
									"混沌_ow_Bob":["male","zhongzhuang",24,["Bob","ow_guanjia"],["unseen"]],
				},
			skill:{
			"Ash":{
			locked:true,
			unique:true,
   charlotte:true,
			group:"Ash_recover",
			subSkill:{
			recover:{
			audio:"ext:混沌界:2",
			trigger:{
			player:"recoverEnd",
			},
			direct:true,
                forced:true,
                unique:true,
                charlotte:true,
                priority:Infinity,
			filter:function (event,player){
			return event.num>0&&Math.random()<=0.5;
			},
			content:function (){
			if(trigger.source.hasSkill('Bob')){
			player.logSkill('Ash_recover_Bob');
			}
			else{
			player.logSkill('Ash_recover');
			}
			},
			},
			recover_Bob:{
			audio:"ext:混沌界:2",
			direct:true,
                forced:true,
                unique:true,
                onremove:true,
                charlotte:true,
                priority:Infinity,
			},
			},
			},
			"Bob":{
			direct:true,
                forced:true,
                unique:true,
                onremove:true,
                charlotte:true,
                priority:Infinity,
			},
			
			            "ow_jijia":{
                mark:true,
                marktext:"盾",
                locked:true,
                intro:{
                    content:"机甲当前护盾：#层<li>你拥有一台可用于作战的机甲；机甲起始拥有4点护盾，护盾可为你抵挡大量伤害；机甲存在时，你无法增加或失去体力值上限且拥有一套全新的技能；当机甲消耗掉所有护盾后，切换回驾驶员形态",
                },
                onremove:function (player){
        player.storage.ow_jijia=0;
    },
                init:function (player){
        player.storage.ow_jijia=4;
    },
    audio:"ext:混沌界:2",
                trigger:{
                    player:["damageBefore","loseHpBefore"],
                },
                forced:true,
                filter:function (event,player){
        return player.storage.ow_jijia>0;
    },
                content:function (){
        "step 0"
        if(player.storage.ow_jijia>=trigger.num){
        player.storage.ow_jijia-=trigger.num;
        player.markSkill('ow_jijia');
        player.syncStorage('ow_jijia');
        trigger.cancel();
        }else{
        player.damage(trigger.num-player.storage.ow_jijia);
        player.storage.ow_jijia=0;
        player.markSkill('ow_jijia');
        player.syncStorage('ow_jijia');
        }
    },
                group:["ow_jijia_maxHp","ow_jijia_dva"],
                subSkill:{
                    maxHp:{
                    audio:"ext:混沌界:2",
                        trigger:{
                            player:["gainMaxHpBefore","loseMaxHpBefore"],
                        },
                        forced:true,
                        direct:true,
                        filter:function (event,player){
        return player.storage.ow_jijia>0;
    },
                        content:function (){
       trigger.cancel();
    },
                        sub:true,
                    },
                    dva:{
                    skillAnimation:true,
                    animationColor:"thunder",
                    audio:"ext:混沌界:2",
                        trigger:{
                            global:["damageBefore","changeHpEnd","loseEnd"],
                            target:"useCardAfter",
                        },
                        direct:true,
                        forced:true,
                        priority:1,
                        filter:function (event,player){
        return player.storage.ow_jijia<=0;
    },
                        content:function (){
                        "step 0"
                        player.removeSkill('ow_jijia');
                        player.removeSkill('ow_jupao');
                        player.removeSkill('ow_zihui');
                        player.addSkill('ow_zhaohuan');
                        player.addSkill('ow_guangqiang');
                        "step 1"
                        player.gainMaxHp();
                        player.recover();
    },
                        sub:true,
                    },
                },
            },
            "ow_jupao":{
                mod:{
                    cardUsable:function (card,player,num){
            if(card.name=='sha') return Infinity;
        },
                    globalFrom:function (from,to,distance){
            return distance+=(from.storage.ow_jupao);
        },
                },
                mark:false,
                init:function (player){
        player.storage.ow_jupao=0;
    },
                audio:"ext:混沌界:2",
                trigger:{
                    player:"useCard",
                },
                forced:true,
                direct:true,
                filter:function (event,player){
         return event.card&&event.card.name=='sha'&&_status.currentPhase==player;
    },
                content:function (){
            player.storage.ow_jupao++;
            player.markSkill("ow_jupao");
            player.syncStorage("ow_jupao");
    },
                group:"ow_jupao_After",
                subSkill:{
                    After:{
                        trigger:{
                            player:"phaseAfter",
                        },
                        direct:true,
                        forced:true,
                        priority:100,
                        content:function (){
        player.storage.ow_jupao=0;
        player.markSkill("ow_jupao");
        player.syncStorage("ow_jupao");
          },
                        sub:true,
                    },
                },
            },
            "ow_zihui":{
                skillAnimation:true,
                animationColor:"fire",
                audio:"ext:混沌界:2",
                enable:"phaseUse",
                usable:1,
                locked:true,
                selectTarget:-1,
                filter:function (event,player){
        return player.storage.ow_jijia>0;
    },
                filterTarget:function (card,player,target){
        return target!=player;
    },
                reverseOrder:true,
                content:function (){
        "step 0"
        target.chooseToDiscard([1,player.storage.ow_jijia],'he').ai=function(card){
            if(get.damageEffect(target,player,target)>=0){
                if(target.hasSkillTag('maixie')){
                    if(ui.selected.cards.length) return 0;
                }
                else{
                    return 0;
                }
            }
            if(player.hasSkillTag('notricksource')) return 0;
            if(target.hasSkillTag('notrick')) return 0;
            if(card.name=='tao') return 0;
            if(target.hp==1&&card.name=='jiu') return 0;
            if(get.type(card)!='basic'){
                return 10-get.value(card);
            }
            return 8-get.value(card);
        };
        "step 1"
        if(!result.bool||result.cards.length<player.storage.ow_jijia){
            if(result.bool) target.damage(player.storage.ow_jijia-result.cards.length,'fire');
            else target.damage(player.storage.ow_jijia);
        }
        if(target==targets[targets.length-1]){
        player.removeSkill('ow_jijia');
        player.removeSkill('ow_jupao');
        player.removeSkill('ow_zihui');
        player.addSkill('ow_zhaohuan');
        player.addSkill('ow_guangqiang');
        player.gainMaxHp();
        player.recover();
        }
    },
                ai:{
                    basic:{
                        order:7,
                        useful:[5,1],
                    },
                    result:{
                        target:function (player,target){
                if(target.hasSkillTag('nothunder')) return 0;
                if(player.hasUnknown(2)) return 0;
                var nh=target.countCards('he');
                if(target==player) nh--;
                if(nh==2) return -2.5;
                if(nh==1) return -3;
                if(nh==0) return -4;
                return -2;
            },
                    },
                    tag:{
                        damage:1,
                        natureDamage:1,
                        thunderDamage:1,
                        multitarget:1,
                        multineg:1,
                        discard:2,
                        loseCard:2,
                    },
                },
            },					
            "ow_guangqiang":{
                mod:{
                    attackFrom:function (from,to,distance){
						return distance-=1;
					},
                    cardUsable:function (card,player,num){
						if(card.name=='sha') return num+1;
					}
				},
            },
            "ow_zhaohuan":{
                intro:{
                    content:"当前已造成#点伤害",
                },
                onremove:function (player){
        player.storage.ow_zhaohuan=0;
    },
                init:function (player){
        player.storage.ow_zhaohuan=0;
    },
                group:["ow_zhaohuan_kill","ow_zhaohuan_damage"],
                skillAnimation:true,
                animationColor:"thunder",
                audio:"ext:混沌界:2",
                trigger:{
                    source:["damageAfter","dieAfter"],
                },
                forced:true,
                direct:true,
                priority:-1,
                filter:function (event,player){
        return player.storage.ow_zhaohuan>=3;
    },
                content:function (){
        "step 0"
        player.loseMaxHp();
        "step 1"
        player.removeSkill('ow_zhaohuan');
        player.removeSkill('ow_guangqiang');
        player.addSkill('ow_jijia');
        player.addSkill('ow_jupao');
        player.addSkill('ow_zihui');
    },
                subSkill:{
                    kill:{
                        trigger:{
                            source:"dieEnd",
                        },
                        direct:true,
                        forced:true,
                        priority:100,
                        filter:function (event,player){
        return player.storage.ow_jijia<0&&
        event.card&&event.card.name=='sha';
    },
                        content:function (){
        player.storage.ow_zhaohuan+=3;
        player.markSkill('ow_zhaohuan');
        player.syncStorage('ow_zhaohuan');
    },
                        sub:true,
                    },
                    damage:{
                        trigger:{
                            source:"damageEnd",
                        },
                        direct:true,
                        forced:true,
                        priority:100,
                        filter:function (event,player){
        return event.num>0&&player.storage.ow_jijia<=0&&
        event.card&&event.card.name=='sha';
    },
                        content:function (){
        player.storage.ow_zhaohuan+=trigger.num;
        player.markSkill('ow_zhaohuan');
        player.syncStorage('ow_zhaohuan');
    },
                        sub:true,
                    },
                },
            },
            "ow_dushe":{
            audio:"ext:混沌界:2",
                trigger:{
                    player:"phaseAfter",
                },
                forced:true,
                priority:-1,
                direct:true,
                content:function (){
        "step 0"
        if(player.hasSkill('ow_dushe_miaozhun')){
            player.removeSkill('ow_dushe_miaozhun');
            player.addSkill('ow_dushe_banzidong');
            event.finish();
        }
        "step 1"
        if(player.hasSkill('ow_dushe_banzidong')){
            player.removeSkill('ow_dushe_banzidong');
            player.addSkill('ow_dushe_miaozhun');
            event.finish();
        }
    },
                group:"ow_dushe_add",
                subSkill:{
                    add:{
                        trigger:{
                            global:"gameStart",
                        },
                        forced:true,
                        direct:true,
                        priority:100,
                        content:function (){
        player.addSkill('ow_dushe_banzidong');
    },
                        sub:true,
                    },
                    miaozhun:{
                        marktext:"狙",
                        locked:true,
                        mark:true,
                        intro:{
                            content:"瞄准模式：你的攻击范围+1；每当你使用【杀】时，你可以弃置一张牌令此【杀】不可闪避",
                        },
                        mod:{
                            attackFrom:function (from,to,distance){
            return distance-=1;
        },
                        },
                        audio:"ext:混沌界:2",
                        trigger:{
                            player:"shaBegin",
                        },
                        direct:true,
                        forced:true,
                        filter:function (event,player){
        return player.countCards('h')>0;
    },
                        priority:-1,
                        content:function (){
        "step 0"
        player.chooseToDiscard('是否弃置一张牌令此杀不可闪避？','he').set('ai',function(card){
            return 6-get.useful(card);
        });
        "step 1"
        if(result.bool==true) player.logSkill('ow_dushe_miaozhun');
        if(result.bool==true) trigger.directHit=true;
    },
                        sub:true,
                    },
                    banzidong:{
                    audio:"ext:混沌界:2",
                        marktext:"霰",
                        locked:true,
                        mark:true,
                        intro:{
                            content:"半自动模式：每当你使用一张【杀】时，你可以对目标使用一张锦囊牌。若如此做，此【杀】不计入出牌次数限制",
                        },
                        trigger:{
                            player:"shaBegin",
                        },
                        forced:true,
                        direct:true,
                        filter:function (event,player){
              return  player.countCards('h',{type:'trick'})>0||player.countCards('h',{type:'delay'})>0;
            },
                        priority:100,
                        content:function (){
        "step 0"
        player.chooseToUse('是否对'+get.translation(trigger.target)+'使用一张锦囊牌？',{type:'trick'},trigger.target);
        "step 1"
        if(result.bool==true) player.logSkill('ow_dushe_banzidong');
        if(result.bool==true) trigger.player.getStat().card.sha--;
    },
                        sub:true,
                    },
                },
            },
            "ow_guanjia":{
                direct:true,
                nobracket:true,
                group:["ow_guanjia_sha","ow_guanjia_source"],
                subSkill:{
                    sha:{
                        trigger:{
                            global:"phaseBegin",
                        },
                        forced:true,
                        filter:function (event,player){
        return event.player!=player&&!event.player.hasSkill('Ash');
    },
                        content:function (){
        player.useCard({name:"sha"},trigger.player);
    },
                        sub:true,
                    },
                    source:{
                        trigger:{
                            source:"damageBefore",
                        },
                        forced:true,
                        filter:function (event,player){
        return event.player.hasSkill('Ash');
    },
                        content:function (){
        trigger.cancel();
    },
                        sub:true,
                    },
                    draw:{
                        trigger:{
                            global:"dieAfter",
                        },
                        direct:true,
                        forced:true,
                        filter:function (event,player){
                return event.source&&event.source.hasSkill('Bob');
            },
                        content:function (){
                        trigger.source.line(player);
                        player.draw(2);
            },
                        sub:true,
                    },
                    die:{
                    trigger:{
                    global:"dieAfter",
                    },
                    forced:true,
                    priority:-100,
                    filter:function (event,player){
                    return event.player.hasSkill('Ash');
                    },
                    content:function (){
                    trigger.player.line(player);
                    player.die();
                    },
                    },
                },
            },
            "ow_huhuan":{
                audio:"ext:混沌界:2",
                skillAnimation:"epic",
                animationColor:"thunder",
                enable:"phaseUse",
                locked:true,
                filterTarget:function (card,player,target){
        return player!=target;
    },
                content:function (){
        "step 0"
        target.init('混沌_ow_Bob');
        player.addSkill('ow_guanjia_draw');
        target.addSkill('ow_guanjia_die');
        "step 1"
        player.awakenSkill('ow_huhuan');
    },
            },
            
            
            
			},
			translate:{
			"混沌_ow_D.va":"D.va",
			"混沌_ow_Ash":"艾什",
			"混沌_ow_Bob":"鲍勃",
			
			
			            "ow_jijia":"机甲",
            "ow_jijia_info":"锁定技，你拥有一台可用于作战的机甲；机甲起始拥有4点护盾，护盾可为你抵挡大量伤害；机甲存在时，你无法增加或失去体力值上限且拥有一套全新的技能；当机甲消耗掉所有护盾后，你增加一点体力值上限并恢复一点体力，然后切换回驾驶员形态",
            "ow_jupao":"聚炮",
            "ow_jupao_info":"锁定技，你使用【杀】无次数限制；每当你于回合内主动使用一张【杀】时，你的进攻距离-1",
            "ow_zihui":"自毁",
            "ow_zihui_info":"锁定技，出牌阶段（限一次），若你拥有机甲，你可以令其他所有角色依次选择弃置X张牌并受到Y点伤害。若如此做，该技能结算后，摧毁你的机甲（X为你的机甲护盾数量；Y为X-目标弃置的卡牌数量）",				
            "ow_guangqiang":"光枪",
            "ow_guangqiang_info":"锁定技，你的攻击范围+1，使用【杀】的次数上限+1",
            "ow_zhaohuan":"召唤",
            "ow_zhaohuan_info":"锁定技，每当你使用【杀】击杀了一名其他角色或者使用【杀】累计造成的伤害量达到了三点或更多后，你失去一点体力值上限并重新召回机甲",
            "ow_dushe":"毒蛇",
            "ow_dushe_info":"转换技：①锁定技，每当你使用【杀】指定目标时，你可以对其率先使用一张锦囊牌。若如此做，此【杀】不计入出牌次数限制；②锁定技，你的攻击范围+1；每当你使用【杀】时，你可以弃置一张牌令此【杀】不可闪避",
            "ow_guanjia":"管家",
            "ow_guanjia_info":"鲍勃会于其他角色的准备阶段视为对其使用一张【杀】（艾什大小姐除外）；鲍勃无法对艾什大小姐造成伤害",
            "ow_huhuan":"呼唤",
            "ow_huhuan_info":"限定技：出牌阶段，你可以将一名其他角色的武将牌替换为管家“鲍勃”；“鲍勃”拥有24点体力值上限；“鲍勃”会于除你以外所有角色的准备阶段视为对其使用【杀】；每当“鲍勃”造成击杀后你摸两张牌；当你阵亡后，“鲍勃”死亡",
			},
			},"守望先锋")
		}
		// ---------------------------------------英雄联盟-----------------------------------------//
		if(config.混沌_LOL){
			game.addCharacterPack({
				character:{
					"混沌_lol_Draven":["male","nuokesasi",3,["lol_feifu","lol_chongci"],["des:““做到最牛”就是我所订下的每日标准，不管到哪儿都是”——德莱文</br></br></br>不同于他的兄长德莱厄斯，战场上的胜利对德莱文来说是绝对不够的。他热切 渴望着人们的承认，喝彩，以及荣耀。他先是在诺克萨斯军队里寻求成名的机会，可他的戏剧天资却被严重埋没。带着能与世界分享“德莱文”这个大名的渴望，他将注意力转移到了监狱体系。在那里，他将枯燥无味的例行公事转变成了一个前所未见的奇特景观，并由此获得了梦寐以求的名气。</br></br>在德莱文首次行刑的时候，他下令让死刑犯逃命。此举震惊了在场的旁观者们。正当死刑犯刚要从视野里消失时，德莱文用一记无可挑剔的飞斧结果了他。很快，德莱文的所有行刑都变成了一个考验，一个诺克萨斯的囚犯们为了最后的一线生机而奔跑的考验。他把这个考验当做他的个人舞台，并且将行刑转变成了一种主流的娱乐方式。他鼓动观众们陷入狂热状态，与此同时，走投无路的囚犯们疯了似地想要逃离他。可他们从来没有成功过。德莱文对诺克萨斯行刑官的那套庄严肃穆的黑色制服非常抵制，他披上了一套醒目的服饰，并开发出了一些浮华的标志性步伐来彰显他自己。人群们聚集在一起，观看德莱文行刑，并且有关他的杰作的故事也在飞速散播着。随着他人气的增长，他早已膨胀的自负也变本加厉。他应该属于万众瞩目的中心——英雄联盟。在很久之前，他的野心就不满足于仅仅在诺克萨斯扬名了。德莱文的光荣事迹，应该展示给全世界！这就是他所作出的决定。"]],
					"混沌_lol_Ashe":["female","fuleierzhuode",3,["lol_bingshuang","lol_wanjian"],["des:源计划：联合——艾希：</br>艾希曾在一场集团战争的前线上见证了源计划以人类作为代价实现自己的野心。现在她是反抗组织基因动力的领袖，艾希的目标就是要颠覆这个最强大的集团。"]],
					"混沌_lol_Xinzhao":["male","demaxiya",4,["lol_zhuaji"],["des:赵信是效忠于光盾王朝的坚毅勇士。他曾经沦落于诺克萨斯的角斗场，在无数次角斗中得以幸存。被德玛西亚军队解救以后，他便发誓为这群勇敢的解放者贡献生命和忠诚。最称手的三爪长枪相伴，赵信现在为自己的第二祖国而战，一往无前，暴虎冯河。"]],
					"混沌_lol_Yasuo":["male","aiouniya",3,["lol_zhangang","lol_taqian"],["des:无"]],
				},
				skill:{
				"lol_feifu":{
                marktext:"斧",
                intro:{
                    content:function (storage){
            if(storage>0) return "当前持有"+storage+"把“斧”";
            if(storage<0) return "当前持有"+storage+"把“斧”";
            return "当前未持有“斧”";
        },
                },
                init:function (player){
        player.storage.lol_feifu=0;
    },
                audio:"ext:混沌界:2",
                enable:"phaseUse",
                locked:true,
                filterCard:true,
                position:"he",
                check:function (card){
        if(card.name=='du'&&player.hp>2) return 20;
        return 4-get.value(card);
    },
                filter:function (event,player){
        return player.countCards("he")>0&&
        player.storage.lol_feifu<2;
    },
                content:function (){
       player.storage.lol_feifu++;
        player.markSkill("lol_feifu");
        player.syncStorage("lol_feifu");
    },
         ai:{
         result:{
         player:1,
         },
         },
                group:["lol_feifu_miss","lol_feifu_damage"],
                subSkill:{
                    damage:{
                        audio:"ext:混沌界:2",
                        trigger:{
                            source:"damageBefore",
                        },
                        direct:true,
                        filter:function (event,player){
            return player.storage.lol_feifu>0&&event.card&&event.card.name=="sha";
    },
                        forced:true,
                        priority:100,
                        content:function (){
                trigger.num++;
    },
                        sub:true,
                    },
                    "miss":{
                        audio:"ext:混沌界:2",
                        trigger:{
                            player:"useCardAfter",
                        },
                        filter:function (event,player){
            return player.storage.lol_feifu>0&&event.card&&event.card.name=="sha";
    },
                        direct:true,
                        forced:true,
                        content:function (){
        player.storage.lol_feifu--;
        player.markSkill("lol_feifu");
        player.syncStorage("lol_feifu");
            },
                        sub:true,
                    },
                },
            },
            "lol_chongci":{
                mod:{
                    globalFrom:function (from,to,distance){
            return distance-=(from.storage.lol_chongci);
        },
                },
                intro:{
                    content:function (storage){
            if(storage>0) return "你的进攻距离+"+storage;
            if(storage<0) return "你的进攻距离"+storage;
            return "你的进攻距离无变化";
        },
                },
                init:function (player){
        player.storage.lol_chongci=0;
    },
                audio:"ext:混沌界:2",
                enable:"phaseUse",
                usable:1,
                locked:true,
                filterCard:true,
                position:"he",
                check:function (card){
        if(card.name=='du'&&player.hp>2) return 20;
        return 4-get.value(card);
    },
                group:['lol_chongci_End','lol_chongci_sha'],
                filter:function (event,player){
         return player. countCards('h')>0;
    },
                content:function (){
            player.storage.lol_chongci++;
            player.markSkill("lol_chongci");
            player.syncStorage("lol_chongci");
    },
                subSkill:{
                    End:{
                        trigger:{
                            player:"phaseAfter",
                        },
                        direct:true,
                        forced:true,
                        priority:100,
                        content:function (){
        player.storage.lol_chongci=0;
        player.markSkill("lol_chongci");
        player.syncStorage("lol_chongci");
          },
                        sub:true,
                    },
                    sha:{
                    trigger:{
                    player:"shaBegin",
                },
                forced:true,
                direct:true,
                filter:function (event,player){
         return player.storage.lol_feifu>0;
    },
                content:function (){
        "step 0"
        player.chooseToDiscard(get.prompt('lol_chongci'),'he').set('ai',function(card){
            return 6-get.useful(card);
        }).set('logSkill',['lol_chongci']);
        "step 1"
        if(result.bool){
            trigger.player.getStat().card.sha--;
            player.storage.lol_chongci++;
            player.markSkill("lol_chongci");
            player.syncStorage("lol_chongci");
        }
    },
    sub:true,
                    },
    },
				},
				"lol_bingshuang":{
                mod:{
                    cardUsable:function (card,player,num){
            if(card.name=='sha') return 4;
        },
                    attackFrom:function (from,to,distance){
            return distance-1;
        },
                },
                group:"lol_bingshuang_damage",
                audio:"ext:混沌界:2",
                trigger:{
                    source:"damageBefore",
                },
                forced:true,
                priority:100,
                filter:function (event,player){
        return event.card&&event.card.name=='sha'&&event.num>0;
    },
                content:function (){
        "step 0"
        trigger.player.addTempSkill('lol_bingshuang_mark',{player:"phaseBefore"});
        "step 1"
        trigger.player.storage.lol_bingshuang_mark++;
        trigger.player.markSkill('lol_bingshuang_mark');
        trigger.player.syncStorage('lol_bingshuang_mark');
    },
                subSkill:{
                    mark:{
                    marktext:"霜",
                        init:function (player){
        player.storage.lol_bingshuang_mark=0;
    },
                        
                        intro:{
                            content:"该角色的防御距离-#",
                        },
                        mod:{
                            globalTo:function (from,to,distance){
            return distance-=(to.storage.lol_bingshuang_mark);
        },
                        },
                        sub:true,
                    },
                    damage:{
                        trigger:{
                            source:"damageBefore",
                        },
                        forced:true,
                        priority:-1,
                        filter:function (event,player){
        return event.card&&event.card.name=='sha'&&event.num>1;
    },
                        content:function (){
                "step 0"
                trigger.player.storage.lol_bingshuang_mark+=trigger.num-1;
        trigger.player.markSkill('lol_bingshuang_mark');
        trigger.player.syncStorage('lol_bingshuang_mark');
                "step 1"
        trigger.num=1;
    },
                        sub:true,
                    },
                },
            },
            "lol_wanjian":{
                audio:"ext:混沌界:3",
                enable:"phaseUse",
                usable:true,
                filterCard:true,
                position:"he",
                locked:true,
                viewAs:{
                    name:"wanjian",
                },
                prompt:"将一张牌当做【万箭齐发】使用",
                check:function (){return 1},
                ai:{
                    wuxie:function (target,card,player,viewer){
            if(get.attitude(viewer,target)>0&&target.countCards('h','shan')){
                if(!target.countCards('h')||target.hp==1||Math.random()<0.7) return 0;
            }
        },
                    basic:{
                        order:9,
                        useful:1,
                        value:5,
                    },
                    result:{
                        target:function (player,target){
                if(player.hasUnknown(2)&&get.mode()!='guozhan') return 0;
                var nh=target.countCards('h');
                if(get.mode()=='identity'){
                    if(target.isZhu&&nh<=2&&target.hp<=1) return -100;
                }
                if(nh==0) return -2;
                if(nh==1) return -1.7
                return -1.5;
            },
                    },
                    tag:{
                        respond:1,
                        respondShan:1,
                        damage:1,
                        multitarget:1,
                        multineg:1,
                    },
                },
            },
            "lol_zhuaji":{
                mod:{
                    cardUsable:function (card,player,num){
            if(card.name=='sha') return num+2;
        },
                },
                init:function (player){
        player.storage.lol_zhuaji_damage=0;
        player.storage.lol_zhuaji_recover=0;
    },
                trigger:{
                    player:"useCardEnd",
                },
                direct:true,
                forced:true,
                filter:function (event,player){
        return player.storage.lol_zhuaji_damage>0&&
            _status.currentPhase==player&&
            event.card&&event.card.name=='sha';
    },
                content:function (){
        player.storage.lol_zhuaji_damage--;
        player.syncStorage('lol_zhuaji_damage');
        player.markSkill('lol_zhuaji_damage');
    },
                group:["lol_zhuaji_audio","lol_zhuaji_Before","lol_zhuaji_source","lol_zhuaji_haf","lol_zhuaji_hujia","lol_zhuaji_After","lol_zhuaji_recover"],
                subSkill:{
                audio:{
                audio:"ext:混沌界:3",
                trigger:{
                    player:"useCard",
                },
                forced:true,
                filter:function (event,player){
        return player.storage.lol_zhuaji_damage>0&&
            _status.currentPhase==player&&
            event.card&&event.card.name=='sha';
    },
                content:function (){},
                },
                    Before:{
                        trigger:{
                            player:"phaseBefore",
                        },
                        forced:true,
                        direct:true,
                        priority:100,
                        content:function (){
                player.storage.lol_zhuaji_damage+=3-player.storage.lol_zhuaji_damage;
                player.syncStorage('lol_zhuaji_damage');
                player.markSkill('lol_zhuaji_damage');
            },
                        sub:true,
                    },
                    haf:{
                    trigger:{
        player:"shaBegin",
    },
    forced:true,
    direct:true,
    priority:100,
    filter:function (event,player){
        return player.storage.lol_zhuaji_damage==1&&
            _status.currentPhase==player;
    },
    content:function (){
        trigger.directHit=true;
        game.log(trigger.player,'被',player,'“击飞”了');
    },
                    },
                    source:{
                    audio:"ext:混沌界:2",
                        trigger:{
                            source:"damageBefore",
                        },
                        direct:true,
                        forced:true,
                        priority:100,
                        filter:function (event,player){
                return player.storage.lol_zhuaji_damage>0&&
                event.card&&event.card.name=='sha';
            },
                        content:function (){
                trigger.num++;
            },
                        sub:true,
                    },
                    hujia:{
                        trigger:{
                            source:"damageBefore",
                        },
                        forced:true,
                        direct:true,
                        priority:-2,
                        content:function (){
                var num=Math.min(trigger.player.hujia); 
                if(num>0){ 
                    trigger.num+=trigger.num;
                }
            },
                        sub:true,
                    },
                    After:{
                        trigger:{
                            player:"phaseAfter",
                        },
                        direct:true,
                        forced:true,
                        priority:100,
                        filter:function (event,player){
        return player.storage.lol_zhuaji_recover>0;
    },
                        content:function (){
        player.storage.lol_zhuaji_recover=0;
        player.syncStorage('lol_zhuaji_recover');
        player.markSkill('lol_zhuaji_recover');
    },
                        sub:true,
                    },
                    recover:{
                        trigger:{
                            player:"useCard",
                        },
                        forced:true,
                        direct:true,
                        priority:-1,
                        filter:function (event,player){
        return _status.currentPhase==player&&
            event.card&&event.card.name=='sha';
    },
                        content:function (){
        "step 0"
        player.storage.lol_zhuaji_recover++;
        player.syncStorage('lol_zhuaji_recover');
        player.markSkill('lol_zhuaji_recover');
        "step 1"
        if(player.storage.lol_zhuaji_recover>=3){
            player.storage.lol_zhuaji_recover=0;
            player.syncStorage('lol_zhuaji_recover');
            player.markSkill('lol_zhuaji_recover');
            player.recover();
        }
    },
                        sub:true,
                    },
                },
            },
            "lol_zhangang":{
            audio:"ext:混沌界:3",
                init:function (player){
        player.storage.lol_zhangang=0;
    },
                intro:{
                    content:"当前为#层",
                },
                trigger:{
                    player:"useCardToPlayered",
                },
                forced:true,
                priority:100,
                filter:function (event,player){
        return event.card.name=='sha'&&
            _status.currentPhase==player;
    },
                check:function (event,player){
        return get.attitude(player,event.target)<=0;
    },
                content:function (){
        player.storage.lol_zhangang++;
        player.markSkill('lol_zhangang');
        player.syncStorage('lol_zhangang');
    },
                group:["lol_zhangang_haf","lol_zhangang_After"],
                subSkill:{
                After:{
                        trigger:{
                            player:"phaseAfter",
                        },
                        direct:true,
                        forced:true,
                        priority:100,
                        filter:function (event,player){
        return player.storage.lol_zhangang>0;
    },
                        content:function (){
        player.storage.lol_zhangang=0;
        player.markSkill('lol_zhangang');
        player.syncStorage('lol_zhangang');
    },
                        sub:true,
                    },
                    haf:{
                    audio:"ext:混沌界:3",
                        trigger:{
                            player:"shaBegin",
                        },
                        forced:true,
                        direct:true,
                        priority:1,
                        filter:function (event,player){
        return player.storage.lol_zhangang==3&&
            _status.currentPhase==player;
    },
                        content:function (){
        "step 0"
        player.storage.lol_zhangang=0;
        player.markSkill('lol_zhangang');
        player.syncStorage('lol_zhangang');
        "step 1"
        trigger.target.judge(function(card){
            if(get.suit(card)=='diamond') return -2;
            return 2;
        })
        "step 2"
        if(result.judge<2){
            player.chooseTarget(get.prompt2('lol_zhangang'),function(card,player,target){
            return get.distance(trigger.target,target)<=1&&trigger.target!=target&&player!=target;
        }).ai=function(target){
            return get.damageEffect(target,player,player,'thunder')+0.1;
        }
        }else{event.finsh;true;}
        "step 3"
        if(result.bool){ 
            var targets=result.targets;
            player.line(targets,trigger.card.nature);
            player.logSkill('lol_zhangang_haf');
            trigger.targets.addArray(targets);
          }else{event.finsh;true;}
        "step 4"
        trigger.directHit=true;
        game.log(trigger.targets,'被',player,'“击飞”了');
    },
                        sub:true,
                    },
                },
            },
            "lol_taqian":{
            audio:"ext:混沌界:3",
                enable:"phaseUse",
                changeSeat:true,
                filter:function (event,player){
                return player.countCards('he')>2;
                },
                filterTarget:function (card,player,target){
        return player!=target&&
            get.distance(player,target)<=1&&
                !target.hasSkill('lol_taqian_mark');
    },
                filterCard:true,
                selectCard:2,
                position:"he",
                check:function (card){
        return 4-get.value(card);
    },
                content:function (){
        "step 0"
        target.addTempSkill('lol_taqian_mark');
        game.swapSeat(player,target);
        "step 1"
        game.delay(3);
        player.useCard({name:"sha"},target);
    },
                ai:{
                    order:5,
                    result:{
                        player:function (player,target){
                var att=get.attitude(player,target);
                if(target==player.previous&&att>0) return att;
                if(target==player.next&&att<0) return -att;
                var att2=get.attitude(player,player.next);
                if(target==player.next.next&&att<0&&att2<0) return -att-att2;
                return 0;
            },
                    },
                },
                subSkill:{
                mark:{
                mark:true,
                marktext:"踏",
                unique:true,
                charlotte:true,
                intro:{
                    content:"本回合内无法再次选取该角色为目标",
                },
                },
                },
            },
            
            
            
            
            
            
            
            
				
				
				
				},
				characterTitle:{
		 	"混沌_lol_Draven":"荣耀行刑官",
				"混沌_lol_Ashe":"寒冰射手",
				"混沌_lol_Xinzhao":"德邦总管",
				"混沌_lol_Yasuo":"疾风剑豪",
				},
				
				
				
				
				translate:{				
				"混沌_lol_Draven":"德莱文",
				"混沌_lol_Ashe":"艾希",
				"混沌_lol_Xinzhao":"赵信",
				"混沌_lol_Yasuo":"亚索",
				
				 "lol_feifu":"飞斧",
				 "lol_feifu_info":"锁定技，出牌阶段，若你所持有的“斧”少于两把，你可以弃置一张牌获得一把“斧”；每当你使用【杀】时，移除一把“斧”；若此【杀】造成了伤害，则令此伤害+1，然后你重新获得一把“斧”",
				 "lol_chongci":"冲刺",
				 "lol_chongci_info":"锁定技，每当你使用【杀】时，若你已持有“斧”，你可以弃置一张牌令此次【杀】不计入出牌次数限制，然后于本回合内你的进攻距离+1；出牌阶段(限一次)，你可以弃置一张牌，令你的进攻距离+1",
				 "lol_bingshuang":"冰霜",
     "lol_bingshuang_info":"锁定技，你的基础攻击范围为2；你使用【杀】的基数上限为4；每当你使用【杀】造成伤害后，受伤目标于其下回合开始前的防御距离-1；你使用【杀】可造成的伤害仅为1，但会令受伤目标的防御距离额外-X（X为额外伤害量）",
     "lol_wanjian":"万箭",
     "lol_wanjian_info":"锁定技，出牌阶段（限一次），你可以将一张牌当做【万箭齐发】使用",
     "lol_zhuaji":"爪击",
     "lol_zhuaji_info":"锁定技，你可以额外使用两张【杀】；你于回合内使用的前三张【杀】造成的伤害+1，第三次【杀】附带“击飞”效果（无法闪避）；你对拥有“护甲”的角色造成的伤害均翻倍；每当你于回合内使用了三张【杀】时，你恢复一点体力",
     "lol_zhangang":"斩钢",
            "lol_zhangang_info":"锁定技，每当你于回合内使用一张【杀】指定目标时，你获得一层“斩钢闪”层数；你使用的附带第三层“斩钢闪”层数的【杀】附带“击飞”效果(不可闪避)并令目标进行一次判定：若判定结果为♦️，则你可以令与该角色距离为一的一名其他角色追加为此【杀】目标",
            "lol_taqian":"踏前",
            "lol_taqian_info":"锁定技，出牌阶段，你可以弃置两张卡牌与一名距离为一的角色交换位置。若如此做，视为你对其使用一张【杀】且本回合内无法再次选取其为此技能的目标",
				}
				},"英雄联盟");
			}
		},config:{"混沌_SSB":{"name":"【圣神包】","init":true,"intro":"【圣神包】<li>圣神将数量：70位<li>圣神将来源：三国<li>分包框架：4勾玉；3技能(主动技(核心技能)、被动技、辅助技)；技能均为锁定技；<li>分包描述：【圣神包】为本扩展的核心主体，其所包含的神将均为“以三国杀原武将的基础上自制技能”而打造出的“圣神将”。本分包原为同名扩展，在半年前进行了一次彻底的翻新，剔除了所有“圣神装备”并“全面重做”了所有的圣神将，现与【英雄联盟】【守望先锋】共存于【混沌界】<li>背景故事：</br>“你知道，在人界之上，还存在着数不胜数的圣神将吗？”</br>他们，原本只是一群普通的不能再普通的正常人类，他们也曾没落过、也曾辉煌过……但最终，却也因为各种各样的事迹，被“天”所选中，化作了一人之下，万人之上的“圣神”，归入了那凡人永远无法触及的殿堂----“圣神之界”。他们在另一个位面上，俯首观望着渺渺众生……"},"混沌_LOL":{"name":"【英雄联盟】","init":true,"intro":"【英雄联盟】<li>角色数量：4位<li>角色来源：英雄联盟<li>分包框架：5勾玉1负面技；4勾玉1技能；3勾玉2技能；<li>分包描述：【英雄联盟】为本扩展的另类分包。该分包内的技能均为本人自行DIY并制作；现与【圣神包】【守望先锋】共存于【混沌界】<li>背景故事：</br>“当灾难真正的来临时，神又在哪里呢？”</br>在无边无际浩瀚宇宙中，存在着无数个不同位面的“小世界”，每一个“小世界里”，都有之相对的“世界规则”。在这其中的某一个世界中，战争纷乱，狼烟四起，先进的科技与神奇魔法共存于此。这，就是瓦洛兰大陆，一个属于【英雄联盟】的特殊宇宙……"},"混沌_OW":{"name":"【守望先锋】","init":true,"intro":"【守望先锋】<li>角色数量：2位<li>角色来源：守望先锋<li>分包框架：5勾玉1负面技；4勾玉1技能；3勾玉2技能；<li>分包描述：【守望先锋】为本扩展的另类分包。该分包内的技能均为本人自行DIY并制作；现与【圣神包】【英雄联盟】共存于【混沌界】<li>背景故事((ಡωಡ) 不要问我为什么专门用译制腔给d.va写了篇短篇小说！一天不玩守望屁股我就要死了！！)：</br>“噢！天呐……我究竟在哪里？！”</br>某一天，宋哈娜(D.va)像正常一样驾驶着M.E.K.A机甲在韩国釜山的边境巡视，她瞄了眼着前方空旷的天空，又看了看仅扫描到自己的雷达表盘，叼着棒棒糖无奈的瘫在了驾驶台上</br>“自从上次那些智械机甲怪物大举进攻韩国距离现在都已经半年过去了，釜山依旧是如此的和平。虽然平凡的日子很可贵，但是好无聊啊……一圈又一圈的巡视空荡的城市边缘还不如回家打游戏来的痛苦呢……哼……”</br>哈娜看了看依旧平静的蓝天，撅起了樱挑小嘴</br>“好想找点事做啊！！！”</br>“滴！……滴！……”</br>在哈娜刚刚释放完压力，静如止水的雷达表盘突然像是发了疯一般闪烁警告，转瞬间的变故把哈娜吓了一跳，嘴里棒棒糖险些掉落</br>“怎么回事？！难道说我把机甲弄坏了？！不会吧我的分贝也没那么高吧？！”</br>哈娜连忙查看仪表盘情况，却发现监控雷达上显示在距离自己五千码处的海面有一种不知名的东西正在以自己为中心向四周呈散射式释放莫名的能量</br>“这是…什么……是智械的机甲航母吗？！上天这是真的听到了我的抱怨想给我点事做？！”哈娜调整机甲状态，脸上露出了兴奋的神色</br>“那么好吧！D.va号！全速前进！呕吼！”</br>哈娜兴奋的推进握把，M.E.K.A机甲伴随着哈娜兴奋的呼喊尽全力的向目标冲刺，在“宁静”的天空上划开了一道道晶莹的“水波“……</br>不一会儿，哈娜便驾驶着机甲就来到了这团“不知名东西”的不远处</br>“噢天……这……这到底是什么东西？！”</br>看着眼前这巨大无比类似“黑洞”一般的东西，哈娜惊讶得合不拢嘴</br>“没有错了，就是这家伙！”</br>哈娜看着仪表盘上与自己相距不远的“能量团”，确认了目标无异后，向韩国陆军特别机动部队总部发去了紧急求助消息。两秒后，机甲的对讲机传来了一个干练的女性声音：</br>“出了什么状况，请讲”</br>“在我现在坐标的地点出现了一个巨大的能量黑洞，正在散射能量波，危险程度未知，不过我所负责的一片地区目前还未有居民受到影响，这个东西看着像是……额……黑洞？虫洞？对！虫洞之类的东西！”</br>“收到，立即反馈”</br>在对方答复完干净利落的挂断消息后，哈娜开始研究起了眼前的巨大“黑洞”</br>“嗯……雷达显示这东西正在散射能量波，但我却并没有刺痛或灼烧感。这种能量缺口该不会真的是虫洞吧？！博士可是研究了一辈子都没搞懂虫洞的原理，如果这真的是虫洞的话……哇哦，简直太酷了！我要把这个场面拍下来发到我的个人主页上！就这么做！”说着，她掏出了一个粉红色兔子外壳的迷你小相机对着黑洞狂拍了几张，然后又熟练地爬出机甲在半空拍了好几张与黑洞的合照。翻看着刚拍下了的漂漂亮亮的自己与黑洞，她笑着满意的点了点头，然后收起相机翻身回到了机甲内</br>“等我回到家立马就上传！配字的话……就写上……嗯……勇敢无畏的宋哈娜发现了前所未有的天然黑洞！她开拓了人类对宇宙和时间的了解！！她是人们的大英雄！！！嘻嘻！完美！”</br>哈娜已经想到了她的这条动态已经会有多少人点赞转发和评论了，会有多少条评论称赞她～一想到这儿她就兴奋的发抖！</br>“不过，话说回来，如果这真的是虫洞的话……那是不是真的会穿越时空？！像莉娜(猎空)那样？！”</br>想起莉娜，哈娜露出了羡慕的神色</br>“我好羡慕她可以改变自己的时间……”</br>哈娜这么想着，突然，一股“如果我靠着这个虫洞能不能获得“时空穿梭能力”的想法油然而生”，在她心里那股打游戏时的“励志杀怪升级打魔王”的热血气息瞬间涌上了心头</br>“'如果…我进去会怎么样？！”</br>她驾驶着M.E.K.A机甲在空中左一圈右一圈的飞着，手不自觉的向前推进着握把</br>“虫洞的对面会有什么？！陌生的黑洞，刺激的冒险？强大的能力？勇者宋哈娜战胜大魔头？！噢天呐，这简直是为我量身定做的冒险游戏！”</br>哈娜就这么想着，机甲已经不自觉的飞到了“虫洞”的不远处</br>“嗖！……呼！……”</br>独特的划过长空的声音从哈娜后方响起，这是M.E.K.A机甲特有的引擎轰鸣声，是“MEKA”小队成员来了！</br>“她们出动很快嘛”</br>哈娜这么想着，操纵握把转身想要去和她们小队成员会合，但是机甲内的刺耳警报声却突如其来</br>“警报！警报！机甲已被未知能量所干扰！警报！警报！机甲已被未知能量所干扰！警……嗞嗞嗞……”</br>机甲像是被击中般，所有按键全部失灵，任由哈娜怎么操控也不起任何作用</br>“噢天！饶了我吧！这又是怎么了？！”</br>刺耳的警报已变成“嗞嗞”的电流声，警告的红灯在驾驶舱内持续闪耀着！“黑洞”此时展现出了刚刚从未有过的强大吸力！像是一只野兽一样吞噬着只“待宰羔羊”！</br>嗖……</br>仅仅转瞬之间，宋哈娜与M.E.K.A机甲便被吞噬的无影无踪，而这巨大的“黑洞”，也像是从未出现般，瞬间消逝，只留下刚刚赶到的“M.E.K.A”小队在空中不知所措……"}},package:{
    character:{
        character:{
        },
        translate:{
        },
    },
    card:{
        card:{
        },
        translate:{
        },
        list:[],
    },
    skill:{
        skill:{
        },
        translate:{
        },
    },
    intro:"<b><span class=\"yellowtext\" style=\"color:#FFFF00\">扩展作者:</span></b><li>贴吧昵称： </br>淡雾云曦<li>Q群昵称：</br> 一心强化老神将，老神将也能1穿7</br></br><b><span class=\"yellowtext\" style=\"color:#FFFF00\">更新日志:</span></b></br>2021年12月6日更新列表</br></br><b><span class=\"yellowtext\" style=\"color:#FFFF00\">新增武将:</span></b></br>【圣神包】</br>神孙策(翻天覆海)；神刘禅(汉兴使命)</br>【英雄联盟】</br>无</br>【守望先锋】</br>无</br></br><b><span class=\"yellowtext\" style=\"color:#FFFF00\">扩展优化:</span></b></br>☆“重置武将牌”效果调整如下：</br>1.弃置判定区所有牌(基本没用)</br>2.解除横置状态</br>3.解除翻面状态</br>4.解除混乱状态</br>5.恢复所有被废除的装备栏</br></br>★神孙策</br>(二觉)新增二次觉醒技能〖魂姿〗，二次觉醒后技能〖英霸〗〖覆海〗〖冯河〗</br>★神夏侯氏</br>(优化)优化技能描述</br>★神姜维</br>(优化)优化技能描述</br>★神孙皓</br>(优化)被动技能【伪隐】效果重做</br>★神王异</br>(优化)调整原画大小</br>★神陆逊</br>(优化)调整原画大小</br>★神卧龙</br>(优化)调整原画大小</br>★神张飞</br>(优化)调整原画大小</br>★神赵云</br>(优化)调整原画大小</br>★神周泰</br>(优化)调整原画大小</br>★神夏侯惇</br>(优化)调整原画大小</br></br></br></br></br><li>扩展分包启动开关：</br>(长按可查看分包描述详情)",
    author:"",
    diskURL:"",
    forumURL:"",
    version:"",
},files:{"character":[],"card":[],"skill":[]}}})